Repository: PlagaMedicum/Ubuntu-Translation-Demo
Catalog: Focal/*/LC_MESSAGES/attr.po
Languages: ru

source: listing attributes of %s
ru: список атрибутов %s

source: getting attribute %s of %s
ru: получение атрибутов %s из %s

source: setting attributes for %s
ru: установка атрибутов для %s

source: setting attribute %s for %s
ru: установка атрибутов %s для %s

source: Usage: %s [-LRSq] -s attrname [-V attrvalue] pathname # set value %s [-LRSq] -g attrname pathname # get value %s [-LRSq] -r attrname pathname # remove attr %s [-LRq] -l pathname # list attrs -s reads a value from stdin and -g writes a value to stdout
ru: Применение: %s [-LRSq] -s имя_атрибута [-V значение_атрибута] путь # установка значения %s [-LRSq] -g имя_атрибута путь # получить значения %s [-LRSq] -r имя_атрибута путь # удалить атрибут %s [-LRq] -l путь # получить список атрибутов -s читает значение из stdin и -g записывает значение в stdout

source: Only one of -s, -g, -r, or -l allowed
ru: Только одно из -s, -g, -r, -l разрешено

source: -V only allowed with -s
ru: -V можно использовать только с -s

source: Unrecognized option: %c
ru: Неизвестная опция: %c

source: A filename to operate on is required
ru: Необходимо указать имя файла, над которым будет производится операция

source: Could not set "%s" for %s
ru: Невозможно установить "%s" для %s

source: Attribute "%s" set to a %d byte value for %s:
ru: Атрибут "%s" установлен до %d -байтного значения для %s:

source: Could not get "%s" for %s
ru: Невозможно получить "%s" для %s

source: Attribute "%s" had a %d byte value for %s:
ru: Атрибут "%s" имел %d -байтное значение для %s

source: Could not remove "%s" for %s
ru: Невозможно удалить "%s" для %s

source: Attribute "%s" has a %d byte value for %s
ru: Атрибут "%s" имеет %d-байтное значение для %s

source: At least one of -s, -g, -r, or -l is required
ru: Требуется указать хотя бы одно из -s, -g, -r, -l

source: No such attribute
ru: Нет такого атрибута

source: %s: %s: No filename found in line %d, aborting
ru: %s: %s: Имя файла не найдено в строке %d, отмена операции

source: %s: No filename found in line %d of standard input, aborting
ru: %s: Имя файла не найдено в строке %d стандартного ввода, отмена операции

source: %s %s -- set extended attributes
ru: %s %s -- установка расширенных атрибутов

source: Usage: %s %s
ru: Применение: %s %s

source: Usage: %s %s %s %s Try `%s --help' for more information.
ru: Применение: %s %s %s %s Попробуйте `%s --help' для получения дополнительной информации.

source: %s: Removing leading '/' from absolute path names
ru: %s: Удаление начальных '/' из абсолютных путей

source: %s %s -- get extended attributes
ru: %s %s -- получение расширенных атрибутов

source: -n, --name=name get the named extended attribute value -d, --dump get all extended attribute values -e, --encoding=... encode values (as 'text', 'hex' or 'base64') --match=pattern only get attributes with names matching pattern --only-values print the bare values only -h, --no-dereference do not dereference symbolic links --absolute-names don't strip leading '/' in pathnames -R, --recursive recurse into subdirectories -L, --logical logical walk, follow symbolic links -P --physical physical walk, do not follow symbolic links --version print version and exit --help this help text
ru: -n, --name=имя получить расширенный атрибут с указанным именем -d, --dump вывести значения всех расширенных атрибутов -e, --encoding=... кодировка значений ('text', 'hex' или 'base64') --match=шаблон выводить только атрибуты с соответствующими именами --only-values печать только значений -h, --no-dereference не менять название символических ссылок --absolute-names не удалять ведущий '/' из путей -R, --recursive входить в подкаталоги -L, --logical логический обход, следовать по симв. ссылкам -P --physical физический обход, не следовать по симв. ссылкам --version вывести версию и выйти --help этот текст

source: %s: invalid regular expression "%s"
ru: %s: неправильное регулярное выражение "%s"

source: Usage: %s %s Try `%s --help' for more information.
ru: Применение: %s %s Попробуйте `%s --help' для получения дополнительной информации.
