Repository: PlagaMedicum/Ubuntu-Translation-Demo
Catalog: Focal/*/LC_MESSAGES/debianutils.po
Languages: ru

source: 12 May 2011
ru: 12 Мая 2011

source: NAME
ru: ИМЯ

source: add-shell - add shells to the list of valid login shells
ru: add-shell - добавить командные интерпретаторы в список допустимых для команды login

source: SYNOPSIS
ru: КРАТКОЕ ОПИСАНИЕ

source: B<add-shell> I<shellname> [I<shellname>...]
ru: B<add-shell> I<имя_командного_интерпретатора> [I<имя_командного_интерпретатора>...]

source: DESCRIPTION
ru: ОПИСАНИЕ

source: B<add-shell> copies I</etc/shells> to I</etc/shells.tmp>, adds the given shells to this file if they are not already present, and copies this temporary file back to I</etc/shells>.
ru: B<add-shell> копирует I</etc/shells> в I</etc/shells.tmp>, добавляет заданные оболочки к этому файлу, если их еще нет и копирует этот временный файл обратно в I</etc/shells>.

source: The shells must be provided by their full pathnames.
ru: Имена командных интерпретаторов должны содержать полные пути до исполняемых файлов.

source: SEE ALSO
ru: СМОТРИТЕ ТАКЖЕ

source: 7 Jan 2001
ru: 7 Янв 2001

source: installkernel - install a new kernel image
ru: installkernel - установить новый образ ядра

source: B<installkernel >I<version zImage System.map [directory]>
ru: B<installkernel >I<версия файл_образ_ядра файл_карты_системы [целевая_директория]>

source: B<installkernel> installs a new kernel image onto the system from the Linux source tree. It is called by the Linux kernel makefiles when B<make install> is invoked there.
ru: B<installkernel> устанавливает новый образ ядра в систему из директории дерева исходных кодов Linux. Процедура запускается из файлов конфигурации автоматической сборки ядра Linux при использовании команды B<make install>.

source: The new kernel is installed into I<{directory}/vmlinuz-{version}>. If a symbolic link I<{directory}/vmlinuz> already exists, it is refreshed by making a link from I<{directory}/vmlinuz> to the new kernel, and the previously installed kernel is available as I<{directory}/vmlinuz.old>.
ru: Новый файл образа ядра имеет имя I<{целевая_директория}/vmlinuz-{версия}>. Если символическая ссылка I<{целевая_директория}/vmlinuz> уже существует, происходит перенаправление ссылки I<{целевая_директория}/vmlinuz> на новый файл образа ядра, предыдущий файл образа ядра устанавливается доступным по ссылке I<{целевая_директория}/vmlinuz.old>.

source: BUGS
ru: ОШИБКИ

source: installkernel resides in /sbin only because the Linux kernel makefiles call it from there. It should really be in /usr/sbin. It isn't needed to boot a system.
ru: installkernel находится в /sbin только по причине настройки конфигурационных файлов автоматической сборки ядра Linux на вызов процедуры из директории /sbin. Процедура должна находиться в директории /usr/bin.

source: 30 May 2011
ru: 30 Mая 2011

source: ischroot - detect if running in a chroot
ru: ischroot - определить, если выполняется в chroot

source: B<ischroot> detects if it is currently running in a chroot. The exit status is:
ru: B<ischroot> определяет, если выполняется в данный момент в chroot. Состояние на выходе:

source: if currently running in a chroot
ru: если выполняется в данный момент в chroot

source: if currently not running in a chroot
ru: если выполняется в данный момент в chroot

source: if the detection is not possible (On GNU/Linux this happens if the script is not run as root).
ru: Если определение невозможно (В GNU/Linux это происходит, если сценарий не запущен от имени администратора).

source: OPTIONS
ru: ПАРАМЕТРЫ

source: Exit with status 1 if the detection is not possible.
ru: Выйти в состоянии 1, если определение невозможно.

source: Exit with status 0 if the detection is not possible.
ru: Выйти в состоянии 0, если определение невозможно.

source: Print a usage message on standard output and exit successfully.
ru: Распечатать информацию об использовании в стандартный вывод и выйти.

source: Print version information on standard output and exit successfully.
ru: Распечатать информацию о версии в стандартный вывод и выйти.

source: On GNU/Linux, chroot detection is not possible when not root. This works correctly on GNU/Hurd and GNU/kFreeBSD.
ru: В GNU/Linux, определение chroot невозможно при использовании не от имени администратора. Это работает ндалежащим образом в GNU/Hurd и GNU/kFreeBSD.

source: 7 Apr 2005
ru: 7 Апр 2005

source: remove-shell - remove shells from the list of valid login shells
ru: remove-shell - удалить командные интерпретаторы из списка допустимых для команды login

source: B<remove-shell> I<shellname> [I<shellname>...]
ru: B<remove-shell> I<имя_командного_интерпретатора> [I<имя_командного_интерпретатора>...]

source: B<remove-shell> operates on the temporary files I</etc/shells.tmp> and I</etc/shells.tmp2> to remove the given shells from the list of valid login shells, and copy the result back to I</etc/shells>.
ru: B<remove-shell> работает с временными файлами I</etc/shells.tmp> и I</etc/shells.tmp2> для удаления заданных командных интерпретаторов из списка допустимых для команды login, и копирует результат в файл I</etc/shells>.

source: 27 Jun 2012
ru: 27 Июнь 2012

source: run-parts - run scripts or programs in a directory
ru: run-parts - выполнить сценарии или программы в директории

source: B<run-parts> [--test] [--verbose] [--report] [--lsbsysinit] [--regex=RE] [--umask=umask] [--arg=argument] [--exit-on-error] [--help] [--version] [--list] [--reverse] [--] DIRECTORY
ru: B<run-parts> [--test] [--verbose] [--report] [--lsbsysinit] [--regex=регулярное_выражение] [--umask=значение_umask] [--arg=параметр] [--exit-on-error] [--help] [--version] [--list] [--reverse] [--] имя_директории

source: B<run-parts> runs all the executable files named within constraints described below, found in directory I<directory>. Other files and directories are silently ignored.
ru: B<run-parts> запустить все исполнямые файлы, удовлетворяющие условиям описанным ниже, находящиеся в директории I<directory>. Другие файлы и директории по умолчанию игнорируются.

source: If neither the --lsbsysinit option nor the --regex option is given then the names must consist entirely of ASCII upper- and lower-case letters, ASCII digits, ASCII underscores, and ASCII minus-hyphens.
ru: Если не задана ни опция --lsbsysinit, ни опция --regex, то имена должны состоять только из заглавных и строчных букв ASCII, цифр ASCII, символов подчёркивания ASCII и минусов/дефисов ASCII.

source: If the --lsbsysinit option is given, then the names must not end in .dpkg-old or .dpkg-dist or .dpkg-new or .dpkg-tmp, and must belong to one or more of the following namespaces: the LANANA-assigned namespace (^[a-z0-9]+$); the LSB hierarchical and reserved namespaces (^_?([a-z0-9_.]+-)+[a-z0-9]+$); and the Debian cron script namespace (^[a-zA-Z0-9_-]+$).
ru: При использовании параметра --lsbsysinit имена файлов не должны заканчиваться на .dpkg-old или .dpkg-dist или .dpkg-new или .dpkg-tmp и должны принадлежать одному или нескольким из пространств имен: LANANA-назначенное пространство имен Linux (^[a-z0-9]+$); LSB иерархические и зарезервированные пространства имен (^_?([a-z0-9_.]+-)+[a-z0-9]+$); и пространство имен сценария cron в Debian (^[a-zA-Z0-9_-]+$).

source: If the --regex option is given, the names must match the custom extended regular expression specified as that option's argument.
ru: Если команде передается значение параметра --regex, имена файлов должны совпадать с пользовательским шаблоном, заданным с помощью регулярного выражения.

source: Files are run in the lexical sort order (according to the C/POSIX locale character collation rules) of their names unless the --reverse option is given, in which case they are run in the opposite order.
ru: Файлы запускаются в лексическом порядке сортировки (по правилам языковой сортировки C/POSIX) по именам, если - обратный вариант не работает, в этом случае они выполняются в обратном порядке.

source: print the names of the scripts which would be run, but don't actually run them.
ru: печатать имена сценариев, которые могут быть выполнены, но не запускать их на исполнение.

source: print the name of each script to stderr before running.
ru: печатать имя каждого сценария в стандартный поток вывода сообщений об ошибках (stderr) перед выполнением.

source: similar to B<--verbose>, but only prints the name of scripts which produce output. The script's name is printed to whichever of stdout or stderr the script first produces output on.
ru: Подобно параметру B<--verbose>, но печатать только имена сценариев, которые производят собственный вывод. Имена сценариев печатаются либо в стандартный поток вывода (stdout), либо в стандартный поток вывода сообщений об ошибках (stderr) сценария первого осуществляющего операции вывода.

source: reverse the scripts' execution order.
ru: инвертировать порядок выполнения сценариев.

source: exit as soon as a script returns with a non-zero exit code.
ru: остановить RUN-PARTS как только сценарий возвращает не нулевой код завершения.

source: use LSB namespaces instead of classical behavior.
ru: использовать пространства имен LSB в противоположность классическому поведению

source: run each script in a separate process session. If you use this option, killing run-parts will not kill the currently running script, it will run until completion.
ru: выполнить каждый сценарий в отдельном процессе. Если используется этот аргумент, уничтожение процесса run-parts не приведет к завершению уже выполняющихся сценариев, они будут работать до самостоятельного завершения.

source: B<--regex=>I<RE>
ru: B<--regex=>I<РЕГУЛЯРНОЕ_ВЫРАЖЕНИЕ>

source: validate filenames against custom extended regular expression I<RE>. See the EXAMPLES section for an example.
ru: утвердить имена файлов соответствующие пользовательскому расширенному регулярному выражению. Образец применения приведен в секции ПРИМЕРЫ.

source: B<-u, --umask=>I<umask>
ru: B<-u, --umask=>I<значение_umask>

source: sets the umask to I<umask> before running the scripts. I<umask> should be specified in octal. By default the umask is set to 022.
ru: установить значение umask перед выполнением сценариев. I<umask> должна быть представлена в восьмеричной системе исчисления. По умолчанию значение umask равно 022.

source: B<-a, --arg=>I<argument>
ru: B<-a, --arg=>I<аргумент>

source: pass I<argument> to the scripts. Use B<--arg> once for each argument you want passed.
ru: передать I<аргумент> (параметр) сценариям. Используйте B<--arg> один раз для каждого передаваемого параметра.

source: specifies that this is the end of the options. Any filename after B<--> will be not be interpreted as an option even if it starts with a hyphen.
ru: означает окончание параметров командной строки. Любое выражение введенное после B<--> не будет интерпретироваться как параметр даже если оно начинается с дефиса.

source: display usage information and exit.
ru: показать краткую информацию об использовании и выйти.

source: display version and copyright and exit.
ru: показать информацию о номере версии, авторских правах и выйти.

source: EXAMPLES
ru: ПРИМЕРЫ

source: Print the names of all files in /etc that start with `p' and end with `d':
ru: Напечатаь имена всех файлов в директории /etc, начинающиеся с символа 'p' и заканчивающиеся символом 'd':

source: COPYRIGHT
ru: ИНФОРМАЦИЯ ОБ АВТОРСКИХ ПРАВАХ

source: B<run-parts> is free software; see the GNU General Public License version 2 or later for copying conditions. There is I<no> warranty.
ru: B<run-parts> - свободное программное обеспечение; условия использования содержатся в лицензии GNU General Public License версия 2 или более поздней версии. Гарантии I<не> предоставляются.

source: 30 Dec 2017
ru: 30 декабря 2017

source: savelog - save a log file
ru: savelog - сохранить лог-файл

source: B<savelog> [-m mode] [-u user] [-g group] [-t] [-p] [-c cycle] [-l] [-j] [-J] [-1\ .\|.\ -9] [-C] [-d] [-l] [-r rolldir] [-n] [-q] [-D dateformat] file ...
ru: B<savelog> [-m режим] [-u пользователь] [-g группа] [-t] [-p] [-c цикл] [-l] [-j] [-J] [-1\ .\|.\ -9] [-C] [-d] [-l] [-r rolldir] [-n] [-q] [-D форматдаты] файл ...

source: The B<savelog> command saves and optionally compresses old copies of files. Older versions of I<file> are named:
ru: Команда B<savelog> сохраняет и, при необходимости, архивирует более старые версии файлов. Более старые версии I<ФАЙЛ> имеют имя в формате:

source: I<file>.I<E<lt>numberE<gt>>I<E<lt>compress_suffixE<gt>>
ru: I<ФАЙЛ>.I<E<lt>номер_файла_в_циклеE<gt>>I<E<lt>суффикс_архиваE<gt>>

source: where I<E<lt>numberE<gt>> is the version number, 0 being the newest. Version numbers E<gt> 0 are compressed unless B<-l> prevents it. Version number 0 is not compressed because a process might still have I<file> opened for I/O. Only I<cycle> versions of the file are kept.
ru: где I<E<lt>номер_файла_в_циклеE<gt>> - это номер версии файла, 0 - самая новая версия. Версии с номером E<gt> 0 архивируются, кроме случая использования параметра B<-l>. Версия с номером 0 не архивируется, поскольку процесс может держать файл версии 0 открытым для операций ввода/вывода. Только I<период_цикла> версий файла сохраняется.

source: If the file does not exist and B<-t> was given, it will be created.
ru: Если файл не существует и указан параметр B<-t>, файл будет создан.

source: For files that do exist and have lengths greater than zero, the following actions are performed:
ru: Для существующих не пустых фалов выполняются следующие действия:

source: Version numbered files are cycled. Version I<file>.I<2> is moved to version I<file>.I<3>, version I<file>.I<1> is moved to version I<file>.I<2>, and so on. Finally version I<file>.I<0> is moved to version I<file>.I<1>, and version I<file> is deleted. Both compressed names and uncompressed names are cycled, regardless of B<-l>. Missing version files are ignored.
ru: Нумерованные версии файлов циклически переставляются. Версия I<file>.I<2> становится версией I<file>.I<3>, версия I<file>.I<1> становится версией I<file>.I<2> и т.д. В конце концов версия I<file>.I<0> становится версией I<file>.I<1> и версия I<file> удаляется. В циклической перестановке участвуют архивированные и неархивированные версии файлов за исключением случая параметра B<-l>. Отсутствующие версии файлов игнорируются.

source: The new I<file>.I<1> is compressed unless the B<-l> flag was given. It is changed subject to the B<-m>, B<-u>, and B<-g> flags.
ru: Новый файл I<file>.I<1> архивируется, если параметр B<-l> не задан. К файлу применяются значения параметров B<-m>, B<-u> и B<-g>.

source: The main I<file> is moved to I<file>.I<0>.
ru: Основной файл I<file> переименовывается в I<file>.I<0>.

source: If the B<-m>, B<-u>, B<-g>, B<-t>, or B<-p> flags are given, then an empty I<file> is created subject to the given flags. With the B<-p> flag, the file is created with the same owner, group, and permissions as before.
ru: Если параметры B<-m>, B<-u>, B<-g>, B<-t> или B<-p> заданы, тогда создается пустой файл I<file> в соответствии с заданными значениями. В случае использования параметра B<-p>, файл создается с теми же значениями владельца, группы и правами доступа, что и раньше.

source: The new I<file>.I<0> is changed subject to the B<-m>, B<-u>, and B<-g> flags.
ru: К новому файлу I<file>.I<0> применяются значения параметров B<-m>, B<-u> и B<-g>.

source: B<-m mode>
ru: B<-m режим_файла>

source: chmod the log files to mode, implies B<-t>
ru: изменить режим_файла, заключает в себе параметр B<-t>

source: B<-u user>
ru: B<-u пользователь_владелец>

source: chown log files to user, implies B<-t>
ru: изменить владельца лог файлов на пользователь_владелец, действие включает в себя B<-t>

source: B<-g group>
ru: B<-g группа_владелец>

source: chgrp log files to group, implies B<-t>
ru: изменить группу-владельца лог-файлов на группа, действие включает в себя B<-t>

source: B<-c cycle>
ru: B<-c период_цикла>

source: Save cycle versions of the logfile (default: 7). The I<cycle> count must be at least 2.
ru: Сохранять число версий лог-файла равное период_цикла (по умолчанию: 7). Минимальное значение параметра I<период_цикла> равно 2.

source: touch new logfile into existence
ru: изменить время редактирования лог-файла

source: don't compress any log files (default: do compress)
ru: не архивировать никакие лог-файлы (по умолчанию: архивировать)

source: preserve owner, group, and permissions of logfile
ru: сохранить владельца, группу и права доступа оригинального лог-файла

source: compress with bzip2 instead of gzip
ru: архивировать с помощью bzip2 вместо gzip

source: compress with xz instead of gzip
ru: сжать с помощью xz вместо gzip

source: For xz no strength option is set, and xz decides on the default based on the total amount of physical RAM. Note that xz can use a very large amount of memory for the higher compression levels.
ru: Не назначена степень для xz и xz будет руководствоваться на значениях заданных по умолчанию на основе общего объёма физической ОЗУ памяти. Заметьте, что xz может использовать большое количество памяти для высоких уровней сжатия.

source: compression strength or memory usage (default: 9, except for xz)
ru: степень сжатия или использование памяти (по умолчанию: 9, за исключением для xz)

source: force cleanup of cycled logfiles
ru: принудительно удалить лог-файлы с номером версии большем и равном периоду цикла

source: use standard date for rolling
ru: использовать дату в стандартном формате для прокрутки

source: B<-D dateformat>
ru: B<-D формат_даты>

source: use I<rolldir> instead of . to roll files
ru: использовать I<директорию> вместо текущей директории . для файлов в кругообороте

source: do not rotate empty files
ru: не включать в цикл пустые файлы

source: be quiet
ru: работать в "тихом" режиме

source: If a process is still writing to I<file.0>, and savelog moves it to I<file.1> and compresses it, data could be lost.
ru: Если процесс все еще записывает в I<file.0>, и savelog переименовывает I<file.0> в I<file.1> и далее архивирует, часть данных может быть потеряна.

source: tempfile - create a temporary file in a safe manner
ru: tempfile - создать временный файл безопасным способом

source: B<tempfile> [-d DIR] [-p STRING] [-s STRING] [-m MODE] [-n FILE] [--directory=DIR] [--prefix=STRING] [--suffix=STRING] [--mode=MODE] [--name=FILE] [--help] [--version]
ru: B<tempfile> [-d ДИРЕКТОРИЯ] [-p СТРОКА] [-s СТРОКА] [-m РЕЖИМ] [-n ФАЙЛ] [--directory=ДИРЕКТОРИЯ] [--prefix=СТРОКА] [--suffix=СТРОКА] [--mode=РЕЖИМ] [--name=ФАЙЛ] [--help] [--version]

source: In case the environment variable B<TMPDIR> exists and contains the name of an appropriate directory, that is used.
ru: Если переменная окружения B<TMPDIR> существует и содержит имя соответствующей директории, используется значение B<TMPDIR>.

source: Otherwise, if the I<--directory> argument is specified and appropriate, it is used.
ru: В другом случае, если значение параметра I<--directory> определено и подходит, используется оно.

source: Otherwise, I<P_tmpdir> (as defined in I<E<lt>stdio.hE<gt>>) is used when appropriate.
ru: Иначе, I<P_tmpdir> (определенное в I<E<lt>stdio.hE<gt>>) используется в подходящих случаях.

source: Finally an implementation-defined directory I<(/tmp)> may be used.
ru: В конце концов директория I<(/tmp)> определенная в реализации может быть использована.

source: B<-d, --directory >I<DIR>
ru: B<-d, --directory >I<ДИРЕКТОРИЯ>

source: Place the file in DIR.
ru: Поместить файл в ДИРЕКТОРИЮ

source: B<-m, --mode >I<MODE>
ru: B<-m, --mode >I<РЕЖИМ>

source: Open the file with MODE instead of 0600.
ru: Открыть файл с РЕЖИМ вместо 0600

source: B<-n, --name >I<FILE>
ru: B<-n, --name >I<ФАЙЛ>

source: Use FILE for the name instead of B<tempnam>(3)B<.> The options -d, -p, and -s are ignored if this option is given.
ru: Использовать ФАЙЛ для имени вместо ответа B<tempnam>(3)B<.> Если это значение задано, параметры -d, -p и -s игнорируются.

source: B<-p, --prefix >I<STRING>
ru: B<-p, --prefix >I<СТРОКА>

source: Use up to five letters of STRING to generate the name.
ru: Использовать до пяти символов в СТРОКЕ в качестве префикса имени файла.

source: B<-s, --suffix >I<STRING>
ru: B<-s, --suffix >I<СТРОКА>

source: Generate the file with STRING as the suffix.
ru: Сгенерировать имя файла со СТРОКОЙ в качестве суффикса.

source: RETURN VALUES
ru: ВОЗВРАЩАЕМЫЕ ЗНАЧЕНИЯ

source: An exit status of 0 means the temporary file was created successfully. Any other exit status indicates an error.
ru: Код завершения 0 означает успешное создание временного файла. Любой другой код завершения сигнализирует об ошибке.

source: Exclusive creation is not guaranteed when creating files on NFS partitions. tempfile cannot make temporary directories. tempfile is deprecated; you should use mktemp(1) instead.
ru: Исключительное создание не может быть гарантировано при создании файлов на NFS разделах. tempfile не может создавать временные каталоги. tempfile устарел; используйте mktemp(1) вместо него.

source: EXAMPLE
ru: ПРИМЕР

source: 29 Jun 2016
ru: 29 июня 2016

source: which - locate a command
ru: which - определить путь до исполняемого файла команды

source: which [-a] filename ...
ru: which [-a] имя_команды ...

source: print all matching pathnames of each argument
ru: распечетать все полные имена файлов для каждого аргумента

source: EXIT STATUS
ru: КОДЫ ЗАВЕРШЕНИЯ

source: if all specified commands are found and executable
ru: если все указанные команды найдены и исполняемы

source: if one or more specified commands is nonexistent or not executable
ru: если одна или более из указанных команд не существуют или неисполняемы

source: if an invalid option is specified
ru: если указаны недопустимые параметры
