Repository: PlagaMedicum/Ubuntu-Translation-Demo
Catalog: Focal/*/LC_MESSAGES/hunspell.po
Languages: uk

source: error - iconv_open: %s -> %s
uk: помилка - iconv_open: %s -> %s

source: error - iconv: %s -> %s
uk: помилка - iconv: %s -> %s

source: error - iconv_open: UTF-8 -> %s
uk: помилка - iconv_open: UTF-8 -> %s

source: Can't create tmp dir
uk: Неможливо створити каталог tmp

source: Can't open inputfile
uk: Неможливо відкрити вхідний файл

source: Can't open %s.
uk: Не вдалося відкрити %s.

source: error - missing HOME variable
uk: помилка - відсутня змінна HOME

source: Line %d: %s ->
uk: Лінія %d: %s ->

source: FORBIDDEN!
uk: ЗАБОРОНЕНО!

source: Spelling mistake?
uk: Помилка правописання?

source: %s File: %s
uk: %s Файл: %s

source: [SPACE] R)epl A)ccept I)nsert U)ncap S)tem Q)uit e(X)it or ? for help
uk: [SPACE] R)повторити A)підтвердити I)вставити U)відкрити S)відбутись Q)вийти або ? для допомоги

source: Whenever a word is found that is not in the dictionary it is printed on the first line of the screen. If the dictionary contains any similar words, they are listed with a number next to each one. You have the option of replacing the word completely, or choosing one of the suggested words.
uk: Коли знайдено слово, яке не присутнє в словнику воно друкується на першому рядку екрану. Якщо словник має подібні слова, вони будуть перераховані , кожне буде мати число після себе. Ви можете видалити слово або вибрати одне з підходящих.

source: Commands are:
uk: Команди:

source: R Replace the misspelled word completely.
uk: З Замініть слово з помилкою повністю.

source: Space Accept the word this time only.
uk: Пробіл Підтвердить слово тільки цього разу.

source: A Accept the word for the rest of this session.
uk: A Підтвердить слово до кінця ціжї сесії.

source: I Accept the word, and put it in your private dictionary.
uk: I Підтвердить слово та помістить його в ваш приватний словник.

source: U Accept and add lowercase version to private dictionary.
uk: U Підтвердить слово і додасть його з маленької букви в ваш приватний словник.

source: S Ask a stem and a model word and store them in the private dictionary. The stem will be accepted also with the affixes of the model word.
uk: О Запит основи й слова-зразка та збереження їх у вашому особистому словнику. Основа буде додана з усіма формами слова-зразка.

source: 0-n Replace with one of the suggested words.
uk: 0-n Замінити слово на пропоноване.

source: X Write the rest of this file, ignoring misspellings, and start next file.
uk: X Записати залишок файлу пропускаючи помилки і після, почати новий файл.

source: Q Quit immediately. Asks for confirmation. Leaves file unchanged.
uk: Q Питає підтвердження і виходить, залишаючи файл не зміненим.

source: ^Z Suspend program. Restart with fg command.
uk: ^Z Призупиняє програму. Перезапускає з fg командою.

source: ? Show this help screen.
uk: ? Показує цю допомогу.

source: -- Type space to continue --
uk: -- Натисніть пробіл для продовження --

source: Replace with:
uk: Замінити на:

source: Cannot update personal dictionary.
uk: Не вдається оновити персональний словник.

source: New word (stem):
uk: Нове слово (steam):

source: Model word (a similar dictionary word):
uk: Модель слова (аналогічне слово в словнику):

source: Model word must be in the dictionary. Press any key!
uk: Модель слова має бути в словнику. Нажміть будь-яку кнопку!

source: Are you sure you want to throw away your changes?
uk: Ви впевнені, що бажаєте відкинути зміни?

source: Can't create tempfile
uk: Неможливо створити тимчасовий файл

source: Can't open outputfile
uk: Неможливо відкрити вихідний файл

source: Usage: hunspell [OPTION]... [FILE]...
uk: Використання: hunspell [ПАРАМЕТРИ]... [ФАЙЛИ]...

source: Check spelling of each FILE. Without FILE, check standard input.
uk: Перевірити правописання для кожного файлу. Без файлу, перевіряти стандартний ввід.

source: -1 check only first field in lines (delimiter = tabulator)
uk: -1 перевіряти тільки першу частину рядків (делімітатор = табулятор)

source: -a Ispell's pipe interface
uk: -a Канальний інтерфейс Ispell

source: --check-url check URLs, e-mail addresses and directory paths
uk: --check-url перевірити URLs, e-mail адреси та шляхи каталогів

source: --check-apostrophe check Unicode typographic apostrophe
uk: --check-apostrophe перевірити Unicode типографський апостроф

source: -d d[,d2,...] use d (d2 etc.) dictionaries
uk: -d d[,d2,...] використовувати (d2 т.д.) словники

source: -D show available dictionaries
uk: -D показати доступні словники

source: -G print only correct words or lines
uk: -G друкувати тільки правильні слова або рядки

source: -h, --help display this help and exit
uk: -h, --help показує цю допомогу і виходить

source: -H HTML input file format
uk: -H HTML ввідний формат файлу

source: -i enc input encoding
uk: -i ім’я кодування тексту

source: -l print misspelled words
uk: -l друкувати слова з помилками

source: -L print lines with misspelled words
uk: -L друкувати рядки з помилками

source: -m analyze the words of the input text
uk: -m аналізувати слова вхідного тексту

source: -n nroff/troff input file format
uk: -n nroff/troff вхідний формат файлу

source: -O OpenDocument (ODF or Flat ODF) input file format
uk: -O OpenDocument (ODF або Flat ODF) формат вхідного файлу

source: -p dict set dict custom dictionary
uk: -p словник використовувати словник користувача

source: -r warn of the potential mistakes (rare words)
uk: -r повідомляє про часті помилки (рідкісні слова)

source: -P password set password for encrypted dictionaries
uk: -P password задати пароль для шифрованих словників

source: -s stem the words of the input text
uk: -s показувати слова вхідного тексту

source: -S suffix words of the input text
uk: -S суффиксні слова вхідного тексту

source: -t TeX/LaTeX input file format
uk: -t TeX/LaTeX вхідний формат файлу

source: -v, --version print version number
uk: -v, --version показує версію

source: -vv print Ispell compatible version number
uk: -vv показує Ispell сумісну версію

source: -w print misspelled words (= lines) from one word/line input.
uk: -w друкувати слова з орфографічними помилками (= рядки) від одного слова/рядка вводу.

source: -X XML input file format
uk: -X XML формат вхідного файлу

source: Example: hunspell -d en_US file.txt # interactive spelling hunspell -i utf-8 file.txt # check UTF-8 encoded file hunspell -l *.odt # print misspelled words of ODF files # Quick fix of ODF documents by personal dictionary creation # 1 Make a reduced list from misspelled and unknown words: hunspell -l *.odt | sort | uniq >words # 2 Delete misspelled words of the file by a text editor. # 3 Use this personal dictionary to fix the deleted words: hunspell -p words *.odt
uk: Приклад: hunspell -d en_US file.txt # інтерактивна перевірка написання hunspell -i utf-8 file.txt # перевірити UTF-8 закодований файл hunspell -l *.odt # друкувати помилкові слова з ODF файлів # Швидке виправлення ODF документу з створенням персонального словника # 1 Зробити зменшений лист з помилкових та незнайомих слів: hunspell -l *.odt | sort | uniq >words # 2 Вилучити помилкові слова з файлу текстовим редактором # 3 Використати цей персональний словник для виправлення вилучених слів: hunspell -p words *.odt

source: Bug reports: http://hunspell.github.io/
uk: Повідомлення про помилки: http://hunspell.github.io/

source: Copyright (C) 2002-2014 László Németh. License: MPL/GPL/LGPL. Based on OpenOffice.org's Myspell library. Myspell's copyright (C) Kevin Hendricks, 2001-2002, License: BSD.
uk: Всі права захищено (C) 2002-2014 László Németh. Ліцензія: MPL/GPL/LGPL. Створено на основі бібліотеки Myspell з пакета OpenOffice.org. Авторські права Myspell (C) Kevin Hendricks, 2001-2002, Ліцензія: BSD.

source: This is free software; see the source for copying conditions. There is NO warranty; not even for MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE, to the extent permitted by law.
uk: Це вільно розповсюджуване програмне забезпечення; умови копіювання є у джерельних текстах. Тут НЕМАЄ ніяких гарантій; ні гарантій ТОВАРНИХ ВЛАСТИВОСТЕЙ, ні гарантій ПРИДАТНОСТІ ДЛЯ ЗАСТОСУВАННЯ ЗА ПРИЗНАЧЕННЯМ, у всіх встановлених законом випадках.

source: SEARCH PATH: %s
uk: ШЛЯХ ПОШУКУ: %s

source: AVAILABLE DICTIONARIES (path is not mandatory for -d option):
uk: ДОСТУПНІ СЛОВНИКИ (при використанні -d шлях не є обов’язковим):

source: LOADED DICTIONARY: %s %s
uk: ЗАВАНТАЖЕНИЙ СЛОВНИК: %s %s

source: error - %s exceeds dictionary limit.
uk: помилка - %s перевищено ліміт словника.

source: Can't open affix or dictionary files for dictionary named "%s".
uk: Не вдалося відкрити або прикріпити словники для імені словника "%s".

source: Hunspell has been compiled without Ncurses user interface.
uk: Hunspell було скомпільовано без підтримки діалогового інтерфейсу Ncurses.
