Repository: PlagaMedicum/Ubuntu-Translation-Demo
Catalog: Focal/*/LC_MESSAGES/libgsf.po
Languages: uk

source: Not enough memory to copy %s bytes of data
uk: Недостатньо пам'яті для копіювання %s байтів даних

source: The clip_data is in %s, but it is smaller than at least %s bytes
uk: Розмір clip_data становить %s, але це менше за мінімальне значення %s байт

source: The clip_data is in Windows clipboard format, but it is smaller than the required 4 bytes.
uk: Clip_data має формат буфера обміну Windows, але його розмір менший потрібних 4 байти.

source: Windows Metafile format
uk: Формат Windows Metafile

source: Windows DIB or BITMAP format
uk: Формат Windows DIB або BITMAP

source: Windows Enhanced Metafile format
uk: Формат для Windows Enhanced Metafile

source: Failed to duplicate input stream
uk: Не вдалося продублювати вхідний потік

source: No OLE2 signature
uk: Підпис OLE2 відсутній

source: Unreasonable block sizes
uk: Безпідставно великі розміри блоків

source: Insufficient memory
uk: Недостатньо пам'яті

source: Inconsistent block allocation table
uk: Несумісна таблиця розподілення блоків

source: Problems making block allocation table
uk: Помилка створення таблиці розподілення блоків

source: Problems reading directory
uk: Проблема з читанням каталогу

source: Failed to access child
uk: Не вдалося отримати доступ до дочірнього об’єкту

source: failure reading block
uk: Помилка читання блоку

source: Can't find the VBA directory stream
uk: Не вдалося знайти потік каталогу VBA

source: vba project header problem
uk: некоректний заголовок vba проекту

source: No VBA signature
uk: Підпис VBA відсутній

source: Unknown VBA version signature 0x%x%x%x%x
uk: Невідома версія підпису VBA 0x%x%x%x%x

source: Unable to parse VBA header
uk: Не вдалося розібрати заголовок VBA

source: Invalid tar header
uk: Некоректний заголовок tar

source: Invalid longname header
uk: Некоректний заголовок довгого ім’я

source: Failed to read longname
uk: Не вдалося прочитати довге ім’я

source: Seek failed
uk: Помилка пошуку

source: Truncated archive
uk: Розбитий на частини архів

source: Source
uk: Джерело

source: The archive being interpreted
uk: Архів інтерпретується

source: Error reading zip dirent
uk: Помилка при читанні zip-структури

source: Broken zip file structure
uk: Структура zip-файлу пошкоджена

source: Error seeking to zip header
uk: Помилка переходу до заголовку zip

source: Error reading zip header
uk: Помилка при читанні заголовку zip

source: Error incorrect zip header
uk: Некоректний заголовок zip

source: problem uncompressing stream
uk: проблема з розпакуванням потоку

source: Compression Level
uk: Рівень стиснення

source: The level of compression used, zero meaning none
uk: Рівень стиснення що використовується, нуль — без стиснення

source: BZ2 support not enabled
uk: Підтримку BZ2 не увімкнено

source: BZ2 decompress init failed
uk: Помилка ініціалізації розпаковки BZ2

source: BZ2 decompress failed
uk: Помилка розпаковки BZ2

source: BZ2 decompress end failed
uk: Помилка завершення розпаковки BZ2

source: Name
uk: Ім’я

source: The input's name
uk: Ім’я джерела

source: Size
uk: Розмір

source: The input's size
uk: Розмір джерела

source: End of file
uk: Кінець файлу

source: Remaining
uk: Залишилося

source: Amount of data remaining
uk: Обсяг даних, що залишилися

source: Position
uk: Позиція

source: The input's current position
uk: Поточна позиція джерела

source: Modification time
uk: Час модифікації

source: An optional GDateTime representing the time the input was last changed
uk: Необов’язкове представлення часу GDateTime, коли ввід був змінений

source: Container
uk: Контейнер

source: The parent GsfInfile
uk: Батьківський GsfInfile

source: Duplicate size mismatch
uk: Інший розмір дубліката

source: Unable to initialize zlib
uk: Не вдалося ініціалізувати zlib

source: Failed to rewind source
uk: Не вдалося перемотати джерело

source: Invalid gzip header
uk: Некоректний заголовок gzip

source: truncated source
uk: обрізане джерело

source: Failed to read from source
uk: Не вдалося прочитати з джерела

source: NULL source
uk: джерело NULL

source: Uncompressed size not set
uk: Нестиснутий розмір не встановлено

source: Raw
uk: Сирі дані

source: Whether to read compressed data with no header and no trailer
uk: Чи читати стиснуті дані без заголовку та кінцівки

source: Where the compressed data comes from
uk: Звідки поступили стиснуті дані

source: Size after decompression
uk: Розмір після розпаковки

source: The source's uncompressed size
uk: Нестиснутий розмір джерела

source: %s: Is not a regular file
uk: %s: не є звичайним файлом

source: %s: File too large to be memory mapped
uk: %s: файл завеликий для розташування у пам’яті

source: mmap not supported
uk: mmap не підтримується

source: Pretty print
uk: Гарний друк

source: Should the output auto-indent elements to make reading easier?
uk: Увімкнути автоматичний відступ при виводі елементів для полегшення читання?

source: Sink
uk: Отримувач

source: The destination for writes
uk: Пункт призначення запису

source: Missing data when reading the %s property; got %s bytes, but %s bytes at least are needed.
uk: При читанні властивості %s не вистачило даних, отримано %s байт, але потрібно %s байтів.

source: Corrupt data in the VT_CF property; clipboard data length must be at least 4 bytes, but the data says it only has %s bytes available.
uk: Пошкоджено дані у властивості VT_CF ; розмір даних буфера обміну повинен бути щонайменше 4 байти, але згідно з даними доступно лише %s байтів.

source: Unable to read MS property stream header
uk: Не вдалося прочитати заголовок потоку властивості MS

source: Invalid MS property stream header
uk: Некоректний заголовок потоку властивості MS

source: Invalid MS property section
uk: Некоректна секція властивості MS

source: Invalid MS property stream header or file truncated
uk: Некоректний заголовок потоку властивості MS або файл обрізаний

source: Property "%s" used for multiple types!
uk: Властивість «%s» використовується для декількох типів!

source: ODF version
uk: Версія ODF

source: The ODF version this object is targeting as an integer like 100
uk: Версія ODF даного об’єкту задається у вигляді цілого числа, наприклад 100

source: Unable to find part id='%s' for '%s'
uk: Не вдалося знайти частину id=«%s» для «%s»

source: Unable to find part with type='%s' for '%s'
uk: Не вдалося знайти частину з type=«%s» для «%s»

source: Missing id for part in '%s'
uk: Бракує ідентифікатора в «%s»

source: Part '%s' in '%s' from '%s' is corrupt!
uk: Частину «%s» в «%s» з «%s» пошкоджено!

source: The GsfOutput that stores the Open Package content
uk: Об’єкт GsfOutput, зберігаючий вміст Open Package

source: Content type
uk: Тип вмісту

source: The content type stored in the root [Content_Types].xml file
uk: Тип вмісту зберігається у кореневому файлі [Content_Types].xml

source: Is Directory
uk: Тека

source: Can the outfile have children
uk: Чи може вихідний файл мати вкладені об’єкти

source: Small block size
uk: Маленький розмір блоку

source: The size of the OLE's small blocks
uk: Розмір маленьких блоків OLE

source: Big block size
uk: Великий розмір блоку

source: The size of the OLE's big blocks
uk: Розмір великих блоків OLE

source: Where the archive is written
uk: Де записано архів

source: Entry Name
uk: Ім'я запису

source: The filename of this member in the archive without path
uk: Ім’я файлу цієї частини архіву без шляху

source: Deflate Level
uk: Рівень стиснення

source: The level of deflate compression used, zero meaning none and -1 meaning the zlib default
uk: Використовуваний рівень стиснення; нуль — без стиснення, -1 — zlib типово

source: Whether to use zip64 format, -1 meaning automatic
uk: Чи використовувати формат zip64; -1 — автоматичний вибір

source: Unable to initialize BZ2 library
uk: Не вдалося ініціалізувати бібліотеку BZ2

source: The output's name
uk: Назва виводу

source: The output's size
uk: Розмір виводу

source: Is Closed
uk: Закрито

source: Whether the output is closed
uk: Чи закрито вивід

source: The output's current position
uk: Поточна позиція виводу

source: An optional GDateTime representing the time the output was last changed
uk: Необов’язкове представлення часу GDateTime, коли вивід був змінений

source: The parent GsfOutfile
uk: Батьківський GsfOutfile

source: Where the formatted output is written
uk: Місце запису відформатованого виводу

source: Quote
uk: Цитата

source: The string used for quoting fields
uk: Рядок, що використовується для цитування полів

source: Quoting Mode
uk: Режим цитування

source: When to quote fields
uk: Коли цитувати поля

source: Quoting Triggers
uk: Тригери цитування

source: Characters that cause field quoting
uk: Символи, що приводять до цитування поля

source: Quoting On Whitespace
uk: Цитування пробільних символів

source: Does initial or terminal whitespace force quoting?
uk: Використовувати примусове цитування для початкових або термінальних " "пробільних символів?

source: Separator
uk: Розділювач

source: The field separator
uk: Розділювач полів

source: The end-of-line marker
uk: Маркер кінця рядка

source: Where the converted data is written
uk: Куди записано перетворені дані

source: Input Charset
uk: Вхідне кодування

source: The character set to convert from
uk: Набір символів для перетворення

source: Output Charset
uk: Вихідне кодування

source: The character set to convert to
uk: Цільове кодування для перетворення

source: Fallback
uk: Запасний рядок

source: The string to use for invalid characters
uk: Рядок, що використовується для неприпустимих символів

source: Options
uk: Параметри

source: Display program version
uk: Показати версію програми

source: %s: Failed to open %s: %s
uk: %s: не вдалося відкрити %s: %s

source: %s: Failed to recognize %s as an archive
uk: %s: не вдалося розпізнати %s як архів

source: Available subcommands are...
uk: Доступні підкоманди…

source: * cat output one or more files in archive
uk: * cat виводить один або декілька файлів в архіві

source: * dump dump one or more files in archive as hex
uk: * dump дамп одного або декількох файлів в архіві в шістнадцятковому вигляді

source: * help list subcommands
uk: * help список підкоманд

source: * list list files in archive
uk: * list список файлів в архіві

source: * listprops list document properties in archive
uk: * listprops список властивостей документа в архіві

source: * props print specified document properties
uk: * props показ заданих властивостей документа

source: * createole create OLE archive
uk: * createole створити OLE-архів

source: * createzip create ZIP archive
uk: * createzip створити ZIP-архів

source: No property named %s
uk: Немає властивості з назвою %s

source: %s: Error processing file %s: %s
uk: %s: Помилка обробки файлу %s: %s

source: SUBCOMMAND ARCHIVE...
uk: ПІДКОМАНДА АРХІВ…

source: %s Run '%s --help' to see a full list of available command line options.
uk: %s Відкрийте «%s --help» для виводу повного списку доступних параметрів командного рядка.

source: gsf version %d.%d.%d
uk: Версія GSF %d.%d.%d

source: Usage: %s %s
uk: Використання: %s %s

source: Run '%s help' to see a list of subcommands.
uk: Запустіть '%s help' щоб побачити список підкоманд.
