Repository: PlagaMedicum/Ubuntu-Translation-Demo
Catalog: Focal/*/LC_MESSAGES/python-apt.po
Languages: ru

source: Ubuntu development series
ru: Разрабатываемые выпуски Ubuntu

source: Cdrom with Ubuntu 20.04 'Focal Fossa'
ru: CD-ROM с Ubuntu 20.04 «Focal Fossa»

source: Cdrom with Ubuntu 19.10 'Eoan Ermine'
ru: Компакт-диск с Ubuntu 19.10 'Eoan Ermine'

source: Cdrom with Ubuntu 19.04 'Disco Dingo'
ru: CD-ROM с Ubuntu 19.04 «Disco Dingo»

source: Cdrom with Ubuntu 18.10 'Cosmic Cuttlefish'
ru: CD-ROM с Ubuntu 18.10 «Cosmic Cuttlefish»

source: Cdrom with Ubuntu 18.04 'Bionic Beaver'
ru: CD-ROM с Ubuntu 18.04 «Bionic Beaver»

source: Cdrom with Ubuntu 17.10 'Artful Aardvark'
ru: CD-ROM с Ubuntu 17.10 «Artful Aardvark»

source: Cdrom with Ubuntu 17.04 'Zesty Zapus'
ru: CD-ROM с Ubuntu 17.04 «Zesty Zapus»

source: Cdrom with Ubuntu 16.10 'Yakkety Yak'
ru: CD-ROM с Ubuntu 16.10 'Yakkety Yak'

source: Cdrom with Ubuntu 16.04 LTS 'Xenial Xerus'
ru: CD-ROM с Ubuntu 16.04 LTS «Xenial Xerus»

source: Cdrom with Ubuntu 15.10 'Wily Werewolf'
ru: CD-ROM с Ubuntu 15.10 'Wily Werewolf'

source: Cdrom with Ubuntu 15.04 'Vivid Vervet'
ru: CD-ROM с Ubuntu 15.04 'Vivid Vervet'

source: Cdrom with Ubuntu 14.10 'Utopic Unicorn'
ru: Компакт-диск содержащий Ubuntu 14.10 'Utopic Unicorn'

source: Cdrom with Ubuntu 14.04 'Trusty Tahr'
ru: Компакт-диск содержащий Ubuntu 14.04 'Trusty Tahr'

source: Cdrom with Ubuntu 13.10 'Saucy Salamander'
ru: CD-ROM с Ubuntu 13.10 «Saucy Salamander»

source: Cdrom with Ubuntu 13.04 'Raring Ringtail'
ru: CD-ROM с Ubuntu 13.04 «Raring Ringtail»

source: Cdrom with Ubuntu 12.10 'Quantal Quetzal'
ru: CD-ROM с Ubuntu 12.10 «Quantal Quetzal»

source: Cdrom with Ubuntu 12.04 'Precise Pangolin'
ru: Компакт-диск с Ubuntu 12.04 «Precise Pangolin»

source: Cdrom with Ubuntu 11.10 'Oneiric Ocelot'
ru: Компакт-диск с Ubuntu 11.10 «Oneiric Ocelot»

source: Cdrom with Ubuntu 11.04 'Natty Narwhal'
ru: Компакт-диск с Ubuntu 11.04 «Natty Narwhal»

source: Cdrom with Ubuntu 10.10 'Maverick Meerkat'
ru: Компакт-диск с Ubuntu 10.10 «Maverick Meerkat»

source: Canonical Partners
ru: Партнеры Canonical

source: Software packaged by Canonical for their partners
ru: Программное обеспечение партнеров Canonical

source: This software is not part of Ubuntu.
ru: Это программное обеспечение не является частью Ubuntu.

source: Independent
ru: Независимое

source: Provided by third-party software developers
ru: Предоставлено сторонними разработчиками.

source: Software offered by third party developers.
ru: Программное обеспечение предлагается сторонними разработчиками.

source: Cdrom with Ubuntu 10.04 'Lucid Lynx'
ru: Компакт-диск с Ubuntu 10.04 'Lucid Lynx'

source: Cdrom with Ubuntu 9.10 'Karmic Koala'
ru: Компакт-диск с Ubuntu 9.10 «Karmic Koala»

source: Cdrom with Ubuntu 9.04 'Jaunty Jackalope'
ru: Компакт-диск с Ubuntu 9.04 «Jaunty Jackalope»

source: Cdrom with Ubuntu 8.10 'Intrepid Ibex'
ru: Компакт-диск с Ubuntu 8.10 «Intrepid Ibex»

source: Cdrom with Ubuntu 8.04 'Hardy Heron'
ru: Компакт-диск с Ubuntu 8.04 «Hardy Heron»

source: Cdrom with Ubuntu 7.10 'Gutsy Gibbon'
ru: Компакт-диск с Ubuntu 7.10 «Gutsy Gibbon»

source: Cdrom with Ubuntu 7.04 'Feisty Fawn'
ru: Компакт-диск с Ubuntu 7.04 «Feisty Fawn»

source: Community-maintained
ru: Поддерживается сообществом

source: Restricted software
ru: Несвободное ПО

source: Cdrom with Ubuntu 6.10 'Edgy Eft'
ru: Компакт-диск с Ubuntu 6.10 'Edgy Eft'

source: Canonical-supported free and open-source software
ru: Бесплатное и свободное ПО с поддержкой Canonical

source: Community-maintained (universe)
ru: Поддерживается сообществом (universe)

source: Community-maintained free and open-source software
ru: Бесплатное и свободное ПО с поддержкой сообщества

source: Non-free drivers
ru: Несвободные драйвера

source: Proprietary drivers for devices
ru: Проприетарные драйвера устройств

source: Restricted software (Multiverse)
ru: Несвободное обеспечение (Multiverse)

source: Software restricted by copyright or legal issues
ru: Программы, ограниченные патентами или законами

source: Cdrom with Ubuntu 6.06 LTS 'Dapper Drake'
ru: Компакт-диск с Ubuntu 6.06 LTS 'Dapper Drake'

source: Important security updates
ru: Важные обновления безопасности

source: Recommended updates
ru: Рекомендованные обновления

source: Pre-released updates
ru: Обновления, не вошедшие в официальный выпуск

source: Unsupported updates
ru: Официально не поддерживаемые обновления

source: Cdrom with Ubuntu 5.10 'Breezy Badger'
ru: Компакт-диск с Ubuntu 5.10 'Breezy Badger'

source: Ubuntu 5.10 Security Updates
ru: Обновления безопасности Ubuntu 5.10

source: Ubuntu 5.10 Updates
ru: Обновления Ubuntu 5.10

source: Cdrom with Ubuntu 5.04 'Hoary Hedgehog'
ru: CD с Ubuntu 5.04 'Hoary Hedgehog'

source: Officially supported
ru: Официально поддерживается

source: Ubuntu 5.04 Security Updates
ru: Обновления безопасности Ubuntu 5.04

source: Ubuntu 5.04 Updates
ru: Обновления Ubuntu 5.04

source: Ubuntu 5.04 Backports
ru: Ubuntu 5.04 бэкпорты

source: Community-maintained (Universe)
ru: Поддерживается сообществом (Universe)

source: Non-free (Multiverse)
ru: Несвободное (Multiverse)

source: Cdrom with Ubuntu 4.10 'Warty Warthog'
ru: Компакт-диск с Ubuntu 4.10 'Warty Warthog'

source: No longer officially supported
ru: Официально больше не поддерживается

source: Restricted copyright
ru: Ограниченные авторские права

source: Ubuntu 4.10 Security Updates
ru: Обновления безопасности Ubuntu 4.10

source: Ubuntu 4.10 Updates
ru: Обновления Ubuntu 4.10

source: Ubuntu 4.10 Backports
ru: Ubuntu 4.10 бэкпорты

source: Proposed updates
ru: Предлагаемые обновления

source: Security updates
ru: Обновления безопасности

source: Debian current stable release
ru: Текущий стабильный релиз Debian

source: Debian testing
ru: Debian "Etch" (тестируется)

source: Debian 'Sid' (unstable)
ru: Debian "Sid" (нестабильный)

source: DFSG-compatible Software with Non-Free Dependencies
ru: DFSG-совместимое ПО с зависимостями от несвободного ПО

source: Non-DFSG-compatible Software
ru: Не-DFSG-совместимое ПО

source: Server for %s
ru: Сервер %s

source: Main server
ru: Основной сервер

source: Custom servers
ru: Свои сервера

source: Missing description for '%s'.Please report.
ru: Отсутствует описание «%s». Пожалуйста, сообщите об этом.

source: Invalid unicode in description for '%s' (%s). Please report.
ru: Неправильный unicode в описании '%s' (%s). Пожалуйста, сообщите.

source: The list of changes is not available
ru: Список изменений недоступен или отсутствует.

source: The list of changes is not available yet. Please use http://launchpad.net/ubuntu/+source/%s/%s/+changelog until the changes become available or try again later.
ru: Список изменений еще недоступен. Пожалуйста используйте http://launchpad.net/ubuntu/+source/%s/%s/+changelog до тех пор, пока изменения не станут доступны или попробуйте позже.

source: Failed to download the list of changes. Please check your Internet connection.
ru: Ошибка при загрузке списка изменений. Пожалуйста, проверьте ваше соединение с Интернет.

source: List of files for '%s' could not be read
ru: Список файлов для '%s' не может быть прочтен

source: List of control files for '%s' could not be read
ru: Список контролирующих файлов для '%s' не может быть прочтен

source: Dependency is not satisfiable: %s
ru: Неразрешимая зависимость: %s

source: Conflicts with the installed package '%s'
ru: Конфликт с установленным пакетом '%s'

source: Breaks existing package '%(pkgname)s' dependency %(depname)s (%(deprelation)s %(depversion)s)
ru: Ломает в существующем пакете '%(pkgname)s' зависимость %(depname)s (%(deprelation)s %(depversion)s)

source: Breaks existing package '%(pkgname)s' conflict: %(targetpkg)s (%(comptype)s %(targetver)s)
ru: Ломает существующий пакет '%(pkgname)s' конфликтует с: %(targetpkg)s (%(comptype)s %(targetver)s)

source: Breaks existing package '%(pkgname)s' that conflict: '%(targetpkg)s'. But the '%(debfile)s' provides it via: '%(provides)s'
ru: Конфликтует с установленным пакетом "%(pkgname)s": '%(targetpkg)s'. Но '%(debfile)s' доступен через: '%(provides)s'

source: No Architecture field in the package
ru: Нет указания архитектуры в пакете

source: Wrong architecture '%s' -- Run dpkg --add-architecture to add it and update afterwards
ru: Неверная архитектура '%s' -- Выполните dpkg --add-architecture, чтобы добавить её, после чего выполните обновление

source: A later version is already installed
ru: Более поздняя версия уже установлена

source: Failed to satisfy all dependencies (broken cache)
ru: Не удалось определить все зависимости (broken cache)

source: Cannot install '%s'
ru: Не могу установить «%s»

source: Automatically decompressed:
ru: Автоматически распакованные данные:

source: Automatically converted to printable ascii:
ru: Автоматически преобразованные в ASCII данные:

source: Install Build-Dependencies for source package '%s' that builds %s
ru: Установить зависимости сборки для пакета исходного кода '%s', который собирает %s

source: An essential package would be removed
ru: Необходимые пакеты будут удалены.

source: %c%s... Done
ru: %c%s... Выполнено

source: Hit
ru: В кэше

source: Ign
ru: Игн

source: Err
ru: Ошибка

source: Get:
ru: Получено:

source: [Working]
ru: [Ожидание]

source: Media change: please insert the disc labeled '%s' in the drive '%s' and press enter
ru: Смена носителя: вставьте диск с меткой '%s' в устройство '%s' и нажмите ввод

source: Fetched %sB in %s (%sB/s)
ru: Получено %sБ за %s (%sБ/c)

source: Please provide a name for this Disc, such as 'Debian 2.1r1 Disk 1'
ru: Пожалуйста, укажите имя для этого диска, например 'Debian 2.1r1 Disk 1'

source: Please insert a Disc in the drive and press enter
ru: Пожалуйста, вставьте диск в устройство и нажмите ввод
