Repository: PlagaMedicum/Ubuntu-Translation-Demo
Catalog: Focal/*/LC_MESSAGES/xdg-desktop-portal.po
Languages: ru

source: Allow %s to run in the background?
ru: Разрешить %s выполняться в фоновом режиме?

source: %s requests to be started automatically and run in the background.
ru: %s запросов на автоматический запуск и выполнение в фоновом режиме.

source: %s requests to run in the background.
ru: %s запросов на выполнение в фоновом режиме.

source: The ‘run in background’ permission can be changed at any time from the application settings.
ru: Разрешение на ‘Выполнение в фоновом режиме’, может быть изменено в настройках приложения в любое время.

source: Don't allow
ru: Не разрешать

source: Allow
ru: Разрешить

source: Turn On Microphone?
ru: Включить микрофон?

source: Access to your microphone can be changed at any time from the privacy settings.
ru: Режим доступа к вашему микрофону, может быть изменён в любое время, в настройках конфиденциальности.

source: An application wants to use your microphone.
ru: Приложение намеревается использовать ваш микрофон.

source: %s wants to use your microphone.
ru: %s намеревается использовать ваш микрофон.

source: Turn On Speakers?
ru: Включить громкоговорители?

source: Access to your speakers can be changed at any time from the privacy settings.
ru: Режим доступа к вашим громкоговорителям, может быть изменён в любое время, в настройках конфиденциальности.

source: An application wants to play sound.
ru: Приложение намеревается воспроизвести звук.

source: %s wants to play sound.
ru: %s намеревается воспроизвести звук.

source: Turn On Camera?
ru: Включить камеру?

source: Access to your camera can be changed at any time from the privacy settings.
ru: Режим доступа к вашей камере, может быть изменён в любое время, в настройках конфиденциальности.

source: An application wants to use your camera.
ru: Приложение намеревается использовать вашу камеру.

source: %s wants to use your camera.
ru: %s намеревается использовать вашу камеру.

source: Deny Access
ru: Запретить доступ

source: Grant Access
ru: Разрешить доступ

source: Grant Access to Your Location?
ru: Разрешить доступ к вашему местоположению?

source: An application wants to use your location.
ru: Приложение намеревается использовать ваше местоположение.

source: Give %s Access to Your Location?
ru: Разрешить доступ %s к вашему местоположению?

source: %s wants to use your location.
ru: %s намеревается использовать ваше местоположение.

source: Location access can be changed at any time from the privacy settings.
ru: Режим доступа к местоположению, может быть изменён в любое время, в настройках конфиденциальности.

source: Requested setting not found
ru: Запрошенный параметр не найден

source: Deny
ru: Запретить

source: Allow Applications to Set Backgrounds?
ru: Разрешить приложениям устанавливать фоновое изображение?

source: An application is requesting to be able to change the background image.
ru: Приложение запрашивает разрешение, на изменение фонового изображения.

source: Allow %s to Set Backgrounds?
ru: Разрешить %s устанавливать фоновое изображение?

source: %s is requesting to be able to change the background image.
ru: %s запрашивает разрешение на изменение фонового изображения.

source: This permission can be changed at any time from the privacy settings.
ru: Это разрешение может быть изменено в любое время, в настройках конфиденциальности.
