Repository: PlagaMedicum/Ubuntu-Translation-Demo
Catalog: Focal/*/LC_MESSAGES/xz.po
Languages: uk

source: %s: Invalid argument to --block-list
uk: %s: хибний аргумент для --block-list

source: %s: Too many arguments to --block-list
uk: %s: забагато аргументів для --block-list

source: 0 can only be used as the last element in --block-list
uk: 0 може використовуватися як останній елемент в --block-list

source: %s: Unknown file format type
uk: %s: Невідомий формат файлу

source: %s: Unsupported integrity check type
uk: %s: непідтримуваний тип перевірки цілісності

source: Only one file can be specified with `--files' or `--files0'.
uk: Лише один файл може бути визначено із паметром `--files' або `--files0'.

source: The environment variable %s contains too many arguments
uk: Змінна середовища %s містить забагато аргументів

source: Compression support was disabled at build time
uk: Підтримку стискання було вимкнено під час збирання програми

source: Decompression support was disabled at build time
uk: Підтримку розпаковування було вимкнено під час збирання програми

source: Maximum number of filters is four
uk: Максимальна кількість фільтрів - чотири (4)

source: Memory usage limit is too low for the given filter setup.
uk: Обмеження використання пам’яті є занадто малі для встановленого фільтру

source: Using a preset in raw mode is discouraged.
uk: Використання заданого у «сирому» режимі не рекомендується.

source: The exact options of the presets may vary between software versions.
uk: Точні параметри заданого можуть варіюватися між версіями програми.

source: The .lzma format supports only the LZMA1 filter
uk: Формат .lzma підтримує лише фільтр LZMA1

source: LZMA1 cannot be used with the .xz format
uk: LZMA1 не може використовуватися у форматі .xz

source: The filter chain is incompatible with --flush-timeout
uk: Ланцюг фільтра несумісний з --time-timeout

source: Switching to single-threaded mode due to --flush-timeout
uk: Перемикання в однопотоковий режим у зв'язку з --flush-timeout

source: Using up to %<PRIu32> threads.
uk: Задіяно до %<PRIu32> потоків.

source: Unsupported filter chain or filter options
uk: Непідтримуваний ланцюжок фільтрів або опцій фільтрування

source: Decompression will need %s MiB of memory.
uk: Розпакування потребуватиме %s Mб пам’яті

source: Adjusted the number of threads from %s to %s to not exceed the memory usage limit of %s MiB
uk: Відрегульовано кількість потоків з %s до %s, щоб не перевищувати обмеження на використання пам'яті в %s МіБ

source: Adjusted LZMA%c dictionary size from %s MiB to %s MiB to not exceed the memory usage limit of %s MiB
uk: Скориговано LZMA%c розмір словника з %s MiB у %s MiB, щоб не перевищувати межу використання пам'яті %s MiB

source: Error creating a pipe: %s
uk: Помилка створення каналу: %s

source: Sandbox is disabled due to incompatible command line arguments
uk: Пісочницю вимкнено через несумісні параметри у рядку команди

source: Sandbox was successfully enabled
uk: Пісочницю успішно увімкнено

source: Failed to enable the sandbox
uk: Не вдалося увімкнути пісочницю

source: %s: poll() failed: %s
uk: %s: poll() завершився невдачею: %s

source: %s: File seems to have been moved, not removing
uk: %s: Файл, можливо, було перенесено (не вилучено)

source: %s: Cannot remove: %s
uk: %s: не вдалося вилучити: %s

source: %s: Cannot set the file owner: %s
uk: %s: не вдалося встановити власника файлу: %s

source: %s: Cannot set the file group: %s
uk: %s: не вдалося встановити групу файлу: %s

source: %s: Cannot set the file permissions: %s
uk: %s: не вдалося встановити права доступу до файлу: %s

source: Error getting the file status flags from standard input: %s
uk: Помилка отримання прапорів статусу файлу зі стандартного вводу: %s

source: %s: Is a symbolic link, skipping
uk: %s: це символьне посилання, пропускаємо

source: %s: Is a directory, skipping
uk: %s: це каталог, пропускаємо

source: %s: Not a regular file, skipping
uk: %s: Не регулярний файл, пропустити

source: %s: File has setuid or setgid bit set, skipping
uk: %s: файл має встановлений setuid або setgid, пропускаємо

source: %s: File has sticky bit set, skipping
uk: %s: Файл має встановленим sticky bit, пропущено

source: %s: Input file has more than one hard link, skipping
uk: %s: вхідний файл має більше одного жорсткого посилання, пропускаємо

source: Error restoring the status flags to standard input: %s
uk: Помилка відновлення прапорів стану до стандартного вводу: %s

source: Error getting the file status flags from standard output: %s
uk: Помилка отримання прапорів статусу файлу зі стандартного виводу: %s

source: Error restoring the O_APPEND flag to standard output: %s
uk: Помилка відновлення прапорця O_APPEND для стандартного виводу: %s

source: %s: Closing the file failed: %s
uk: %s: Невдале закриття файлу: %s

source: %s: Seeking failed when trying to create a sparse file: %s
uk: %s: Пошук зазнав невдачі при спробі створити розріджений файл: %s

source: %s: Read error: %s
uk: %s: Помилка зчитування: %s

source: %s: Error seeking the file: %s
uk: %s: Помилка пошуку файлу: %s

source: %s: Unexpected end of file
uk: %s: Неочікуваний кінець файлу

source: %s: Write error: %s
uk: %s: Помилка запису: %s

source: Disabled
uk: Вимкнено

source: Total amount of physical memory (RAM):
uk: Загальний обсяг фізичної пам’яті (RAM):

source: Memory usage limit for compression:
uk: Ліміт використання пам’яті для стиснення:

source: Memory usage limit for decompression:
uk: Ліміт використання пам’яті для розпакування:

source: None
uk: Немає

source: Unknown-2
uk: Невідомо-2

source: Unknown-3
uk: Невідомо-3

source: Unknown-5
uk: Невідомо-5

source: Unknown-6
uk: Невідомо-6

source: Unknown-7
uk: Невідомо-7

source: Unknown-8
uk: Невідомо-8

source: Unknown-9
uk: Невідомо-9

source: Unknown-11
uk: Невідомо-11

source: Unknown-12
uk: Невідомо-12

source: Unknown-13
uk: Невідомо-13

source: Unknown-14
uk: Невідомо-14

source: Unknown-15
uk: Невідомо-15

source: %s: File is empty
uk: %s: Файл порожній

source: %s: Too small to be a valid .xz file
uk: %s: Файл .xz занадто маленький щоб бути дійсним

source: Strms Blocks Compressed Uncompressed Ratio Check Filename
uk: Потоки Блоки Стиснуті Витягнуті Коефіцієнт Перевірка Ім’я файлу

source: Streams: %s
uk: Потоки: %s

source: Blocks: %s
uk: Блоки: %s

source: Compressed size: %s
uk: Розмір після стиснення: %s

source: Uncompressed size: %s
uk: Розмір до стиснення: %s

source: Ratio: %s
uk: Співвідношення: %s

source: Check: %s
uk: Перевірка: %s

source: Stream padding: %s
uk: Доповнення потоку: %s

source: Streams: Stream Blocks CompOffset UncompOffset CompSize UncompSize Ratio Check Padding
uk: Потоки: Потік Блоки ЗміщенняСтиснення ЗміщенняВитягнення РозмірСтисненого РозмірВитягнутого Коефіцієнт Перевірка Вирівнювання

source: Blocks: Stream Block CompOffset UncompOffset TotalSize UncompSize Ratio Check
uk: Блоки: Потік Блок ЗміщенняСтиснутого ЗміщенняВитягнутого ЗагальнийРозмір РозмірВитягнутого Коефіцієнт Перевірка

source: CheckVal %*s Header Flags CompSize MemUsage Filters
uk: ПеревіркаЗнч %*s Заголовок Прапорці СтиснутийРозмір ВикПам’яті Фільтри

source: Memory needed: %s MiB
uk: Необхідний обсяг пам’яті: %s Мб

source: Sizes in headers: %s
uk: Розміри у заголовках: %s

source: Yes
uk: Так

source: No
uk: Ні

source: Minimum XZ Utils version: %s
uk: Мінімальна версія XZ утиліт: %s

source: %s file
uk: %s файл

source: Totals:
uk: Підсумки:

source: Number of files: %s
uk: Кількість файлів: %s

source: --list works only on .xz files (--format=xz or --format=auto)
uk: --список працює лише з файлами .xz (--формат=xz або --формат=авто)

source: --list does not support reading from standard input
uk: --список не підтримує читання стандартного вводу

source: %s: Error reading filenames: %s
uk: %s: Помилка при читанні імен файлів: %s

source: %s: Unexpected end of input when reading filenames
uk: %s: Неочікуваний кінець вводу при читанні імен файлів

source: %s: Null character found when reading filenames; maybe you meant to use `--files0' instead of `--files'?
uk: %s: При читанні імен файлів знайдено Null-символ; можливо ви мали на увазі `--files0' замість `--files'?

source: Compression and decompression with --robot are not supported yet.
uk: Стиснення та розпаковування з параметром --robot наразі не підтримується.

source: Cannot read data from standard input when reading filenames from standard input
uk: Неможливо прочитати дані зі стандартного вводу при читанні імен файлів зі стандатрного вводу.

source: Internal error (bug)
uk: Внутрішня помика (bug)

source: Cannot establish signal handlers
uk: Неможливо встановити обробник сигналу

source: No integrity check; not verifying file integrity
uk: Немає перевірки цілісності; не перевірено цілісність файлу

source: Unsupported type of integrity check; not verifying file integrity
uk: Непідтримуваний тип перевірки цілісності; цілісність файлу не перевірено

source: Memory usage limit reached
uk: Досягнуто межі використання пам’яті

source: File format not recognized
uk: Невідомий формат файлу

source: Unsupported options
uk: Непідтримувані параметри

source: Compressed data is corrupt
uk: Стиснені дані пошкоджені

source: Unexpected end of input
uk: Несподіваний кінець вводу

source: %s MiB of memory is required. The limiter is disabled.
uk: Вимагається %s МБ пам’яті. Обмежувач вимкнено.

source: %s MiB of memory is required. The limit is %s.
uk: %s MiB пам’яті потрібно. Межа %s.

source: %s: Filter chain: %s
uk: %s: Послідовність фільтрів: %s

source: Try `%s --help' for more information.
uk: Спробуйте `%s --help', щоб отримати більше інформації.

source: Usage: %s [OPTION]... [FILE]... Compress or decompress FILEs in the .xz format.
uk: Використання: %s [OPTION]... [FILE]... Стиснення або розпаковування FILE в .xz формат.

source: Mandatory arguments to long options are mandatory for short options too.
uk: Обов’язкові аргументи для довгих форм запису параметрів є обов’язковими і для скорочених форм.

source: Operation mode:
uk: Режим операції:

source: -z, --compress force compression -d, --decompress force decompression -t, --test test compressed file integrity -l, --list list information about .xz files
uk: -z, --compress примусове стиснення -d, --decompress примусове розпакування -t, --test перевірити цілісність стисненого файлу -l, --list показати інформацію про .xz файли

source: Operation modifiers:
uk: Модифікатори операції:

source: -k, --keep keep (don't delete) input files -f, --force force overwrite of output file and (de)compress links -c, --stdout write to standard output and don't delete input files
uk: -k, --keep залишити (не вилучати) вхідні файли -f, --force перезаписати вихідні файли і зв’язки -c, --stdout здійснити вивід у стандартний вивід і не вилучати вхідні файли

source: --single-stream decompress only the first stream, and silently ignore possible remaining input data
uk: --single-stream витягує лише перший потік й сховано пропускає можливі ввідні дані що залишилися

source: --no-sparse do not create sparse files when decompressing -S, --suffix=.SUF use the suffix `.SUF' on compressed files --files[=FILE] read filenames to process from FILE; if FILE is omitted, filenames are read from the standard input; filenames must be terminated with the newline character --files0[=FILE] like --files but use the null character as terminator
uk: --no-sparse не створювати часткові файли при витягуванні -S, --suffix=.SUF використовувати суфікс `.SUF' для стиснених файлів --files[=FILE] читати назви файлів для обробки з FILE; якщо файл FILE пропущено, назви файлів читаються зі стандартного вводу; назви файлів мають бути закінчено символом переводу рядка --files0[=FILE] like --files але використовується символ пробілу у якості закінчуючого

source: Basic file format and compression options:
uk: Основні параметри формату файлу та стиснення:

source: -F, --format=FMT file format to encode or decode; possible values are `auto' (default), `xz', `lzma', and `raw' -C, --check=CHECK integrity check type: `none' (use with caution), `crc32', `crc64' (default), or `sha256'
uk: -F, --format=FMT формат файлу для кодування або декодування; можливі значення `auto' (типово), `xz', `lzma' й `raw' -C, --check=CHECK тип перевірки цілісності: `none' (використовуйте уважно), `crc32', `crc64' (типово) або `sha256'

source: --ignore-check don't verify the integrity check when decompressing
uk: --ignore-check не перевіряти перевірку цілісності при розпаковуванні

source: -0 ... -9 compression preset; default is 6; take compressor *and* decompressor memory usage into account before using 7-9!
uk: -0 ... -9 профіль стиснення; типово 6; для використання режимів стиснення *й* витягування 7-9,переконайтеся у достатній кількості пам’яті!

source: -e, --extreme try to improve compression ratio by using more CPU time; does not affect decompressor memory requirements
uk: -e, --extreme спробувати збільшити стискання за рахунок часу CPU; не впливає на вимоги до пам'яті декомпрессор

source: -T, --threads=NUM use at most NUM threads; the default is 1; set to 0 to use as many threads as there are processor cores
uk: -T, --threads=ЧИСЛО використовувати максимум NUM потоків; типове значення 1; задайте 0 щоб використовувати стільки ж потоків, скількі ядер в процесорі

source: --block-size=SIZE start a new .xz block after every SIZE bytes of input; use this to set the block size for threaded compression
uk: --block-size=РОЗМІР починати новий блок .xz block через кожні SIZE введених байт; використовуйте цей параметр, щоб встановити розмір блоку для потокового стиснення

source: --block-list=SIZES start a new .xz block after the given comma-separated intervals of uncompressed data
uk: --block-list=РОЗМІРИ починати новий блок .xz після вказаних через кому інтервалів нестиснених даних

source: --flush-timeout=TIMEOUT when compressing, if more than TIMEOUT milliseconds has passed since the previous flush and reading more input would block, all pending data is flushed out
uk: --flush-timeout=ЧАС при стисненні, якщо пройшло понад ЧАС мілісекунд з попереднього очищення і продовження читання вводу буде заблоковане, всі дані, що очікують, очищуюються

source: --memlimit-compress=LIMIT --memlimit-decompress=LIMIT -M, --memlimit=LIMIT set memory usage limit for compression, decompression, or both; LIMIT is in bytes, % of RAM, or 0 for defaults
uk: --memlimit-compress=LIMIT --memlimit-decompress=LIMIT -M, --memlimit=LIMIT призначає обмеження доступної пам’яті для стиснення, витягування, або обох операцій; LIMIT вказується у байтах, % від ОЗУ або 0 для використання типових налаштувань

source: --no-adjust if compression settings exceed the memory usage limit, give an error instead of adjusting the settings downwards
uk: --no-adjust якщо параметри стиснення перевищують обмеження доступної пам’яті, видають помилку замість вирівнювання до вказаних параметрів

source: Custom filter chain for compression (alternative for using presets):
uk: Користувацька послідовність фільтрів для стиснення (альтернатива до використання наборів):

source: --lzma1[=OPTS] LZMA1 or LZMA2; OPTS is a comma-separated list of zero or --lzma2[=OPTS] more of the following options (valid values; default): preset=PRE reset options to a preset (0-9[e]) dict=NUM dictionary size (4KiB - 1536MiB; 8MiB) lc=NUM number of literal context bits (0-4; 3) lp=NUM number of literal position bits (0-4; 0) pb=NUM number of position bits (0-4; 2) mode=MODE compression mode (fast, normal; normal) nice=NUM nice length of a match (2-273; 64) mf=NAME match finder (hc3, hc4, bt2, bt3, bt4; bt4) depth=NUM maximum search depth; 0=automatic (default)
uk: --lzma1[=OPTS] LZMA1 або LZMA2; OPTS це перелік вказуваних через кому нульових або --lzma2[=OPTS] декількох параметрів (діючих значень, типово): preset=PRE відновити параметри профілю (0-9[e]) dict=NUM розмір словника (4 КБ - 1536 МБ; 8 МБ) lc=NUM кількість літерових контекстних біт (0-4; 3) lp=NUM кількість літерових позиційних біт (0-4; 0) pb=NUM кількість позиційних біт (0-4; 2) mode=MODE режим стиснення (швидкий, нормальний, нормальний) nice=NUM підходяща довжина відповідності (2-273; 64) mf=NAME пошук відповідностей (hc3, hc4, bt2, bt3, bt4; bt4) depth=NUM максимальна глибина пошуку; 0=автоматична (типово)

source: --x86[=OPTS] x86 BCJ filter (32-bit and 64-bit) --powerpc[=OPTS] PowerPC BCJ filter (big endian only) --ia64[=OPTS] IA-64 (Itanium) BCJ filter --arm[=OPTS] ARM BCJ filter (little endian only) --armthumb[=OPTS] ARM-Thumb BCJ filter (little endian only) --sparc[=OPTS] SPARC BCJ filter Valid OPTS for all BCJ filters: start=NUM start offset for conversions (default=0)
uk: --x86[=OPTS] x86 BCJ фільтр (32-розрядні та 64-розрядні) --powerpc[=OPTS] PowerPC BCJ фільтр (лише зворотній порядок байтів) --ia64[=OPTS] IA-64 (Itanium) BCJ фільтр --arm[=OPTS] ARM BCJ фільтр (лише прямий порядок байтів) --armthumb[=OPTS] ARM-Thumb BCJ фільтр (лише прямий порядок байтів) --sparc[=OPTS] SPARC BCJ фільтр Діючі OPTS для усіх фільтрів BCJ: start=NUM виконати зміщення для перетворень (типово=0)

source: --delta[=OPTS] Delta filter; valid OPTS (valid values; default): dist=NUM distance between bytes being subtracted from each other (1-256; 1)
uk: --delta[=ОПЦІЇ] Дельта фільтр; допустимі ОПЦІЇ: dist=ВІДСТАНЬ між байтами що може бути віднято один від одного (1-256; 1)

source: Other options:
uk: Інші параметри:

source: -q, --quiet suppress warnings; specify twice to suppress errors too -v, --verbose be verbose; specify twice for even more verbose
uk: -q, --quiet приховувати зауваження; використати двічі для приховування помилок -v, --verbose деталізація; використати двічі для більшої деталізації

source: -Q, --no-warn make warnings not affect the exit status
uk: -Q, --no-warn повідомлення не впливають на статус виходу

source: --robot use machine-parsable messages (useful for scripts)
uk: --robot використовувати повідомлення, що можуть оброблятися машиною (використовується у скриптах)

source: --info-memory display the total amount of RAM and the currently active memory usage limits, and exit
uk: --info-memory показує доступну RAM і активну на даний час ліміт використання пам'яті і вихід

source: -h, --help display the short help (lists only the basic options) -H, --long-help display this long help and exit
uk: -h, --help показати коротку допомогу (лише список основних параметрів) -H, --long-help показати повну допомогу та вийти

source: -h, --help display this short help and exit -H, --long-help display the long help (lists also the advanced options)
uk: -h, --help показати коротку допомогу і вийти -H, --long-help показати повну допомогу (список з розширеними параметрами)

source: -V, --version display the version number and exit
uk: -V, --version показати номер версії та вийти

source: With no FILE, or when FILE is -, read standard input.
uk: Якщо вхідний файл не вказаний, або якщо вказано символ -, використовується стандартний ввід.

source: Report bugs to <%s> (in English or Finnish).
uk: Відзвітуйте про помилку на <%s> (Англійською чи Фінською мовами).

source: %s home page: <%s>
uk: %s домашня сторінка: <%s>

source: THIS IS A DEVELOPMENT VERSION NOT INTENDED FOR PRODUCTION USE.
uk: ЦЕ ТЕСТОВА ВЕРСІЯ, ЩО НЕ ПРИЗНАЧЕНА ДЛЯ ВИКОРИСТАННЯ В РОБОЧИХ СИСТЕМАХ

source: %s: Options must be `name=value' pairs separated with commas
uk: %s: Параметри мають бути у вигляді пар `name=value' розділених комами

source: %s: Invalid option name
uk: %s: Недійсне ім’я параметру

source: %s: Invalid option value
uk: %s: Недійсне значення параметру

source: Unsupported LZMA1/LZMA2 preset: %s
uk: Непідтримуваний LZMA1/LZMA2 набір: %s

source: The sum of lc and lp must not exceed 4
uk: Загальна кількість lc та lp не повинна перевищувати 4

source: The selected match finder requires at least nice=%<PRIu32>
uk: Обраний алгоритм збігів потребує принаймні пріоритет рівний %<PRIu32>

source: %s: With --format=raw, --suffix=.SUF is required unless writing to stdout
uk: %s: --format=raw и --suffix=.SUF вимагаються лише, якщо вивід йде у стандартний вивід (stdout)

source: %s: Filename has an unknown suffix, skipping
uk: %s: Ім’я файлу має невідомий суфікс, пропущено

source: %s: File already has `%s' suffix, skipping
uk: %s: Файл вже має суфікс `%s' , пропущено

source: %s: Invalid filename suffix
uk: %s: Невірний суфікс імені файлу

source: %s: Value is not a non-negative decimal integer
uk: %s: Значення не є невід’ємним цілим числом

source: %s: Invalid multiplier suffix
uk: %s: Невірний множинний суфікс

source: Valid suffixes are `KiB' (2^10), `MiB' (2^20), and `GiB' (2^30).
uk: Можливі суфікси `KiB' (2^10), `MiB' (2^20), і `GiB' (2^30).

source: Value of the option `%s' must be in the range [%<PRIu64>, %<PRIu64>]
uk: Значення параметру `%s' повинне бути у межах [%<PRIu64>, %<PRIu64>]

source: Empty filename, skipping
uk: Порожнє ім’я файлу, пропущено

source: Compressed data cannot be read from a terminal
uk: Стиснені дані не можуть бути прочитані з терміналу

source: Compressed data cannot be written to a terminal
uk: Стиснені дані не можуть бути записані у термінал

source: Writing to standard output failed
uk: Помилка запису до стандартного виводу

source: Unknown error
uk: Невідома помилка
