Repository: PlagaMedicum/Ubuntu-Translation-Demo
Catalog: Eoan-new/*/LC_MESSAGES/gnome-games.po
Languages: ru

source: Games
ru: Игры

source: Simple game launcher for GNOME
ru: Простое приложение GNOME для запуска игр

source: Games is a GNOME 3 application to browse your video games library and to easily pick and play a game from it. It aims to do for games what Music already does for your music library.
ru: Игры GNOME — это приложение GNOME 3 для просмотра вашей библиотеки видеоигр и для простого выбора и запуска игр из неё. Оно стремится сделать для игр то же, что Музыка GNOME уже делает для вашей музыкальной библиотеки.

source: You want to install Games if you just want a very simple and comfortable way to play your games and you don’t need advanced features such as speedrunning tools or video game development tools.
ru: Вы хотите установить Игры GNOME, если вы просто хотите очень простой и комфортный способ играть в игры и не нуждаетесь в продвинутых возможностях, таких как инструменты для быстрого прохождения или разработки видеоигр.

source: Features:
ru: Возможности:

source: List your installed games, your Steam games, your game ROMs…
ru: Просматривайте установленные игры, игры в Steam, образы игр…

source: Search in your games collection
ru: Ищите по вашей коллекции игр

source: Play your games
ru: Играйте в игры

source: Resume your game to where you left it
ru: Продолжайте игру с того места, где вы вышли

source: Video game player
ru: Запуск видеоигр

source: View and play your video games collection
ru: Просмотр и запуск видеоигр из вашей коллекции

source: game;videogame;video game;player;
ru: игра;видеоигры;видео игры;приставка;приставки;

source: Fullscreen
ru: Полноэкранный режим

source: Whether the games should be displayed in full screen or not.
ru: Должны ли игры отображаться в полноэкранном режиме.

source: Video filter
ru: Видеофильтр

source: Filter for the game video output. Allowed values are: “smooth” (blurry pixels), “sharp” (blocky pixels), “crt” (CRT emulation).
ru: Фильтр для видеовывода игр. Разрешённые значения: «smooth» (сглаженные пикселы), «sharp» (различимые пикселы), «crt» (эмуляция кинескопа).

source: Window maximized
ru: Окно развёрнуто

source: Window maximized state.
ru: Окно максимального размера.

source: Window size
ru: Размер окна

source: Window size (width and height).
ru: Размер окна (ширина и высота)

source: Developers
ru: Разработчики

source: Platforms
ru: Платформы

source: Loading
ru: Загрузка

source: Add game files…
ru: Добавить файлы игр…

source: Menu
ru: Меню

source: Search
ru: Поиск

source: Preferences
ru: Параметры

source: Keyboard Shortcuts
ru: Комбинации клавиш

source: Help
ru: Справка

source: About Games
ru: О приложении Игры

source: Back
ru: Назад

source: Restore
ru: Восстановить

source: This is a dummy game display
ru: Это фиктивный игровой дисплей

source: If you see this, this is a bug.
ru: Если вы это видите, произошла ошибка.

source: Please contact the developers.
ru: Пожалуйста, свяжитесь с разработчиками.

source: No games found
ru: Игры не найдены

source: Install games or add directories containing games to your search sources.
ru: Установите игры или добавьте каталоги, содержащие игры, в источники поиска.

source: Gamepad Input
ru: Геймпад

source: Keyboard Input
ru: Клавиатура

source: Media
ru: Носители

source: Gamepads
ru: Геймпады

source: Keyboard
ru: Клавиатура

source: Filter
ru: Фильтр

# Keyboard configuration factory reset
source: Reset
ru: Сбросить

source: Configure
ru: Настроить

source: Skip
ru: Пропустить

source: Cancel
ru: Отмена

source: Are you sure you want to quit?
ru: Вы уверены, что хотите выйти?

source: All unsaved progress will be lost.
ru: Весь несохранённый прогресс будет потерян.

source: Quit
ru: Выйти

source: Use the game’s own window to play it
ru: Используйте окно игры

source: This game isn’t integrated to GNOME Games.
ru: Эта игра не интегрирована в приложение.

source: You have to use its own window to play it.
ru: Необходимо использовать её собственное окно.

source: Factory reset mapping for this controller?
ru: Сбросить настройки для этого устройства управления?

source: Your mapping will be lost.
ru: Ваши настройки будут утеряны.

# Confirm controller configuration factory reset
source: Reset
ru: Сбросить

source: Resume last game?
ru: Продолжить последнюю игру?

source: Restart
ru: Перезапустить

source: Resume
ru: Продолжить

source: Resuming failed. Do you want to restart the game?
ru: Продолжить не удалось. Хотите перезапустить игру?

# Resuming a game failed dialog
source: Reset
ru: Перезапустить

source: Shortcuts
ru: Комбинации

source: General
ru: Основное

# shortcut window
source: Quit
ru: Выход

source: Collection
ru: Коллекция

# shortcut window
source: Search
ru: Поиск

# shortcut window
source: Navigate
ru: Навигация

# shortcut window
source: Left analog stick
ru: Левый аналоговый стик

# shortcut window
source: Directional pad
ru: Кнопки направления

# shortcut window
source: Select view
ru: Выбор вида

# shortcut window
source: Front shoulder buttons
ru: Боковые кнопки

# shortcut window
source: Start game
ru: Начать игру

# shortcut window
source: Start button
ru: Кнопка Старт

# shortcut window
source: Bottom action button
ru: Нижняя кнопка действия

source: In Game
ru: В игре

# shortcut window
source: Toggle fullscreen
ru: Переключить полноэкранный режим

# shortcut window
source: Exit fullscreen
ru: Выйти из полноэкранного режима

# shortcut window
source: Go back to the collection
ru: Вернуться к коллекции

# shortcut window
source: Home button
ru: Кнопка Дом

# shortcut window
source: Accept
ru: Принять

# shortcut window
source: Cancel
ru: Отменить

# shortcut window
source: Right action button
ru: Правая кнопка действия

source: Cheats
ru: Чит-коды

# shortcut window
source: Contribute
ru: Сделать вклад

source: Desktop
ru: PC

source: Invalid command “%s”.
ru: Некорректная команда «%s».

source: Tracker listed file not found: “%s”.
ru: Файл, содержащийся в базе Tracker, не найден: «%s».

source: Couldn’t parse desktop entry “%s”.
ru: Не удалось разобрать файл .desktop «%s».

source: “%s” shouldn’t be displayed.
ru: «%s» не должен отображаться.

source: “%s” is hidden.
ru: «%s» скрыт.

source: “%s” has blacklisted category “%s”.
ru: «%s» содержит категорию «%s» из чёрного списка.

source: “%s” has blacklisted executable “%s”.
ru: «%s» содержит исполняемый файл «%s» из чёрного списка.

source: “%s” is blacklisted.
ru: «%s» находится в чёрном списке.

source: The file doesn’t have a Dreamcast header.
ru: Файл не содержит заголовка Dreamcast.

source: The file doesn’t have a Game Cube header.
ru: Файл не содержит заголовка GameCube.

source: This doesn’t represent a valid LÖVE package: “%s”.
ru: «%s» не является корректным пакетом LÖVE.

source: Invalid MAME game id “%s” for “%s”.
ru: Некорректный ID игры MAME «%s» для «%s».

source: Arcade
ru: Аркада

source: Not a PlayStation disc: “%s”.
ru: «%s» не является диском PlayStation.

source: Invalid PlayStation header: disc ID not found in “%s”.
ru: Некорректный заголовок PlayStation: ID диска не найден в «%s».

source: The file doesn’t have a Genesis/Sega 32X/Sega CD/Sega Pico header.
ru: Файл не содержит заголовка Genesis/Sega 32X/Sega CD/Sega Pico.

source: The file “%s” doesn’t have a track.
ru: Файл «%s» не содержит дорожки.

source: The file “%s” doesn’t have a valid binary file format.
ru: Файл «%s» не содержит двоичного файла корректного формата.

source: The file “%s” doesn’t have a valid track mode for track %d.
ru: Файл «%s» не содержит корректного режима для дорожки %d.

source: The file doesn’t have a Sega Saturn header.
ru: Файл не содержит заголовка Sega Saturn.

source: The file “%s” doesn’t have a valid Sega Saturn binary file.
ru: Файл «%s» не содержит корректного файла Sega Saturn.

source: Couldn’t get Steam appid from manifest “%s”.
ru: Не удалось получить идентификатор Steam из манифеста «%s».

source: File “%s” doesn’t exist.
ru: Файл «%s» не существует.

source: Unexpected token '{'.
ru: Неожиданный токен «{».

source: Unexpected end of tokens.
ru: Неожиданный конец токенов.

source: Unexpected token '}'.
ru: Неожиданный токен «}».

source: Couldn’t get name from Steam registry.
ru: Не удалось получить имя из реестра Steam.

source: The file is too short.
ru: Файл слишком короткий.

source: Invalid Virtual Boy ROM header size: %s
ru: Некорректный размер заголовка Virtual Boy ROM: %s

source: Invalid Virtual Boy ROM header size.
ru: Некорректный размер заголовка Virtual Boy ROM.

source: The file doesn’t have a Virtual Boy ROM header.
ru: Файл не содержит заголовка Virtual Boy ROM.

source: Couldn’t get file size: %s
ru: Не удалось получить размер файла: %s

source: Couldn’t read file: %s
ru: Не удалось прочитать файл: %s

source: Invalid Wii header size: %s
ru: Некорректный размер заголовка Wii: %s

source: The file doesn’t have a Wii header.
ru: Файл не содержит заголовка Wii.

source: The game doesn’t have a valid command.
ru: Игра не содержит корректной команды.

source: Couldn’t run “%s”: execution failed.
ru: Не удалось запустить «%s»: ошибка при выполнении.

source: Invalid media index %u.
ru: Некорректный номер диска %u.

source: Invalid plugin descriptor: %s
ru: Некорректный дескриптор плагина: %s

source: Couldn’t create a new instance of plugin in “%s”.
ru: Не удалось создать новый экземпляр плагина в «%s».

source: Unknown
ru: Неизвестный

source: Disc %d
ru: Диск %d

source: No game title found for disc ID “%s”.
ru: Не найдено название игры для ID диска «%s».

source: No disc title found for disc ID “%s”.
ru: Не найдено название диска для ID диска «%s».

source: No disc set ID found for disc ID “%s”.
ru: Не найден ID набора дисков для ID диска «%s».

source: No disc found for disc ID “%s”.
ru: Не найден диск для ID диска «%s».

source: Single-player
ru: Однопользовательская

source: Multi-player
ru: Многопользовательская

source: No module found for platform “%s” and MIME types [ “%s” ].
ru: Не найден модуль для платформы «%s» и MIME-типов [ «%s» ].

source: This game requires the %s firmware file to run.
ru: Этой игре для запуска необходим образ BIOS «%s».

source: This game requires the %s firmware file with a MD5 fingerprint of %s to run.
ru: Этой игре для запуска необходим образ BIOS «%s» с контрольной суммой MD5 %s.

source: This game requires the %s firmware file with a SHA-512 fingerprint of %s to run.
ru: Этой игре для запуска необходим образ BIOS «%s» с контрольной суммой SHA-512 %s.

source: No module found for “%s”.
ru: Не найден модуль для «%s».

source: Unknown platform
ru: Неизвестная платформа

source: The system “%s” isn’t supported yet, but full support is planned.
ru: Система «%s» ещё не поддерживается, но полная поддержка ожидается в будущем.

source: The system isn’t supported yet, but full support is planned.
ru: Система ещё не поддерживается, но полная поддержка ожидается в будущем.

source: Select game files
ru: Выберите файлы игр

source: _Cancel
ru: _Отмена

source: _Add
ru: _Добавить

source: GNOME Games
ru: Игры GNOME

source: A video game player for GNOME
ru: Приложение GNOME для запуска видеоигр

source: Learn more about GNOME Games
ru: Веб-страница

source: translator-credits
ru: Александр Михайленко <exalm7659@gmail.com>, 2018. Станислав Соловей <whats_up@tut.by>, 2018. Launchpad Contributions: Stas Solovey https://launchpad.net/~whats-up

source: An unexpected error occurred.
ru: Произошла неожиданная ошибка.

source: Playing a game
ru: Запущена игра

source: Oops! Unable to run “%s”
ru: Ой! Не удалось запустить «%s»

source: Oops! Unable to run the game
ru: Ой! Не удалось запустить игру

source: Press suitable button on your gamepad
ru: Нажмите подходящую кнопку на геймпаде

source: Move suitable axis left/right on your gamepad
ru: Переместите подходящий стик на геймпаде влево/вправо

source: Move suitable axis up/down on your gamepad
ru: Переместите подходящий стик на геймпаде вверх/вниз

source: Press suitable key on your keyboard
ru: Нажмите подходящую кнопку на клавиатуре

source: Media %d
ru: Диск %d

source: Controllers
ru: Контроллеры

source: Extensions
ru: Расширения

source: Smooth
ru: Сглаженный

source: Sharp
ru: Резкий

source: CRT
ru: Кинескоп

source: Video
ru: Видео

source: Testing %s
ru: Проверка %s

source: Configuring %s
ru: Настройка %s

source: Testing Keyboard
ru: Проверка клавиатуры

source: Configuring Keyboard
ru: Настройка клавиатуры

source: “%s” doesn’t have a track for index %u.
ru: «%s» не содержит трека под номером %u.

source: %s:%lu: Invalid file format %s, expected a valid file format or none.
ru: %s:%lu: Некорректный формат файла %s, ожидался корректный формат файла или ничего.

source: %s:%lu: Unexpected token TRACK before a FILE token.
ru: %s:%lu: Неожиданный токен «TRACK» перед токеном «FILE».

source: %s:%lu: Invalid track number %s, expected a number in the 1-99 range.
ru: %s:%lu: Некорректный номер дорожки %s, ожидалось число в диапазоне 1-99.

source: %s:%lu: Invalid track mode %s, expected a valid track mode.
ru: %s:%lu: Некорректный режим дорожки %s, ожидался корректный режим дорожки.

source: %s:%lu: Unexpected end of file, expected %s.
ru: %s:%lu: Неожиданный конец файла, ожидалось %s.

source: %s:%lu: Unexpected token %s, expected %s.
ru: %s:%lu: Неожиданный токен %s, ожидался %s.

source: %s:%lu: Unexpected end of file, expected a token.
ru: %s:%lu: Неожиданный конец файла, ожидался токен.

source: %s:%lu: Unexpected end of line, expected a token.
ru: %s:%lu: Неожиданный конец файла, ожидался токен.

source: %s:%lu: Unexpected token %s, expected end of line.
ru: %s:%lu: Неожиданный токен %s, ожидался конец файла.
