Repository: PlagaMedicum/Ubuntu-Translation-Demo
Catalog: Eoan-new/*/LC_MESSAGES/hunspell.po
Languages: ru

source: error - iconv_open: %s -> %s
ru: ошибка - iconv_open: %s -> %s

source: error - iconv: %s -> %s
ru: ошибка - iconv: %s -> %s

source: error - iconv_open: UTF-8 -> %s
ru: ошибка - iconv_open: UTF-8 -> %s

source: Can't create tmp dir
ru: Не удалось создать временный каталог

source: Can't open inputfile
ru: Невозможно открыть входной файл

source: Can't open %s.
ru: Не удалось открыть %s.

source: error - missing HOME variable
ru: ошибка - отсутствует переменная HOME

source: Line %d: %s ->
ru: Строка %d: %s ->

source: FORBIDDEN!
ru: ЗАПРЕЩЕНО!

source: Spelling mistake?
ru: Орфографическая ошибка?

source: %s File: %s
ru: %s Файл: %s

source: [SPACE] R)epl A)ccept I)nsert U)ncap S)tem Q)uit e(X)it or ? for help
ru: [ПРОБЕЛ] З)аменить П)ринять Д)обавить Н)ижРег О)снова В(ы)ход К)онец ?) Справка

source: Whenever a word is found that is not in the dictionary it is printed on the first line of the screen. If the dictionary contains any similar words, they are listed with a number next to each one. You have the option of replacing the word completely, or choosing one of the suggested words.
ru: Если найдено слово, отсутствующее в словаре, оно появится в первой строке экрана. Если в словаре есть похожие слова, будет показан их пронумерованный список. Можно заменить слово целиком или выбрать одно из предложенных.

source: Commands are:
ru: Команды:

source: R Replace the misspelled word completely.
ru: З Заменить ошибочное слово целиком.

source: Space Accept the word this time only.
ru: Пробел Пропустить слово.

source: A Accept the word for the rest of this session.
ru: П Пропустить слово до завершения проверки.

source: I Accept the word, and put it in your private dictionary.
ru: Д Пропустить и занести слово в личный словарь.

source: U Accept and add lowercase version to private dictionary.
ru: Н Пропустить и добавить слово в нижнем регистре в личный словарь.

source: S Ask a stem and a model word and store them in the private dictionary. The stem will be accepted also with the affixes of the model word.
ru: О Запросить основу и слово-образец и сохранить их в личном словаре. Основа будет добавлена со всеми формами слова-образца.

source: 0-n Replace with one of the suggested words.
ru: 0-n Заменить слово на одно из предложенных.

source: X Write the rest of this file, ignoring misspellings, and start next file.
ru: К Записать оставшуюся часть файла без проверки, и перейти к следующему.

source: Q Quit immediately. Asks for confirmation. Leaves file unchanged.
ru: Ы Выход с запросом подтверждения. Файл остается без изменений.

source: ^Z Suspend program. Restart with fg command.
ru: ^Z Приостановить программу. Для возврата к ней используйте fg.

source: ? Show this help screen.
ru: ? Показать справку.

source: -- Type space to continue --
ru: -- Нажмите пробел для продолжения --

source: r
ru: з

source: Replace with:
ru: Заменить на:

source: u
ru: н

source: i
ru: д

source: Cannot update personal dictionary.
ru: Не удалось обновить личный словарь.

source: a
ru: п

source: s
ru: о

source: New word (stem):
ru: Новое слово (основа):

source: Model word (a similar dictionary word):
ru: Образец (слово из словаря с такими же формами):

source: Model word must be in the dictionary. Press any key!
ru: Слово-образец должно содержаться в словаре! Нажмите любую клавишу.

source: x
ru: к

source: q
ru: ы

source: Are you sure you want to throw away your changes?
ru: Вы хотите отказаться от изменений?

source: y
ru: д

source: Can't create tempfile
ru: Невозможно создать временный файл

source: Can't open outputfile
ru: Невозможно открыть выходной файл

source: Usage: hunspell [OPTION]... [FILE]...
ru: Использование: hunspell [ПАРАМЕТРЫ]... [ФАЙЛЫ]...

source: Check spelling of each FILE. Without FILE, check standard input.
ru: Проверить правописание каждого ФАЙЛА. Если ФАЙЛ не указан, проверить стандартный ввод.

source: -1 check only first field in lines (delimiter = tabulator)
ru: -1 проверять только первое поле строки (разделитель = знак табуляции)

source: -a Ispell's pipe interface
ru: -a Канальный интерфейс Ispell

source: --check-url check URLs, e-mail addresses and directory paths
ru: --check-url проверка URL, e-mail адресов и путей к каталогам

source: --check-apostrophe check Unicode typographic apostrophe
ru: --check-apostrophe проверка типографских апострофов Unicode

source: -d d[,d2,...] use d (d2 etc.) dictionaries
ru: -d d[,d2,...] использовать d (d2 и др.) словари

source: -D show available dictionaries
ru: -D показать доступные словари

source: -G print only correct words or lines
ru: -G показать только правильные слова или строки

source: -h, --help display this help and exit
ru: -h, --help вывести этот текст и выйти

source: -H HTML input file format
ru: -H входной файл в формате HTML

source: -i enc input encoding
ru: -i имя кодировка текста

source: -l print misspelled words
ru: -l показать слова с орфографическими ошибками

source: -L print lines with misspelled words
ru: -L показать строки с орфографическими ошибками

source: -m analyze the words of the input text
ru: -m анализировать слова во входном тексте

source: -n nroff/troff input file format
ru: -n входной файл в формате nroff или troff

source: -O OpenDocument (ODF or Flat ODF) input file format
ru: -O формат входного файла OpenDocument (ODF или Flat ODF)

source: -p dict set dict custom dictionary
ru: -p словарь использовать словарь пользователя

source: -r warn of the potential mistakes (rare words)
ru: -r предупреждать о возможных ошибках (редких словах)

source: -P password set password for encrypted dictionaries
ru: -P password установить пароль для зашифрованных словарей

source: -s stem the words of the input text
ru: -s выделить основы из слов входного текста

source: -S suffix words of the input text
ru: -S суффиксные слова входного текста

source: -t TeX/LaTeX input file format
ru: -t входной файл в формате TeX/LaTeX

source: -v, --version print version number
ru: -v, --version вывести номер версии

source: -vv print Ispell compatible version number
ru: -vv вывести номер версии в формате Ispell

source: -w print misspelled words (= lines) from one word/line input.
ru: -w вывести слова с ошибками (= строки) из одного слова/строки.

source: -X XML input file format
ru: -X формат входного файла XML

source: Example: hunspell -d en_US file.txt # interactive spelling hunspell -i utf-8 file.txt # check UTF-8 encoded file hunspell -l *.odt # print misspelled words of ODF files # Quick fix of ODF documents by personal dictionary creation # 1 Make a reduced list from misspelled and unknown words: hunspell -l *.odt | sort | uniq >words # 2 Delete misspelled words of the file by a text editor. # 3 Use this personal dictionary to fix the deleted words: hunspell -p words *.odt
ru: Пример: hunspell -d en_US file.txt # интерактивная проверка орфографии hunspell -i utf-8 file.txt # проверка файла в кодировке UTF-8 hunspell -l *.odt # вывести слова с ошибками в файлах ODF # Быстрое исправление документов ODF путем создания личного словаря # 1 Сделайте сокращённый список из ошибочных и неизвестных слов: hunspell -l *.odt | sort | uniq >words # 2 Удалите слова с ошибками в текстовом редакторе. # 3 Используйте этот личный словарь для исправления удаленных слов: hunspell -p words *.odt

source: Bug reports: http://hunspell.github.io/
ru: Сообщить об ошибке: http://hunspell.github.io/

source: Copyright (C) 2002-2014 László Németh. License: MPL/GPL/LGPL. Based on OpenOffice.org's Myspell library. Myspell's copyright (C) Kevin Hendricks, 2001-2002, License: BSD.
ru: Все права защищены (C) 2002-2014 László Németh. Лицензия: MPL/GPL/LGPL. Основано на библиотеке Myspell из пакета OpenOffice.org. Авторские права Myspell (C) Kevin Hendricks, 2001-2002, Лицензия: BSD.

source: This is free software; see the source for copying conditions. There is NO warranty; not even for MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE, to the extent permitted by law.
ru: Это свободно распространяемое программное обеспечение; условия копирования есть в исходных текстах. Здесь НЕТ никаких гарантий; ни гарантий ТОВАРНЫХ СВОЙСТВ, ни гарантий ПРИГОДНОСТИ ДЛЯ ПРИМЕНЕНИЯ ПО НАЗНАЧЕНИЮ, во всех установленных законом случаях.

source: SEARCH PATH: %s
ru: ПУТЬ ПОИСКА: %s

source: AVAILABLE DICTIONARIES (path is not mandatory for -d option):
ru: ДОСТУПНЫЕ СЛОВАРИ (при использовании -d путь можно опустить):

source: LOADED DICTIONARY: %s %s
ru: ЗАГРУЖЕННЫЙ СЛОВАРЬ: %s %s

source: error - %s exceeds dictionary limit.
ru: ошибка - %s превышен лимит словаря.

source: Can't open affix or dictionary files for dictionary named "%s".
ru: Невозможно открыть дополнительные или словарные файлы словаря «%s».

source: Hunspell has been compiled without Ncurses user interface.
ru: Hunspell была скомпилирована без поддержки диалогового интерфейса Ncurses.
