Repository: PlagaMedicum/Ubuntu-Translation-Demo
Catalog: Eoan-new/*/LC_MESSAGES/ModemManager.po
Languages: ru

source: Control the Modem Manager daemon
ru: Управление службой диспетчера модеа

source: System policy prevents controlling the Modem Manager.
ru: Политика системы не позволяет управлять диспетчером модема.

source: Unlock and control a mobile broadband device
ru: Разблокировать мобильное широкополосное устройство и управлять им

source: System policy prevents unlocking or controlling the mobile broadband device.
ru: Политика системы не допускает разблокирование мобильного широкополосного устройства или управление им.

source: Add, modify, and delete mobile broadband contacts
ru: Добавить, изменить или удалить мобильные широкополосные соединения

source: System policy prevents adding, modifying, or deleting this device's contacts.
ru: Системная политика не допускает добавление, изменение или удаление связей этого устройства.

source: Send, save, modify, and delete text messages
ru: Отправить, сохранить, изменить или удалить текстовые сообщения

source: System policy prevents sending or manipulating this device's text messages.
ru: Системная политика предотвращает отправку или манипулирование текстовыми сообщениями этого устройства

source: Accept incoming voice calls or start outgoing voice calls.
ru: Принимать входящие голосовые вызовы или начинать исходящие голосовые вызовы.

source: System policy prevents voice calls.
ru: Системная политика предотвращает голосовые вызовы.

source: Enable and view geographic location and positioning information
ru: Задействовать и просмотреть сведения о географическом положении и позиционировании

source: System policy prevents enabling or viewing geographic location information.
ru: Системная политика не позволяет задействования или просмотра сведений географического положения.

source: Query and utilize network information and services
ru: Запрос и использование сведений о сети и службах

source: System policy prevents querying or utilizing network information and services.
ru: Системная политика не позволяет запрашивать или использовать сведения о сети и службах.

source: Query and manage firmware on a mobile broadband device
ru: Запрос и настройка микропрограммы на мобильном широкополосном устройстве

source: System policy prevents querying or managing this device's firmware.
ru: Политика системы не позволяет запрос и настройку микропрограммы этого устройства.

source: ModemManager needs to reset devices
ru: ModemManager необходимо сбросить устройства
