Repository: PlagaMedicum/Ubuntu-Translation-Demo
Catalog: Eoan-new/*/LC_MESSAGES/mousetweaks.po
Languages: uk

source: Hover Click
uk: Клацання при наведенні

source: Single Click
uk: Одинарне клацання

source: Double Click
uk: Подвійне клацання

source: Drag
uk: Перетягнути

source: Secondary Click
uk: Додаткове клацання

source: Button Style
uk: Стиль кнопок

source: Text only
uk: Лише текст

source: Icons only
uk: Лише значки

source: Text and Icons
uk: Текст і значки

source: Orientation
uk: Орієнтація

source: Horizontal
uk: Горизонтально

source: Vertical
uk: Вертикально

source: Click-type window style
uk: Стиль вікна типу клацання

source: Button style of the click-type window.
uk: Стиль кнопок для вікна типу клацання.

source: Click-type window orientation
uk: Орієнтація вікна типу клацання

source: Orientation of the click-type window.
uk: Орієнтація вікна типу клацання.

source: Click-type window geometry
uk: Геометрія вікна типу клацання

source: Size and position of the click-type window. The format is a standard X Window System geometry string.
uk: Розмір і положення вікна типу клацання. Використовується стандартний формат геометричного рядка X Window System.

source: Enable dwell click
uk: Увімкнути клацання при утримуванні

source: Enable simulated secondary click
uk: Увімкнути підтримку додаткового клацання

source: Time to wait before a dwell click
uk: Затримка до клацання при втримуванні

source: Time to wait before a simulated secondary click
uk: Затримка до другого клацання

source: Set the active dwell mode
uk: Встановити активний режим втримування

source: Hide the click-type window
uk: Сховати вікно типу клацання

source: Ignore small pointer movements
uk: Нехтувати невеликі рухи вказівника

source: Shut down mousetweaks
uk: Вимкнути mousetweaks

source: Start mousetweaks as a daemon
uk: Запустити mousetweaks як демон

source: Start mousetweaks in login mode
uk: Запустити mousetweaks у режимі входу в систему

source: - GNOME mouse accessibility daemon
uk: — Служба додаткових можливостей миші середовища GNOME

source: Failed to Display Help
uk: Помилка при показі довідки
