Repository: PlagaMedicum/Ubuntu-Translation-Demo
Catalog: rosetta-eoan/*/LC_MESSAGES/adduser.po
Languages: be

source: Only root may add a user or group to the system.
be: Толькі адміністратар можа дадаваць карыстальніка альбо групу ў сістэму.

source: Only one or two names allowed.
be: Можна азначыць толькі адно або два імені.

source: Specify only one name in this mode.
be: У гэтым рэжыме можна азначыць толькі адно імя.

source: The --group, --ingroup, and --gid options are mutually exclusive.
be: Параметры --group, --ingroup і --gid узаемна выключальныя.

source: The home dir must be an absolute path.
be: Да хатняга каталогу павінен быць прызначаны абсалютны шлях.

source: Warning: The home dir %s you specified already exists.
be: Увага: папка %s, якую вы азначылі ўжо існуе.

source: Warning: The home dir %s you specified can't be accessed: %s
be: Увага: да хатняга каталогу %s немае доступу: %s

source: The group `%s' already exists as a system group. Exiting.
be: Група `%s' ужо існуе як сістэмная група. Выхад.

source: The group `%s' already exists and is not a system group. Exiting.
be: Група `%s' ужо існуе і яна не з'яўляецца сістэмнай. Выхад.

source: The group `%s' already exists, but has a different GID. Exiting.
be: Група `%s' ужо існуе, але мае іншы GID. Выхад.

source: The GID `%s' is already in use.
be: Гэты GID `%s' ужо выкарыстоўваецца.

source: No GID is available in the range %d-%d (FIRST_SYS_GID - LAST_SYS_GID).
be: Няма даступных GID у дыяпазоне %d-%d (FIRST_SYS_GID - LAST_SYS_GID).

source: The group `%s' was not created.
be: Група `%s' не створаная.

source: Adding group `%s' (GID %d) ...
be: Даданне групы `%s' (GID %d) ...

source: Done.
be: Гатова.

source: The group `%s' already exists.
be: Гэта група `%s' ужо існуе.

source: No GID is available in the range %d-%d (FIRST_GID - LAST_GID).
be: Няма даступных GID у дыяпазоне %d-%d (FIRST_GID - LAST_GID).

source: The user `%s' does not exist.
be: Карыстальнік `%s' не існуе.

source: The group `%s' does not exist.
be: Група `%s' не існуе.

source: The user `%s' is already a member of `%s'.
be: Карыстальнік`%s' ужо з'яўляецца ўдзельнікам `%s'.

source: Adding user `%s' to group `%s' ...
be: Дадаванне карыстальніка `%s' у групу `%s' ...

source: The system user `%s' already exists. Exiting.
be: Сістэмны карыстальнік `%s' ужо існуе. Выхад.

source: The user `%s' already exists. Exiting.
be: Карыстальнік `%s' ужо існуе. Выхад.

source: The user `%s' already exists with a different UID. Exiting.
be: Карыстальнік `%s' ужо існуе з іншым UID. Выхад.

source: No UID/GID pair is available in the range %d-%d (FIRST_SYS_UID - LAST_SYS_UID).
be: Няма даступнай пары UID/GID у дыяпазоне %d-%d (FIRST_SYS_UID - LAST_SYS_UID).

source: The user `%s' was not created.
be: Карыстальнік `%s' не быў створаны.

source: No UID is available in the range %d-%d (FIRST_SYS_UID - LAST_SYS_UID).
be: Няма даступнага UID у дыяпазоне %d-%d (FIRST_SYS_UID - LAST_SYS_UID).

source: Internal error
be: Унутраная памылка

source: Adding system user `%s' (UID %d) ...
be: Дадаванне сістэмнага карыстальніка `%s' (UID %d) ...

source: Adding new group `%s' (GID %d) ...
be: Дадаванне новай групы `%s' (GID %d) ...

source: Adding new user `%s' (UID %d) with group `%s' ...
be: Дадаванне новага карыстальніка `%s' (UID %d) з групаю `%s' ...

source: `%s' returned error code %d. Exiting.
be: `%s' вярнула код памылкі %d. Выхад.

source: `%s' exited from signal %d. Exiting.
be: `%s' выйшла з-за сігнаглу %d. Выхад.

source: %s failed with return code 15, shadow not enabled, password aging cannot be set. Continuing.
be: %s вярнула код памылкі з нумарам 15, "shadow" забаронены, старэнне пароля не ўстаноўлена. Працяг.

source: Adding user `%s' ...
be: Дадаванне карыстальніка `%s' ...

source: No UID/GID pair is available in the range %d-%d (FIRST_UID - LAST_UID).
be: Няма даступнай пары UID/GID у дыяпазоне %d-%d (FIRST_UID - LAST_UID).

source: No UID is available in the range %d-%d (FIRST_UID - LAST_UID).
be: Няма даступных UID у дыяпазоне %d-%d (FIRST_UID - LAST_UID).

source: Adding new group `%s' (%d) ...
be: Дадаванне новай групы `%s' (%d) ...

source: Adding new user `%s' (%d) with group `%s' ...
be: Дадаванне карыстальніка ``%s' (%d) з групай `%s' ...

source: Permission denied
be: Доступ забаронены

source: invalid combination of options
be: памылковая камбінацыя параметраў

source: unexpected failure, nothing done
be: нечаканая памылка, нічога не зроблена

source: unexpected failure, passwd file missing
be: нечаканая памылка, файл passwd прапушчаны

source: passwd file busy, try again
be: файл passwd зайняты, паспрабуйце зноў

source: invalid argument to option
be: памылковы аргумент у параметры

source: Try again? [y/N]
be: Паспрабаваць яшчэ раз? [т/Н]

source: Is the information correct? [Y/n]
be: Ці слушная гэта інфармацыя? [т/Н]

source: Adding new user `%s' to extra groups ...
be: Зараз новы карыстальнік `%s' дадаецца да новых груп ...

source: Setting quota for user `%s' to values of user `%s' ...
be: Квота для карыстальніка `%s' устанаўліваецца у значэнні карыстальніка `%s' ...

source: Not creating home directory `%s'.
be: Хатні каталог `%s' не ствараецца.

source: The home directory `%s' already exists. Not copying from `%s'.
be: Хатні каталог `%s' ужо існуе. Не капіюецца з `%s'.

source: Warning: The home directory `%s' does not belong to the user you are currently creating.
be: Увага: хатні каталог `%s' не належыць карыстальніку, якога вы ў дадзены момант ствараеце.

source: Creating home directory `%s' ...
be: Стварэньне хатняй дырэкторыі `%s' ...

source: Couldn't create home directory `%s': %s.
be: Немагчыма стварыць хатнюю дырэкторыю `%s': %s.

source: Copying files from `%s' ...
be: Капіяванне файла `%s' ...

source: fork for `find' failed: %s
be: памылка стварэння адгалінавання для "find": %s

source: The user `%s' already exists, and is not a system user.
be: Карыстальнік `%s' ужо існуе і ён не з'яўляецца сістэмным карыстальнікам.

source: The user `%s' already exists.
be: Карыстальнік `%s' ужо існуе.

source: The UID %d is already in use.
be: Гэты UID %d ужо выкарыстоўваецца.

source: The GID %d is already in use.
be: Гэты GID %d ужо выкарыстоўваецца.

source: The GID %d does not exist.
be: Такога GID %d не існуе.

source: Cannot deal with %s. It is not a dir, file, or symlink.
be: Нельга нічога зрабіць з %s. Гэта не каталог, фал або сімвальная спасылка.

source: %s: To avoid problems, the username should consist only of letters, digits, underscores, periods, at signs and dashes, and not start with a dash (as defined by IEEE Std 1003.1-2001). For compatibility with Samba machine accounts $ is also supported at the end of the username
be: %s: для таго, каб пазбегнуць праблем, імя карыстальніка павінна змяшчаць толькі літары лацінскага алфавіту, лічбы, сімвалы падкрэслівання, кропак, знак "слімака" (@) і дэфісаў, і не павінна пачынацца з дэфісаў (як гэта прадугледжана стандартам IEEE Std 1003.1-2001). Для сумяшчальнасці з уліковымі запісамі Samba, знак $ таксама падтрымліваецца ў канцы імені карыстальніка

source: Allowing use of questionable username.
be: Дазваляе выкарыстоўваць сумнеўнае імя карыстальніка.

source: %s: Please enter a username matching the regular expression configured via the NAME_REGEX configuration variable. Use the `--force-badname' option to relax this check or reconfigure NAME_REGEX.
be: %s: калі ласка, увядзіце імя карыстальніка, якое адпавядае рэгулярным выразам сканфігураную праз зменную NAME_REGEX. Выкарыстоўвайце параметр, каб паменшыць праверку `--force-badname' або змяніць канфігурацыю NAME_REGEX.

source: Selecting UID from range %d to %d ...
be: Выбар UID з дыяпазону ад %d да %d ...

source: Selecting GID from range %d to %d ...
be: Выбар GID з дыяпазону ад %d да %d ...

source: Stopped: %s
be: Спынена: %s

source: Removing directory `%s' ...
be: Выдаленьне дырэкторыі `%s' ...

source: Removing user `%s' ...
be: Выдаленьне карыстальніка `%s' ...

source: Removing group `%s' ...
be: Выдаленьне групы `%s' ...

source: Caught a SIG%s.
be: Атрыманы сігнал SIG%s.

source: adduser version %s
be: adduser, версія %s

source: Adds a user or group to the system. Copyright (C) 1997, 1998, 1999 Guy Maor <maor@debian.org> Copyright (C) 1995 Ian Murdock <imurdock@gnu.ai.mit.edu>, Ted Hajek <tedhajek@boombox.micro.umn.edu>
be: Дадаванне карыстальніка або групы да сістэмы. Усе правы абароненыя (C) 1997, 1998, 1999 Guy Maor <maor@debian.org> Усе правы абароненыя (C) 1995 Ian Murdock <imurdock@gnu.ai.mit.edu>, Ted Hajek <tedhajek@boombox.micro.umn.edu>

source: This program is free software; you can redistribute it and/or modify it under the terms of the GNU General Public License as published by the Free Software Foundation; either version 2 of the License, or (at your option) any later version. This program is distributed in the hope that it will be useful, but WITHOUT ANY WARRANTY; without even the implied warranty of MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE. See the GNU General Public License, /usr/share/common-licenses/GPL, for more details.
be: Гэта праграма распаўсюджваецца свабодна; вы можаце распаўсюджваць і/або змяняць яе згодна з умовамі ліцэнзіі GNU General Public License, якая апублікаваная Free Software Foundation; версіі ліцэнзіі 2.0 або (на ваш выбар) больш позняй. Гэта праграма распаўсюджваецца з надзеяй, што яна будзе карысная, але БЕЗ НІЯКІХ ГАРАНТЫЙ; яна нават не прадугледжвае гарантыю ГАНДЛЁВАЙ ПРЫДАТНАСЦІ або таго, што яна будзе пасаваць для нейкага АДМЫСЛОВАГА ПРЫЗНАЧЭННЯ. За больш падрабязнай інфармацыя, калі ласка, звярніцеся да GNU General Public License, які размяшчаецца ў /usr/share/common-licenses/GPL.

source: adduser [--home DIR] [--shell SHELL] [--no-create-home] [--uid ID] [--firstuid ID] [--lastuid ID] [--gecos GECOS] [--ingroup GROUP | --gid ID] [--disabled-password] [--disabled-login] [--add_extra_groups] USER Add a normal user adduser --system [--home DIR] [--shell SHELL] [--no-create-home] [--uid ID] [--gecos GECOS] [--group | --ingroup GROUP | --gid ID] [--disabled-password] [--disabled-login] [--add_extra_groups] USER Add a system user adduser --group [--gid ID] GROUP addgroup [--gid ID] GROUP Add a user group addgroup --system [--gid ID] GROUP Add a system group adduser USER GROUP Add an existing user to an existing group general options: --quiet | -q don't give process information to stdout --force-badname allow usernames which do not match the NAME_REGEX configuration variable --help | -h usage message --version | -v version number and copyright --conf | -c FILE use FILE as configuration file
be: adduser [--home DIR] [--shell SHELL] [--no-create-home] [--uid ID] [--firstuid ID] [--lastuid ID] [--gecos GECOS] [--ingroup GROUP | --gid ID] [--disabled-password] [--disabled-login] [--add_extra_groups] USER Дадаванне звычайнага карыстальніка adduser --system [--home DIR] [--shell SHELL] [--no-create-home] [--uid ID] [--gecos GECOS] [--group | --ingroup GROUP | --gid ID] [--disabled-password] [--disabled-login] [--add_extra_groups] USER Дадаванне сістэмнага карыстальніка adduser --group [--gid ID] GROUP addgroup [--gid ID] GROUP Дадаванне групы карыстальнікаў addgroup --system [--gid ID] GROUP Дадаванне сістэмнай групы adduser USER GROUP Дадаванне існуючага карыстальніка ў існуючую групу general options: --quiet | -q не даваць інфармацыю працэс камандзе stdout --force-badname дазваляць імёны карыстальнікаў, якія не адпавядаюць канфігурацыі зменнай NAME_REGEX --help | -h паведамленне пра выкарыстанне --version | -v нумар версіі і аўтарскія правы --conf | -c FILE выкарыстоўваць FILE, як канфігурацыю файла

source: Only root may remove a user or group from the system.
be: Толькі адміністратар можа выдаліць карыстальніка ці групу з вашае сыстэмы.

source: No options allowed after names.
be: Пасьля назвы нельга дадаваць ніякіх опцыяў.

source: Enter a group name to remove:
be: Увядзіце назву групы, якую трэба выдаліць:

source: Enter a user name to remove:
be: Увядзіце імя карыстальніка, якога трэба выдаліць:

source: In order to use the --remove-home, --remove-all-files, and --backup features, you need to install the `perl' package. To accomplish that, run apt-get install perl.
be: Для таго, каб выкарыстоўваць функцыі --remove-home, --remove-all-files і --backup, неабходна ўсталяваць пакет 'perl'. Каб выканаць гэта, запусціце apt-get install perl.

source: The user `%s' is not a system user. Exiting.
be: Карыстальнік `%s' не з'яўляецца сістэмным. Выхад.

source: The user `%s' does not exist, but --system was given. Exiting.
be: Карыстальнік `%s' не існуе, але скарыстаны --system. Выхад.

source: WARNING: You are just about to delete the root account (uid 0)
be: УВАГА: Вы збіраецеся зараз выдаліць каранёвы уліковы запіс (uid 0)

source: Usually this is never required as it may render the whole system unusable
be: Звычайна гэта ніколі не патрабуецца, бо можа зрабіць усю сістэму непрыдатнай

source: If you really want this, call deluser with parameter --force
be: Калі вы ўпэўненыя, выклічце deluser з параметрам --force

source: Removing files ...
be: Выдаленьне файлаў ...

source: Warning: group `%s' has no more members.
be: Увага: у групе `%s' больш няма ўдзельнікаў.

source: The group `%s' is not empty!
be: Група `%s' не пустая!

source: The user `%s' is not a member of group `%s'.
be: Карыстальнік`%s' не з'яўляецца ўдзельнікам групы `%s'.

source: Removing user `%s' from group `%s' ...
be: выдаленьне карыстальніка `%s' з групы `%s' ...

source: Copyright (C) 2000 Roland Bauerschmidt <roland@copyleft.de>
be: Аўтарскія правы (C) 2000 Роланд Баўэршмідт <roland@copyleft.de>

source: Could not find program named `%s' in $PATH.
be: Немагчыма знайсці праграму з назвай `%s' у $PATH.
