Repository: PlagaMedicum/Ubuntu-Translation-Demo
Catalog: rosetta-eoan/*/LC_MESSAGES/apport.po
Languages: uk

source: Send problem report to the developers?
uk: Надіслати розробникам звіт про помилку?

source: Send
uk: Надіслати

source: Sorry, %s has experienced an internal error.
uk: Вибачте, у %s сталася внутрішня помилка.

source: Package: %s
uk: Пакунок: %s

source: Sorry, a problem occurred while installing software.
uk: Вибачте, під час встановлення сталася помилка.

source: The application %s has experienced an internal error.
uk: У програмі %s сталася внутрішня помилка.

source: The application %s has closed unexpectedly.
uk: Програма %s несподівано припинила роботу.

source: Continue
uk: Продовжити

source: Leave Closed
uk: Залишити закритим

source: Relaunch
uk: Перезапустити

source: If you notice further problems, try restarting the computer.
uk: Якщо проблема з’явиться знову, спробуйте перезавантажити комп’ютер.

source: Ignore future problems of this type
uk: Ігнорувати такі проблеми у майбутньому

source: Hide Details
uk: Сховати подробиці

source: Show Details
uk: Показати подробиці

source: Username:
uk: Ім'я користувача:

source: Password:
uk: Пароль:

source: (binary data)
uk: (двійкові дані)

source: Collecting Problem Information
uk: Збір інформації про помилку

source: Collecting problem information
uk: Збір інформації про помилку

source: The collected information can be sent to the developers to improve the application. This might take a few minutes.
uk: Зібрані дані можна надіслати розробникам з метою покращення програми. Ви можете витратити на це декілька хвилин.

source: Uploading Problem Information
uk: Вивантаження інформації про помилку

source: Uploading problem information
uk: Вивантаження даних щодо проблеми

source: The collected information is being sent to the bug tracking system. This might take a few minutes.
uk: Зібрана інформація пересилається до системи обліку помилок. Це може тривати декілька хвилин.

source: Report a problem...
uk: Повідомити про помилку...

source: Report a malfunction to the developers
uk: Звітувати про збій розробникам

source: Collect system information
uk: Зібрати системну інформацію

source: Authentication is required to collect system information for this problem report
uk: Потрібно надати права, щоб зібрати потрібні дані для звітування цієї проблеми

source: System problem reports
uk: Звіти про системні помилки

source: Please enter your password to access problem reports of system programs
uk: Уведіть свій пароль для доступу до звітів про помилки у системних програмах

source: An Ubuntu package has a file conflict with a package that is not a genuine Ubuntu package.
uk: Пакунок Ubuntu містить файл, який є конфліктним із файлом з пакунка, який не є офіційним пакунком Ubuntu.

source: You have already encountered this package installation failure.
uk: Помилка з встановленням цього пакунку вже траплялася.

source: Your system was initially configured with grub version 2, but you have removed it from your system in favor of grub 1 without configuring it. To ensure your bootloader configuration is updated whenever a new kernel is available, open a terminal and run: sudo apt-get install grub-pc
uk: Початково систему було налаштовано на використання завантажувача GRUB версії 2, але його було замінено на GRUB 1 й не налаштовано. Щоб переконатися у працездатності завантажувача з новими параметрами, відкрийте термінал та виконайте команду: sudo apt-get install grub-pc

source: Apport crash file
uk: Файл аварії Apport

source: Your system might become unstable now and might need to be restarted.
uk: Система може стати нестабільною, можливо буде потрібне перезавантаження.

source: Do not put the new traces into the report, but write them to stdout.
uk: Не вкладайте нові записи у звіт, а долучайте їх до stdout.

source: Start an interactive gdb session with the report's core dump (-o ignored; does not rewrite report)
uk: Початок інтерактивного GDB-сеансу з дампом у звіті (-o ігнорувати, не записувати у звіт)

source: Write modified report to given file instead of changing the original report
uk: Записати змінений звіт до вказаного файлу замість заміни оригінального звіту

source: Remove the core dump from the report after stack trace regeneration
uk: Зняти дамп зі звіту після трасування стеку регенерації

source: Override report's CoreFile
uk: Перекрити звіти CoreFile

source: Override report's ExecutablePath
uk: Перекрити звіти ExecutablePath

source: Override report's ProcMaps
uk: Перекрити звіти ProcMaps

source: Rebuild report's Package information
uk: Перебудувати звітовий пакунок інформації

source: Build a temporary sandbox and download/install the necessary packages and debug symbols in there; without this option it assumes that the necessary packages and debug symbols are already installed in the system. The argument points to the packaging system configuration base directory; if you specify "system", it will use the system configuration files, but will then only be able to retrace crashes that happened on the currently running release.
uk: Створити тимчасове середовище, далі - завантажити/встановити у ньому необхідні пакунки й налагоджувальні символи; без цього параметру очікується, що необхідні пакунки та налагоджувальні символи у системі вже встановлено. Аргумент вказує на базову теку конфігурації системи пакунків; якщо Ви вказали "system", буде використано системні файли конфігурації, але лише у разі виявлення аварійних ситуацій, що виникли у випуску системи, яка працює на дану мить.

source: Build another temporary sandbox for installing gdb and its dependencies using the same release as the report rather than whatever version of gdb you have installed.
uk: Створіть іншу тимчасову пісочницю для встановлення gdb та її залежностей, використовуючи той же випуск, що і звіт, а не іншу версію gdb, яку ви встановили.

source: Report download/install progress when installing packages into sandbox
uk: Сповіщати про хід виконання завантаження/встановлення пакунків у тимчасовому середовищі

source: Prepend timestamps to log messages, for batch operation
uk: Додавати тимчасові мітки до повідомлень у журналі, для групових операцій

source: Create and use third-party repositories from origins specified in reports
uk: Створення і використання сторонніх сховищ на основі початкових, вказаних у звітах

source: Cache directory for packages downloaded in the sandbox
uk: Тека для збереження пакунків, що заванатажуються у тимчасове середовище

source: Directory for unpacked packages. Future runs will assume that any already downloaded package is also extracted to this sandbox.
uk: Каталог для розпакування пакунків. При наступних запусках усі вже завантажені пакунки будуть розпаковуватися у це ізольоване оточення.

source: Install an extra package into the sandbox (can be specified multiple times)
uk: Встановити у тимчасове середовище додатковий пакунок (може встановлюватися декілька разів)

source: Path to a file with the crash database authentication information. This is used when specifying a crash ID to upload the retraced stack traces (only if neither -g, -o, nor -s are specified)
uk: Шлях до файлу з інформацією про автентифікацію бази даних про аварії. Використовується лише якщо вказано ID аварії для відсилання трасувань стеку (за умови, що ні -g, -o , ані -s не вказано)

source: Display retraced stack traces and ask for confirmation before sending them to the crash database.
uk: Показати перетрасований стек та запитати підтвердження перед відправленням його у базу аварій.

source: Path to the duplicate sqlite database (default: no duplicate checking)
uk: Шлях до дублікату бази даних sqlite (типово: немає дублікату для перевірки)

source: Do not add StacktraceSource to the report.
uk: Не додавати StacktraceSource до звіту.

source: You cannot use -C without -S. Stopping.
uk: Неможна використовувати -C без -S. Зупинка.

source: OK to send these as attachments? [y/n]
uk: Відіслати їх як вкладення? [так/ні]

source: Press any key to continue...
uk: Натисніть будь-яку клавішу для продовження...

source: What would you like to do? Your options are:
uk: Що ви бажаєте зробити? Варіанти вибору:

source: Please choose (%s):
uk: Будь ласка, виберіть (%s):

source: (%i bytes)
uk: (%i байт)

source: After the problem report has been sent, please fill out the form in the automatically opened web browser.
uk: Після того, як звіт буде відправлено, заповніть форму у вікні браузера, яке автоматично відкрилося.

source: &Send report (%s)
uk: &Надіслати звіт (%s)

source: &Examine locally
uk: &Локальна перевірка

source: &View report
uk: &Переглянути звіт

source: &Keep report file for sending later or copying to somewhere else
uk: &Зберегти файл звіту для подальшого відправлення або копіювання будь-куди

source: Cancel and &ignore future crashes of this program version
uk: Скасувати та &ігнорувати майбутні аварії у цій версії програми

source: &Cancel
uk: &Скасувати

source: Problem report file:
uk: Файл звіту про помилку:

source: &Confirm
uk: &Підтвердити

source: Error: %s
uk: Помилка: %s

source: The collected information can be sent to the developers to improve the application. This might take a few minutes.
uk: Зібрану інформацію може бути направлено розробникам для покращення програми. Це може зайняти декілька хвилин.

source: The collected information is being sent to the bug tracking system. This might take a few minutes.
uk: Зібрана інформація надсилається до системи відстежування помилок. Це може зайняти декілька хвилин.

source: &Done
uk: &Завершено

source: none
uk: немає

source: Selected: %s. Multiple choices:
uk: Вибрано: %s. Декілька варіянтів:

source: Choices:
uk: Вибір:

source: Path to file (Enter to cancel):
uk: Шлях до файлу (Enter для скасування):

source: File does not exist.
uk: Файлу не існує

source: This is a directory.
uk: Це каталог.

source: To continue, you must visit the following URL:
uk: Щоб продовжити, ви повинні пройти за адресою:

source: You can launch a browser now, or copy this URL into a browser on another computer.
uk: Ви можете запустити браузер зараз або скопіювати цю адресу у браузер на іншому комп'ютері.

source: Launch a browser now
uk: Запустити браузер

source: No pending crash reports. Try --help for more information.
uk: Немає звітів про аварії у очікуванні. Спробуйте --help для детальної інформації.

source: See man page for details.
uk: Дивіться подробиці у man-сторінці.

source: specify the log file name produced by valgrind
uk: вкажіть ім’я log-файлу для valgrind

source: reuse a previously created sandbox dir (SDIR) or, if it does not exist, create it
uk: використовувати раніше створений каталог пісочниці (SDIR) або створити, якщо його не існує

source: do not create or reuse a sandbox directory for additional debug symbols but rely only on installed debug symbols.
uk: не створювати та не використовувати каталог пісочниці для додаткових символів налагодження, а покладатися лише на встановлені символи налагодження.

source: reuse a previously created cache dir (CDIR) or, if it does not exist, create it
uk: використовувати раніше створений каталог кешу (CDIR) або створити, якщо його не існує

source: report download/install progress when installing packages into sandbox
uk: показувати поступ завантаження/встановлення під час встановлення пакунків у пісочницю

source: the executable that is run under valgrind's memcheck tool for memory leak detection
uk: виконуваний файл, який запускається під контролем valgrind memcheck для визначення витоків пам’яті

source: Error: %s is not an executable. Stopping.
uk: Помилка: %s — невиконуваний файл. Зупинка.

source: Cancel
uk: Скасувати

source: OK
uk: Гаразд

source: Crash report
uk: Звіт про аварію

source: <big><b>Sorry, an internal error happened.</b></big>
uk: <big><b>Вибачте, сталася внутрішня помилка.</b></big>

source: Remember this in future
uk: Запам'ятати це на майбутнє

source: Ignore future problems of this program version
uk: Ігнорувати подальші збої у цій версії програми

source: Relaunch this application
uk: Перезапустити цю програму

source: _Examine locally
uk: _Локальна перевірка

source: Don't send
uk: Не надсилати

source: <big><b>Collecting problem information</b></big>
uk: <big><b>Збір інформації про помилку</b></big>

source: Information is being collected that may help the developers fix the problem you report.
uk: Проводиться збір інформації, яка може допомогти розробникам виправити цю помилку.

source: <big><b>Uploading problem information</b></big>
uk: <big><b>Передача інформації про помилку</b></big>

source: Usage: %s <report> <target directory>
uk: Використання: %s <report> <target directory>

source: Destination directory exists and is not empty.
uk: Каталог адресату існує і не є порожнім.

source: This package does not seem to be installed correctly
uk: Схоже, що цей пакунок встановлено невірно

source: This is not an official %s package. Please remove any third party package and try again.
uk: Даний пакунок %s не є офіційним. Будь ласка, вилучіть усі сторонні пакунки та повторіть знову.

source: You have some obsolete package versions installed. Please upgrade the following packages and check if the problem still occurs: %s
uk: У системі встановлено застарілі версії деяких пакунків. Оновіть наступні пакунки та перевірте, чи залишилася проблема: %s

source: unknown program
uk: невідома програма

source: Sorry, the program "%s" closed unexpectedly
uk: На жаль, програма "%s" несподівано закрилася

source: Problem in %s
uk: Помилка у %s

source: Your computer does not have enough free memory to automatically analyze the problem and send a report to the developers.
uk: На вашому комп'ютері недостатньо вільної пам'яті для автоматичного аналізу проблеми та надсилання розробникам звіту.

source: Invalid problem report
uk: Неправильний звіт про помилку

source: You are not allowed to access this problem report.
uk: Ви не маєте доступу до цього звіту.

source: Error
uk: Помилка

source: There is not enough disk space available to process this report.
uk: Недостатньо місця на диску для обробки цього звіту.

source: Invalid PID
uk: Неправильний PID

source: No package specified
uk: Не вказано пакунок

source: You need to specify a package or a PID. See --help for more information.
uk: Необхідно вказати пакунок або PID. Наберіть --help для отримання додаткової інформації.

source: Permission denied
uk: У доступі відмовлено

source: The specified process does not belong to you. Please run this program as the process owner or as root.
uk: Зазначений процес Вам не належить. Будь ласка, запустіть програму як власник процесу або як root.

source: The specified process ID does not belong to a program.
uk: Зазначений процес ID не належить до програми.

source: Symptom script %s did not determine an affected package
uk: Симптоматичний скрипт %s не може визначити постраждалих пакунків

source: Package %s does not exist
uk: Пакунку %s не існує

source: Cannot create report
uk: Неможливо створити звіт

source: Updating problem report
uk: Оновлення звіту про проблеми

source: You are not the reporter or subscriber of this problem report, or the report is a duplicate or already closed. Please create a new report using "apport-bug".
uk: Ви не є відправником чи отримувачем звіту про дану проблему, можливо звіт вже існує або вже був закритий. Будь-ласка, створіть новий звіт за допомогою "apport-bug".

source: You are not the reporter of this problem report. It is much easier to mark a bug as a duplicate of another than to move your comments and attachments to a new bug. Subsequently, we recommend that you file a new bug report using "apport-bug" and make a comment in this bug about the one you file. Do you really want to proceed?
uk: Ви не створювали даний звіт. Набагато легше маркувати помилку як ту що вже існує, ніж створювати свої коментарі та відправляти нову помилку. Надалі, ми рекомендуємо Вам подати нове повідомлення про помилку з використанням "apport-bug", та коментувати помилку у тому ж файлі. Ви справді бажаєте продовжити?

source: No additional information collected.
uk: Не зібрано додаткової інформації.

source: What kind of problem do you want to report?
uk: Про яку проблему ви бажаєте повідомити?

source: Unknown symptom
uk: Невідомий симптом

source: The symptom "%s" is not known.
uk: Симптом «%s» не відомий

source: After closing this message please click on an application window to report a problem about it.
uk: Після того, як сховаєте дане повідомлення, будь-ласка, клацніть на вікно програми для того, щоб відіслати звіт про помилку.

source: xprop failed to determine process ID of the window
uk: Помилка xprop: не вдалося визначити ID процесу вікна

source: %prog <report number>
uk: %prog <номер звіту>

source: Specify package name.
uk: Вкажіть назву пакунку.

source: Add an extra tag to the report. Can be specified multiple times.
uk: Додати додаткову мітку до звіту. Може бути задано декілька разів.

source: %prog [options] [symptom|pid|package|program path|.apport/.crash file]
uk: %prog [параметри] [симптом|pid|пакунок|шлях програми|.apport/.crash file]

source: Start in bug filing mode. Requires --package and an optional --pid, or just a --pid. If neither is given, display a list of known symptoms. (Implied if a single argument is given.)
uk: Запуск у режимі запису помилки у файл. Вимагає --package і факультативно --pid, або просто --pid. Якщо ні одного не вказано, показати список відомих симптомів. (Мається на увазі якщо задано один аргумент.)

source: Click a window as a target for filing a problem report.
uk: Клацніть на цільове вікно для заповнення звіту про помилку.

source: Start in bug updating mode. Can take an optional --package.
uk: Запустити у режимі оновлення помилки. Може виконуватися з ключем --package.

source: File a bug report about a symptom. (Implied if symptom name is given as only argument.)
uk: Відправити звіт про помилку з симптомом. (Мається на увазі, якщо ім'я симптому дано як єдиний аргумент.)

source: Specify package name in --file-bug mode. This is optional if a --pid is specified. (Implied if package name is given as only argument.)
uk: Вкажіть назву пакунку у режимі --file-bug. Необов’язково якщо вказано --pid. (Припустимо що назва пакунку вказана у якості єдиного аргументу)

source: Specify a running program in --file-bug mode. If this is specified, the bug report will contain more information. (Implied if pid is given as only argument.)
uk: Вкажіть програму, що виконується, у режимі --file-bug. У цьому випадку звіт про помилку міститиме більше інформації. (Мається на увазі, що вказано єдиний аргумент- pid.)

source: The provided pid is a hanging application.
uk: Вказаний ідентифікатор належить процесу, який не відповідає.

source: Report the crash from given .apport or .crash file instead of the pending ones in %s. (Implied if file is given as only argument.)
uk: Повідомити про аварію із наданого файлу .apport або .crash замість файлів у черзі в %s. (За умови, що файл надано у якості єдиного параметру.)

source: In bug filing mode, save the collected information into a file instead of reporting it. This file can then be reported later on from a different machine.
uk: У режимі збору помилок замість надсилати зібрану інформацію, збережіть її у файл. Цей файл можна буде відправити пізніше з іншого комп'ютера.

source: Print the Apport version number.
uk: Надрукувати номер версії Apport .

source: This will launch apport-retrace in a terminal window to examine the crash.
uk: Буде здійснено запуск «apport-retrace» у вікні терміналу для перевірки аварійного завершення роботи.

source: Run gdb session
uk: Запустити сеанс gdb

source: Run gdb session without downloading debug symbols
uk: Запустити сеанс gdb, оминувши завантаження символів відлагодження

source: Update %s with fully symbolic stack trace
uk: Оновити %s з повним відстеженням символічного стеку

source: Can't remember send report status settings
uk: Неможливо запам'ятати параметри стану для надсилання звіту

source: Saving crash reporting state failed. Can't set auto or never reporting mode.
uk: Збереження стану звітування про аварію завершилося невдачею. Неможливо встановити режим звітування auto або never.

source: This problem report applies to a program which is not installed any more.
uk: Цей звіт про помилку належить до програми, якої більше немає у системі.

source: The problem happened with the program %s which changed since the crash occurred.
uk: Проблема у програмі %s, до якої були внесені зміни з моменту аварійного завершення її роботи.

source: This problem report is damaged and cannot be processed.
uk: Цей звіт про помилку пошкоджено та не може бути оброблено.

source: This report is about a snap published by %s. Contact them via %s for help.
uk: Це звіт про snap-пакунок, що його опублікував %s. Зверніться до них по допомогу через %s.

source: This report is about a snap published by %s. No contact address has been provided; visit the forum at https://forum.snapcraft.io/ for help.
uk: Це звіт про snap-пакунок, що його опублікував %s. Контактної адреси не зазначено, отримайте допомогу на форумі https://forum.snapcraft.io/.

source: This report is about a package that is not installed.
uk: Цей звіт стосується пакунку, який не встановлено.

source: An error occurred while attempting to process this problem report:
uk: Сталася помилка при спробі обробки звіту:

source: You are about to report a bug against the deb package, but you also a have snap published by %s installed. You can contact them via %s for help. Do you want to continue with the bug report against the deb?
uk: Ви збираєтеся повідомити про помилку в пакунку deb, але у вас також встановлений snap-пакунок, що його опублікував %s. Ви можете звернутися до них по допомогу через %s. Ви хочете продовжити створювати подвідомлення про помилку щодо пакунку deb?

source: You are about to report a bug against the deb package, but you also a have snap published by %s installed. For the snap, no contact address has been provided; visit the forum at https://forum.snapcraft.io/ for help. Do you want to continue with the bug report against the deb?
uk: Ви збираєтеся повідомити про помилку в пакунку deb, але у вас також встановлений snap-пакунок, що його опублікував %s. Для snap-пакунку контактну адресу не зазначено, отримайте допомогу на форумі https://forum.snapcraft.io/. Ви хочете продовжити створювати подвідомлення про помилку щодо пакунку deb?

source: Could not determine the package or source package name.
uk: Не вдалося визначити ім'я пакунку або ім'я пакунку з вихідним кодом.

source: Unable to start web browser
uk: Неможливо запустити веб-переглядач

source: Unable to start web browser to open %s.
uk: Не вдається запустити веб-переглядач, щоб відкрити %s.

source: Please enter your account information for the %s bug tracking system
uk: Будь ласка, уведіть інформацію про обліковий запис для %s системи стеження за помилками

source: Network problem
uk: Проблема з мережею

source: Cannot connect to crash database, please check your Internet connection.
uk: Не вдається під'єднатися до пошкодженої бази даних, будь ласка, перевірте з'єднання з мережею Інтернет.

source: Memory exhaustion
uk: Пам'ять вичерпано

source: Your system does not have enough memory to process this crash report.
uk: У системі недостатньо пам'яті для обробки цього звіту про аварію.

source: The problem cannot be reported: %s
uk: Не вдається повідомити про помилку: %s

source: Problem already known
uk: Про помилку вже відомо

source: This problem was already reported in the bug report displayed in the web browser. Please check if you can add any further information that might be helpful for the developers.
uk: Про цю помилку вже відомо. Звіт про неї відкритий у вашому браузері. Будь ласка, перевірте, чи можете ви додати до нього іншу корисну інформацію, яка могла б допомогти розробникам.
