Repository: PlagaMedicum/Ubuntu-Translation-Demo
Catalog: rosetta-eoan/*/LC_MESSAGES/apport.po
Languages: uk

source: This problem was already reported to developers. Thank you!
uk: Про цю проблему розробникам вже відомо. Дякуємо!

source: This occurred during a previous suspend, and prevented the system from resuming properly.
uk: Це сталося під час попереднього сеансу призупинення роботи і призвело до неможливості належного відновлення роботи системи.

source: This occurred during a previous hibernation, and prevented the system from resuming properly.
uk: Це сталося під час попереднього сеансу присипляння і призвело до неможливості належного відновлення роботи системи.

source: The resume processing hung very near the end and will have appeared to have completed normally.
uk: Обробка даних звіту зависла дуже близько до кінця і буде, як видається, завершена нормально.

source: Sorry, the application %s has stopped unexpectedly.
uk: Перепрошуємо, програма %s неочікувано зупинилася.

source: Sorry, %s has closed unexpectedly.
uk: Вибачте, %s було несподівано завершено.

source: The application %s has stopped responding.
uk: Програма %s перестала відповідати.

source: The program "%s" has stopped responding.
uk: Програма "%s" перестала відповідати.
