Repository: PlagaMedicum/Ubuntu-Translation-Demo
Catalog: rosetta-eoan/*/LC_MESSAGES/desktop_kubuntu-notification-helper.po
Languages: uk

# Name
source: Notification Helper
uk: Допоміжні сповіщення

# Comment
source: System Notification Helper
uk: Допоміжні сповіщення від системи

# Name
source: Reboot Required
uk: Потрібне перезавантаження

# Comment
source: A system restart is required
uk: Потрібно перезавантажити систему

# Name
source: Apport Crash
uk: Apport виявлено аварію

# Comment
source: An application has crashed on your system (now or in the past)
uk: У вашій системі аварійно завершила роботу програма (зараз або раніше)

# Name
source: Upgrade Hook
uk: Повідомлення щодо оновлення

# Comment
source: Software upgrade notifications are available
uk: Отримано сповіщення щодо оновлення програмного забезпечення

# Name
source: Restricted Install
uk: Встановлення додаткових програм

# Comment
source: Extra packages can be installed to enhance application functionality
uk: Щоб розширити спектр можливостей програм, ви можете встановити додаткові пакунки

# Name
source: Localization Enhancement
uk: Покращення локалізації

# Comment
source: Extra packages can be installed to enhance system localization
uk: Для покращення локалізації системи можуть бути встановлені додаткові пакунки

# Name
source: Driver Enhancement
uk: Покращення драйверів

# Comment
source: Additional drivers can be installed
uk: Можуть бути встановлені додаткові драйвери

# X-KDE-Keywords
source: Notify,Alerts,Notification,popups
uk: Notify,Alerts,Notification,popups,сповіщення,повідомлення,контекстні,вікна

# Name
source: Other Notifications
uk: Інші сповіщення

# Comment
source: Control the notifications for system helpers
uk: Керування сповіщеннями системи
