Repository: PlagaMedicum/Ubuntu-Translation-Demo
Catalog: rosetta-eoan/*/LC_MESSAGES/git-gui.po
Languages: uk

source: git-gui: fatal error
uk: git-gui: критична помилка

source: Invalid font specified in %s:
uk: У %s вказано некоректний шрифт:

source: Main Font
uk: Основний шрифт

source: Diff/Console Font
uk: Шрифт для різниць/консолі

source: Cannot find git in PATH.
uk: Не вдалося знайти git у каталогах PATH.

source: Cannot parse Git version string:
uk: Не вдалося обробити рядок версії Git:

source: Git version cannot be determined. %s claims it is version '%s'. %s requires at least Git 1.5.0 or later. Assume '%s' is version 1.5.0?
uk: Не вдалося визначити версію Git. %s було повідомлено версію «%s». Для %s потрібна версія Git 1.5.0 або пізніша. Припустити, що версією «%s» є 1.5.0?

source: Git directory not found:
uk: Каталог Git не знайдено:

source: Cannot move to top of working directory:
uk: Не вдалося перейти до верхнього рівня робочого каталогу:

source: Cannot use bare repository:
uk: Не можна використовувати порожнє сховище:

source: No working directory
uk: Немає робочого каталогу

source: Refreshing file status...
uk: Оновлення станів файлів...

source: Scanning for modified files ...
uk: Виявлення змінених файлів...

source: Calling prepare-commit-msg hook...
uk: Виклик командного блоку prepare-commit-msg...

source: Commit declined by prepare-commit-msg hook.
uk: Коміт відхилено командним блоком prepare-commit-msg.

source: Ready.
uk: Завершено.

source: Displaying only %s of %s files.
uk: Показано лише %s з %s файлів.

source: Unmodified
uk: Без змін

source: Modified, not staged
uk: Змінено, не споряджено

source: Staged for commit
uk: Споряджено для коміту

source: Portions staged for commit
uk: Частини споряджено для коміту

source: Staged for commit, missing
uk: Споряджено для коміту, відсутнє

source: File type changed, not staged
uk: Змінено тип файлів, не споряджено

source: File type changed, staged
uk: Змінено тип файлів, споряджено

source: Untracked, not staged
uk: Без стеження, не споряджено

source: Missing
uk: Відсутнє

source: Staged for removal
uk: Споряджено для вилучення

source: Staged for removal, still present
uk: Споряджено для вилучення, ще не вилучено

source: Requires merge resolution
uk: Потребує розв’язання проблем злиття

source: Starting gitk... please wait...
uk: Запуск gitk... Зачекайте...

source: Couldn't find gitk in PATH
uk: Не вдалося знайти gitk за змінною PATH

source: Couldn't find git gui in PATH
uk: Не вдалося знайти графічний інтерфейс git за змінною PATH

source: Repository
uk: Сховище

source: Edit
uk: Редагування

source: Branch
uk: Гілка

source: Commit@@noun
uk: Внесок@@іменник

source: Merge
uk: Злиття

source: Remote
uk: Віддалений

source: Tools
uk: Інструменти

source: Explore Working Copy
uk: Навігація робочою копією

source: Browse Current Branch's Files
uk: Перегляд файлів поточної гілки

source: Browse Branch Files...
uk: Переглянути файли гілки...

source: Visualize Current Branch's History
uk: Візуальний журнал поточної гілки

source: Visualize All Branch History
uk: Візуальний журнал всіх гілок

source: Browse %s's Files
uk: Перегляд файлів %s

source: Visualize %s's History
uk: Візуальний журнал %s

source: Database Statistics
uk: Статистика бази даних

source: Compress Database
uk: Стиснути базу даних

source: Verify Database
uk: Перевірити базу даних

source: Create Desktop Icon
uk: Створити значок на стільниці

source: Quit
uk: Вийти

source: Undo
uk: Вернути

source: Redo
uk: Повторити

source: Cut
uk: Вирізати

source: Copy
uk: Копіювати

source: Paste
uk: Вставити

source: Delete
uk: Видалити

source: Select All
uk: Вибрати все

source: Create...
uk: Створити...

source: Checkout...
uk: Отримати...

source: Rename...
uk: Перейменувати...

source: Delete...
uk: Видалити...

source: Reset...
uk: Повернути типове...

source: Done
uk: Виконано

source: Commit@@verb
uk: Внесок@@дієслово

source: New Commit
uk: Новий коміт

source: Amend Last Commit
uk: Виправити останній коміт

source: Rescan
uk: Пересканувати

source: Stage To Commit
uk: Спорядити для коміту

source: Stage Changed Files To Commit
uk: Спорядити змінені файли для коміту

source: Unstage From Commit
uk: Скасувати споряджання з комітку

source: Revert Changes
uk: Скасувати зміни

source: Show Less Context
uk: Показувати менше контекстних даних

source: Show More Context
uk: Показувати більше контекстних даних

source: Sign Off
uk: Зареєструвати

source: Local Merge...
uk: Злити локально...

source: Abort Merge...
uk: Перервати злиття...

source: Add...
uk: Додати…

source: Push...
uk: Надіслати...

source: Delete Branch...
uk: Видалити гілку...

source: Options...
uk: Параметри...

source: Remove...
uk: Вилучити...

source: Help
uk: Довідка

source: About %s
uk: Про програму %s

source: Online Documentation
uk: Документація у мережі

source: Show SSH Key
uk: Показати ключ SSH

source: fatal: cannot stat path %s: No such file or directory
uk: помилка: не вдалося обробити шлях %s. Файла або каталогу з такою назвою не виявлено

source: Current Branch:
uk: Поточна гілка:

source: Staged Changes (Will Commit)
uk: Споряджені зміни (буде надіслано)

source: Unstaged Changes
uk: Неспоряджені зміни

source: Stage Changed
uk: Спорядити змінені

source: Push
uk: Надіслати

source: Initial Commit Message:
uk: Початкове повідомлення коміту:

source: Amended Commit Message:
uk: Змінене повідомлення коміту:

source: Amended Initial Commit Message:
uk: Змінене початкове повідомлення коміту:

source: Amended Merge Commit Message:
uk: Змінене повідомлення коміту про злиття:

source: Merge Commit Message:
uk: Повідомлення коміту про злиття:

source: Commit Message:
uk: Повідомлення коміту:

source: Copy All
uk: Копіювати все

source: File:
uk: Файл:

source: Refresh
uk: Оновити

source: Decrease Font Size
uk: Зменшити розмір шрифту

source: Increase Font Size
uk: Збільшити розмір шрифту

source: Encoding
uk: Кодування

source: Apply/Reverse Hunk
uk: Застосувати/Повернути фрагмент

source: Apply/Reverse Line
uk: Застосувати/Повернути рядок

source: Run Merge Tool
uk: Запустити інструмент злиття

source: Use Remote Version
uk: Використовувати віддалену версію

source: Use Local Version
uk: Використовувати локальну версію

source: Revert To Base
uk: Повернутися до версії зі сховища

source: Visualize These Changes In The Submodule
uk: Показати ці зміни у підмодулі

source: Visualize Current Branch History In The Submodule
uk: Показати журнал поточної гілки у підмодулі

source: Visualize All Branch History In The Submodule
uk: Показати журнал всіх гілок у підмодулі

source: Start git gui In The Submodule
uk: Запустити графічний інтерфейс git у підмодулі

source: Unstage Hunk From Commit
uk: Скасувати споряджання фрагменту з коміту

source: Unstage Lines From Commit
uk: Скасувати споряджання рядків з коміту

source: Unstage Line From Commit
uk: Скасувати споряджання рядка з коміту

source: Stage Hunk For Commit
uk: Спорядити фрагмент для коміту

source: Stage Lines For Commit
uk: Спорядити рядки для коміту

source: Stage Line For Commit
uk: Спорядити рядок для коміту

source: Initializing...
uk: Ініціалізація...

source: Possible environment issues exist. The following environment variables are probably going to be ignored by any Git subprocess run by %s:
uk: Ймовірно, у системі є проблеми з середовищем. Можливо, будь-яким підпроцесом Git, запущеним %s, буде проігноровано такі змінні середовища:

source: This is due to a known issue with the Tcl binary distributed by Cygwin.
uk: Причиною цього є відома вада двійкового файлу Tcl, що поширюється з Cygwin.

source: A good replacement for %s is placing values for the user.name and user.email settings into your personal ~/.gitconfig file.
uk: Непоганою заміною %s є визначення значень параметрів user.name і user.email у вашому особистому файлі ~/.gitconfig.

source: git-gui - a graphical user interface for Git.
uk: git-gui — графічний інтерфейс користувача для Git.

source: File Viewer
uk: Переглядач файлів

source: Commit:
uk: Коміт:

source: Copy Commit
uk: Копіювати коміт

source: Find Text...
uk: Знайти текст…

source: Do Full Copy Detection
uk: Виконати виявлення повної копії

source: Show History Context
uk: Показати контекст з журналу

source: Blame Parent Commit
uk: Анотувати батьківський коміт

source: Reading %s...
uk: Читання %s...

source: Loading copy/move tracking annotations...
uk: Завантаження анотацій стеження за копіюванням та пересуванням...

source: lines annotated
uk: рядків анотовано

source: Loading original location annotations...
uk: Завантаження анотацій щодо походження...

source: Annotation complete.
uk: Анотацію завершено.

source: Busy
uk: Зайнятий

source: Annotation process is already running.
uk: Процес анотації вже запущено.

source: Running thorough copy detection...
uk: Запуск загального виявлення копій...

source: Loading annotation...
uk: Завантаження анотації...

source: Author:
uk: Автор:

source: Committer:
uk: Автор:

source: Original File:
uk: Початковий файл:

source: Cannot find HEAD commit:
uk: Не вдалося знайти комітHEAD:

source: Cannot find parent commit:
uk: Не вдалося знайти батьківський коміт:

source: Unable to display parent
uk: Не вдалося показати батьківський

source: Error loading diff:
uk: Помилка під час завантаження різниці:

source: Originally By:
uk: Перший автор:

source: In File:
uk: У файлі:

source: Copied Or Moved Here By:
uk: Скопійовано або пересунуто:

source: Checkout Branch
uk: Перейти на гілку

source: Checkout
uk: Перейти

source: Cancel
uk: Скасувати

source: Revision
uk: Редакція

source: Options
uk: Параметри

source: Fetch Tracking Branch
uk: Отримання гілки стеження

source: Detach From Local Branch
uk: Від’єднання від локальної гілки

source: Create Branch
uk: Створити гілку

source: Create New Branch
uk: Створити нову гілку

source: Create
uk: Створити

source: Branch Name
uk: Назва гілки

source: Name:
uk: Назва:

source: Match Tracking Branch Name
uk: Відповідно до назви гілки стеження

source: Starting Revision
uk: Початок редакції

source: Update Existing Branch:
uk: Оновити наявну гілку:

source: Fast Forward Only
uk: Лише перемотання

source: Reset
uk: Відновити

source: Checkout After Creation
uk: Перейти після створення

source: Please select a tracking branch.
uk: Будь ласка, оберіть гілку стеження.

source: Tracking branch %s is not a branch in the remote repository.
uk: Гілка стеження %s не є гілкою у віддаленому сховищі.

source: Please supply a branch name.
uk: Будь ласка, вкажіть назву гілки.

source: '%s' is not an acceptable branch name.
uk: «%s» не є прийнятною назвою гілки.

source: Delete Branch
uk: Видалити гілку

source: Delete Local Branch
uk: Видалити локальну гілку

source: Local Branches
uk: Локальні гілки

source: Delete Only If Merged Into
uk: Видалити , лише якщо злито

source: Always (Do not perform merge checks)
uk: Завжди (не виконувати перевірок злиття)

source: The following branches are not completely merged into %s:
uk: Наступні гілки не повністю злиті з %s:

source: Recovering deleted branches is difficult. Delete the selected branches?
uk: Відновлення видалених гілок непроста справа. Видалити позначені гілки?

source: Failed to delete branches: %s
uk: Не вдалося видалити гілки: %s

source: Rename Branch
uk: Перейменувати гілку

source: Rename
uk: Перейменувати

source: Branch:
uk: Гілка:

source: New Name:
uk: Нова назва:

source: Please select a branch to rename.
uk: Будь ласка, позначте гілку для перейменування.

source: Branch '%s' already exists.
uk: Гілка з назвою «%s» вже існує.

source: Failed to rename '%s'.
uk: Не вдалося перейменувати «%s».

source: Starting...
uk: Запуск…

source: File Browser
uk: Перегляд файлів

source: Loading %s...
uk: Завантаження %s...

source: [Up To Parent]
uk: [Вгору до батьківської]

source: Browse Branch Files
uk: Перегляд файлів гілки

source: Browse
uk: Огляд

source: Fetching %s from %s
uk: Звантаження %s з %s

source: fatal: Cannot resolve %s
uk: критична помилка: не вдалося розв’язати %s

source: Close
uk: Закрити

source: Branch '%s' does not exist.
uk: Гілки з назвою «%s» не існує.

source: Failed to configure simplified git-pull for '%s'.
uk: Не вдалося налаштувати спрощену команду git-pull для «%s».

source: Branch '%s' already exists. It cannot fast-forward to %s. A merge is required.
uk: Гілка з назвою «%s» вже існує. Над %s не можна виконати дію fast-forward. Потрібне злиття.

source: Merge strategy '%s' not supported.
uk: Стратегія злиття «%s» не підтримується.

source: Failed to update '%s'.
uk: Не вдалося оновити «%s».

source: Staging area (index) is already locked.
uk: Область споряджання (індекс) вже заблоковано.

source: Last scanned state does not match repository state. Another Git program has modified this repository since the last scan. A rescan must be performed before the current branch can be changed. The rescan will be automatically started now.
uk: Останній з отриманих станів не збігається зі станом сховища. З часу попереднього сканування інша програма Git внесла зміни до сховища. Перш ніж вносити зміни до поточної гілки, слід виконати повторне сканування. Зараз буде автоматично розпочато повторне сканування.

source: Updating working directory to '%s'...
uk: Оновлення робочого каталогу до «%s»...

source: files checked out
uk: файлів отримано

source: Aborted checkout of '%s' (file level merging is required).
uk: Перервано отриання «%s» (потрібне об’єднання на рівні файлів).

source: File level merge required.
uk: Потрібне злиття на рівні файлів.

source: Staying on branch '%s'.
uk: Залишаємося у гілці «%s».

source: You are no longer on a local branch. If you wanted to be on a branch, create one now starting from 'This Detached Checkout'.
uk: Тепер ви працюєте поза межами локальної гілки. Якщо ви не бажаєте виходити за межі гілки, створіть нову гілку за допомогою пункту «Це відокремлене отримання».

source: Checked out '%s'.
uk: Отримано «%s».

source: Resetting '%s' to '%s' will lose the following commits:
uk: Скидання «%s» до «%s» призведе до втрати таких комітів:

source: Recovering lost commits may not be easy.
uk: Відновлення втрачених комітів може бути непростою справою.

source: Reset '%s'?
uk: Скинути «%s»?

source: Visualize
uk: Візуалізація

source: Failed to set current branch. This working directory is only partially switched. We successfully updated your files, but failed to update an internal Git file. This should not have occurred. %s will now close and give up.
uk: Не вдалося встановити поточну гілку. Здійснено лише часткове перемикання цього робочого каталогу. Ваші файли було успішно оновлено, але не вдалося оновити вбудований файл Git. Виходу з цієї ситуації у програмі не передбачено. Зараз %s завершить роботу.

source: Select
uk: Вибір

source: Font Family
uk: Гарнітура шрифту

source: Font Size
uk: Розмір шрифту

source: Font Example
uk: Приклад шрифту

source: This is example text. If you like this text, it can be your font.
uk: Це текст прикладу. Якщо вам подобається як виглядає цей текст, ви знайшли потрібний вам шрифт.

source: Git Gui
uk: Графічний інтерфейс Git

source: Create New Repository
uk: Створити сховище

source: New...
uk: Створити...

source: Clone Existing Repository
uk: Клонувати існуюче сховище

source: Clone...
uk: Клонувати...

source: Open Existing Repository
uk: Відкрити існуюче сховище

source: Open...
uk: Відкрити...

source: Recent Repositories
uk: Нещодавні сховища

source: Open Recent Repository:
uk: Відкрити нещодавнє сховище:

source: Failed to create repository %s:
uk: Не вдалося створити сховище %s:

source: Directory:
uk: Каталог:

source: Git Repository
uk: Сховище Git

source: Directory %s already exists.
uk: Каталог з назвою %s вже існує.

source: File %s already exists.
uk: Файл з назвою %s вже існує.

source: Clone
uk: Клонувати

source: Source Location:
uk: Адреса джерела:

source: Target Directory:
uk: Каталог призначення:

source: Clone Type:
uk: Тип клонування:

source: Standard (Fast, Semi-Redundant, Hardlinks)
uk: Стандартне (швидке, напівнадлишкове, жорсткі посилання)

source: Full Copy (Slower, Redundant Backup)
uk: Повна копія (повільніше, надлишкове резервування)

source: Shared (Fastest, Not Recommended, No Backup)
uk: Спільний (найшвидше, не рекомендується, без резервних копій)

source: Not a Git repository: %s
uk: Не є сховищем Git: %s

source: Standard only available for local repository.
uk: Стандартний тип доступний лише для локального сховища.

source: Shared only available for local repository.
uk: Спільний тип доступний лише для локального сховища.

source: Location %s already exists.
uk: Адреса %s вже існує.

source: Failed to configure origin
uk: Не вдалося налаштувати походження

source: Counting objects
uk: Підрахунок об’єктів

source: buckets
uk: сегментів

source: Unable to copy objects/info/alternates: %s
uk: Не вдалося скопіювати objects/info/alternates: %s

source: Nothing to clone from %s.
uk: У %s відсутні об’єкти клонування.

source: The 'master' branch has not been initialized.
uk: Гілку 'master' не було ініціалізовано.

source: Hardlinks are unavailable. Falling back to copying.
uk: Жорсткі посилання не доступні. Замість їх створення буде виконано копіювання.

source: Cloning from %s
uk: Клонування з %s

source: Copying objects
uk: Копіювання об’єктів

source: KiB
uk: КіБ

source: Unable to copy object: %s
uk: Не вдалося скопіювати об’єкт: %s

source: Linking objects
uk: Створення посилань на об’єкти

source: objects
uk: об'єктів

source: Unable to hardlink object: %s
uk: Не вдалося створити жорстке посилання на об’єкт: %s

source: Cannot fetch branches and objects. See console output for details.
uk: Не вдалося отримати гілки і об’єкти. Докладніше про це можна дізнатися з даних, виведених до консолі.

source: Cannot fetch tags. See console output for details.
uk: Не вдалося отримати список випусків (tags). Докладніше про це можна дізнатися з даних, виведених до консолі.

source: Cannot determine HEAD. See console output for details.
uk: Не вдалося визначити HEAD. Докладніше про це можна дізнатися з даних, виведених до консолі.

source: Unable to cleanup %s
uk: Не вдалося спорожнити %s

source: Clone failed.
uk: Спроба створення клону зазнала невдачі.

source: No default branch obtained.
uk: Не отримано типової гілки.

source: Cannot resolve %s as a commit.
uk: Не вдалося визначити %s як внесок.

source: Creating working directory
uk: Створення робочого каталогу

source: files
uk: файлів

source: Initial file checkout failed.
uk: Спроба початкового отримання файлів зазнала невдачі.

source: Open
uk: Відкрити

source: Repository:
uk: Сховище:

source: Failed to open repository %s:
uk: Не вдалося відкрити сховище %s:

source: This Detached Checkout
uk: Це відокремлене отримання

source: Revision Expression:
uk: Вираз редакції:

source: Local Branch
uk: Локальна гілка

source: Tracking Branch
uk: Гілка стеження

source: Tag
uk: Мітка

source: Invalid revision: %s
uk: Неприпустима редакція: %s

source: No revision selected.
uk: Редакцій не позначено.

source: Revision expression is empty.
uk: Вираз редакції є порожнім.

source: Updated
uk: Оновлено

source: There is nothing to amend. You are about to create the initial commit. There is no commit before this to amend.
uk: Нічого змінювати. Ви намагаєтеся створити початковий коміт. Коміт буде порожнім, доки ви не внесете змін.

source: Cannot amend while merging. You are currently in the middle of a merge that has not been fully completed. You cannot amend the prior commit unless you first abort the current merge activity.
uk: Редагування під час злиття неможливе. Зараз виконується операція злиття, яку ще не завершено повністю. Ви не зможете редагувати попередні коміти, аж доки не перервете поточну дію злиття.

source: Error loading commit data for amend:
uk: Помилка під час завантаження даних коміту для редагування:

source: Unable to obtain your identity:
uk: Не вдалося отримати ваше посвідчення:

source: Invalid GIT_COMMITTER_IDENT:
uk: Некоректне значення GIT_COMMITTER_IDENT:

source: warning: Tcl does not support encoding '%s'.
uk: попередження: у Tcl не підтримується кодування «%s».

source: Last scanned state does not match repository state. Another Git program has modified this repository since the last scan. A rescan must be performed before another commit can be created. The rescan will be automatically started now.
uk: Останній з отриманих станів не збігається зі станом сховища. З часу попереднього сканування інша програма Git внесла зміни до сховища. Перш ніж створювати інший внесок, слід виконати повторне сканування. Зараз буде автоматично розпочато повторне сканування.

source: Unmerged files cannot be committed. File %s has merge conflicts. You must resolve them and stage the file before committing.
uk: Незлиті файли не можна зберігати в коміті. У файлі %s виявлено конфлікти злиття. Вам слід розв’язати ці конфлікти і спорядити файл до створення коміту.

source: Unknown file state %s detected. File %s cannot be committed by this program.
uk: Виявлено невідомий стан файла %s. Файл %s не може бути доданий в коміт за допомогою цієї програми.

source: No changes to commit. You must stage at least 1 file before you can commit.
uk: Немає змін, які можна додати в коміт. Перш ніж робити коміт, вам слід спорядити принаймні один файл.

source: Please supply a commit message. A good commit message has the following format: - First line: Describe in one sentence what you did. - Second line: Blank - Remaining lines: Describe why this change is good.
uk: Будь ласка, додайте повідомлення коміту. Належне повідомлення коміту має такий формат: - Перший рядок: опис одним реченням призначення внеску. - Другий рядок: порожній - Решта рядків: опис удосконалень, які додано внеском.

source: Calling pre-commit hook...
uk: Виклик командного блоку pre-commit...

source: Commit declined by pre-commit hook.
uk: Коміт відхилено командним блоком pre-commit.

source: Calling commit-msg hook...
uk: Виклик командного блоку commit-msg...

source: Commit declined by commit-msg hook.
uk: Коміт відхилено командним блоком commit-msg.

source: Committing changes...
uk: Збереження змін в коміт…

source: write-tree failed:
uk: Помилка write-tree:

source: Commit failed.
uk: Спроба коміту зазнала невдачі.

source: Commit %s appears to be corrupt
uk: Коміт %s пошкоджено

source: No changes to commit. No files were modified by this commit and it was not a merge commit. A rescan will be automatically started now.
uk: Відсутні зміни для коміту. Вказаним комітом не змінюється жодного файла, коміт не є комітом злиття. Зараз буде автоматично запущено повторне сканування.

source: No changes to commit.
uk: Відсутні зміни для створення коміту.

source: commit-tree failed:
uk: Помилка commit-tree:

source: update-ref failed:
uk: Помилка update-ref:

source: Created commit %s: %s
uk: Створено коміт %s: %s

source: Working... please wait...
uk: Обробка... Зачекайте...

source: Success
uk: Успіх

source: Error: Command Failed
uk: Помилка: невдала спроба виконання команди

source: Number of loose objects
uk: Кількість невизначених об’єктів

source: Disk space used by loose objects
uk: Місце на диску, зайняте невизначеними об’єктами

source: Number of packed objects
uk: Кількість запакованих об’єктів

source: Number of packs
uk: Кількість пакунків

source: Disk space used by packed objects
uk: Місце на диску, зайняте запакованими об’єктами

source: Packed objects waiting for pruning
uk: Запаковані об’єкти, що очікують на відсікання

source: Garbage files
uk: Зайві файли

source: Compressing the object database
uk: Стискання бази даних об’єктів

source: Verifying the object database with fsck-objects
uk: Перевірка бази даних об’єктів за допомогою fsck-objects
