Repository: PlagaMedicum/Ubuntu-Translation-Demo
Catalog: rosetta-eoan/*/LC_MESSAGES/git-gui.po
Languages: uk

source: This repository currently has approximately %i loose objects. To maintain optimal performance it is strongly recommended that you compress the database. Compress the database now?
uk: У цьому сховищі зараз зберігається приблизно %i невизначених об’єктів Для підтримання оптимальної швидкодії наполегливо рекомендуємо вам стиснути базу даних. Стиснути базу даних зараз?

source: Invalid date from Git: %s
uk: Некоректна дата Git: %s

source: No differences detected. %s has no changes. The modification date of this file was updated by another application, but the content within the file was not changed. A rescan will be automatically started to find other files which may have the same state.
uk: Відмінностей не виявлено. У %s немає змін. Дату зміни цього файла було оновлено сторонньою програмою, але вміст файла не було змінено. Для виявлення інших файлів з подібним станом буде автоматично виконано повторну перевірку.

source: Loading diff of %s...
uk: Завантаження різниці %s...

source: LOCAL: deleted REMOTE:
uk: ЛОКАЛЬНО: вилучено ВІДДАЛЕНО:

source: REMOTE: deleted LOCAL:
uk: ВІДДАЛЕНО: вилучено ЛОКАЛЬНО:

source: LOCAL:
uk: ЛОКАЛЬНИЙ:

source: REMOTE:
uk: ВІДДАЛЕНИЙ:

source: Unable to display %s
uk: Не вдалося показати %s

source: Error loading file:
uk: Помилка під час завантаження файла:

source: Git Repository (subproject)
uk: Сховище Git (підпроект)

source: * Binary file (not showing content).
uk: * Двійковий файл (вміст не показано).

source: * Untracked file is %d bytes. * Showing only first %d bytes.
uk: * Файл без стеження, %d байтів. * Показано лише початкові %d байтів.

source: * Untracked file clipped here by %s. * To see the entire file, use an external editor.
uk: * Файл без стеження було закріплено тут %s. * Щоб переглянути вміст файла, скористайтеся зовнішнім редактором.

source: Failed to unstage selected hunk.
uk: Не вдалося зняти спорядження з фрагмента.

source: Failed to stage selected hunk.
uk: Не вдалося спорядити фрагмент.

source: Failed to unstage selected line.
uk: Не вдалося зняти спорядження з рядка.

source: Failed to stage selected line.
uk: Не вдалося спорядити рядок.

source: Default
uk: Типове

source: System (%s)
uk: Системне (%s)

source: Other
uk: Інше

source: error
uk: помилка

source: warning
uk: попередження

source: You must correct the above errors before committing.
uk: Перш ніж надсилати коміт, вам слід виправити наведені вище помилки.

source: Unable to unlock the index.
uk: Не вдалося розблокувати покажчик.

source: Index Error
uk: Помилка покажчика

source: Updating the Git index failed. A rescan will be automatically started to resynchronize git-gui.
uk: Спроба оновлення покажчика Git була невдалою. Зараз буде автоматично запущено повторне сканування для синхронізації git-gui.

source: Continue
uk: Продовжити

source: Unlock Index
uk: Розблокувати покажчик

source: Unstaging %s from commit
uk: Зняття спорядження %s для коміту

source: Ready to commit.
uk: Підготовано для коміту.

source: Adding %s
uk: Додавання %s

source: Revert changes in file %s?
uk: Скасувати зміни у файлі %s?

source: Revert changes in these %i files?
uk: Скасувати зміни у цих %i файлах?

source: Any unstaged changes will be permanently lost by the revert.
uk: Після скасування всі неспоряджені зміни буде назавжди втрачено.

source: Do Nothing
uk: Нічого не робити

source: Reverting selected files
uk: Вивертання позначених файлів

source: Reverting %s
uk: Вивертання %s

source: Cannot merge while amending. You must finish amending this commit before starting any type of merge.
uk: Злиття під час редагування неможливе. Перш ніж виконувати будь-яке злиття, вам слід завершити зміни цього коміту.

source: Last scanned state does not match repository state. Another Git program has modified this repository since the last scan. A rescan must be performed before a merge can be performed. The rescan will be automatically started now.
uk: Останній з отриманих станів не збігається зі станом сховища. З часу попереднього сканування інша програма Git внесла зміни до сховища. Перш ніж виконувати злиття, слід виконати повторне сканування. Зараз буде автоматично розпочато повторне сканування.

source: You are in the middle of a conflicted merge. File %s has merge conflicts. You must resolve them, stage the file, and commit to complete the current merge. Only then can you begin another merge.
uk: Ви виконуєте процедуру злиттяконфліктних версій. У файлі знайдено %s конфліктів злиттяверсій. Вам слід вирішити конфлікти, спорядити файл і створити коміт, щоб завершити поточне злиття. Лише після цього ви зможете розпочати наступне злиття.

source: You are in the middle of a change. File %s is modified. You should complete the current commit before starting a merge. Doing so will help you abort a failed merge, should the need arise.
uk: Ви виконуєте процедуру зміни. Файл %s змінено. Перш ніж розпочинати злиття, вам слід завершити надсилання створення поточног коміту. Таким чином, ви за потреби зможете перервати невдале злиття.

source: %s of %s
uk: %s з %s

source: Merging %s and %s...
uk: Злиття %s з %s...

source: Merge completed successfully.
uk: Злиття успішно виконано.

source: Merge failed. Conflict resolution is required.
uk: Помилка злиття. Потрібне вирішення конфліктів.

source: Merge Into %s
uk: Злити з %s

source: Revision To Merge
uk: Редакція для злиття

source: Cannot abort while amending. You must finish amending this commit.
uk: Переривання під час редагування неможливе. Вам слід завершити редагування цього коміту.

source: Abort merge? Aborting the current merge will cause *ALL* uncommitted changes to be lost. Continue with aborting the current merge?
uk: Перервати злиття? Переривання поточного злиттяпризведе до втрати *ВСІХ* ненадісланих змін. Перервати поточне злиття?

source: Reset changes? Resetting the changes will cause *ALL* uncommitted changes to be lost. Continue with resetting the current changes?
uk: Скасувати зміни? Скасування змін призведе до втрати *ВСІХ* ненадісланих змін. Скасувати всі поточні зміни?

source: Aborting
uk: Переривання

source: files reset
uk: файлів відновлено

source: Abort failed.
uk: Не вдалося перервати.

source: Abort completed. Ready.
uk: Переривання завершено.

source: Force resolution to the base version?
uk: Автоматичне розв’язання на основі базової версії?

source: Force resolution to this branch?
uk: Автоматичне розв’язання на основі цієї гілки?

source: Force resolution to the other branch?
uk: Автоматичне розв’язання на основі іншої гілки?

source: Note that the diff shows only conflicting changes. %s will be overwritten. This operation can be undone only by restarting the merge.
uk: Зауважте, що у різниці показано лише зміни, які конфліктують. %s буде перезаписано. Скасувати цю дію можна лише перезапуском злиття.

source: File %s seems to have unresolved conflicts, still stage?
uk: Здається, у файлі %s є нерозв’язані конфлікти, позначити попри це?

source: Adding resolution for %s
uk: Додавання розв’язання для %s

source: Cannot resolve deletion or link conflicts using a tool
uk: Не вдалося розв’язати вилучення або конфлікт посилань за допомогою інструменту

source: Conflict file does not exist
uk: Файла, що конфліктує, не існує

source: Not a GUI merge tool: '%s'
uk: Інструмент об’єднання не є графічними: «%s»

source: Unsupported merge tool '%s'
uk: Інструмент об’єднання «%s» не підтримується

source: Merge tool is already running, terminate it?
uk: Інструмент об’єднання вже запущено, перервати його роботу?

source: Error retrieving versions: %s
uk: Помилка під час спроби отримання версій: %s

source: Could not start the merge tool: %s
uk: Не вдалося запустити інструмент злиття: %s

source: Running merge tool...
uk: Працює інструмент злиття...

source: Merge tool failed.
uk: Спроба використання інструменту злиття завершилася невдало.

source: Invalid global encoding '%s'
uk: Некоректне загальне кодування «%s»

source: Invalid repo encoding '%s'
uk: Некоректне кодування сховища «%s»

source: Restore Defaults
uk: Відновити типові параметри

source: Save
uk: Зберегти

source: %s Repository
uk: Сховище %s

source: Global (All Repositories)
uk: Всі сховища

source: User Name
uk: Користувач

source: Email Address
uk: Адреса електронної пошти

source: Summarize Merge Commits
uk: Підбити підсумки комітів злиття

source: Merge Verbosity
uk: Докладність повідомлень про злиття

source: Show Diffstat After Merge
uk: Показати статистику відмінностей після злиття

source: Use Merge Tool
uk: Використовувати інструмент злиття

source: Trust File Modification Timestamps
uk: Довіряти часовим позначкам зміни файла

source: Prune Tracking Branches During Fetch
uk: Відсікати гілки зі стеженням під час отримання

source: Match Tracking Branches
uk: Встановлювати відповідність гілок зі стеженням

source: Blame Copy Only On Changed Files
uk: Анотувати копію лише на змінених файлах

source: Minimum Letters To Blame Copy On
uk: Мінімальна кількість літер для анотування копії

source: Blame History Context Radius (days)
uk: Діапазон контексту анотування (у днях)

source: Number of Diff Context Lines
uk: Кількість рядків контексту у відмінностях

source: Commit Message Text Width
uk: Ширина тексту повідомлення коміту

source: New Branch Name Template
uk: Новий шаблон назви гілок

source: Default File Contents Encoding
uk: Типове кодування вмісту файлів

source: Change
uk: Змінити

source: Spelling Dictionary:
uk: Словник перевірки правопису:

source: Change Font
uk: Змінити шрифт

source: Choose %s
uk: Обрати %s

source: pt.
uk: пт

source: Preferences
uk: Параметри

source: Failed to completely save options:
uk: Не вдалося повністю зберегти параметри:

source: Remove Remote
uk: Вилучити віддалене

source: Prune from
uk: Відсікти від

source: Fetch from
uk: Отримати з

source: Push to
uk: Надіслати до

source: Add Remote
uk: Додати віддалене

source: Add New Remote
uk: Додати нове віддалене

source: Add
uk: Додати

source: Remote Details
uk: Параметри віддаленого

source: Location:
uk: Адреса:

source: Further Action
uk: Подальша дія

source: Fetch Immediately
uk: Негайно здобути зміни

source: Initialize Remote Repository and Push
uk: Ініціалізувати віддалене сховище і надіслати зміни

source: Do Nothing Else Now
uk: Нічого не робити зараз

source: Please supply a remote name.
uk: Будь ласка, вкажіть назву віддаленого сховища.

source: '%s' is not an acceptable remote name.
uk: «%s» не є прийнятною назвою віддаленого сховища.

source: Failed to add remote '%s' of location '%s'.
uk: Не вдалося додати віддалене сховище «%s» з адресою «%s».

source: fetch %s
uk: здобути зміни %s

source: Fetching the %s
uk: Здобуття змін %s

source: Do not know how to initialize repository at location '%s'.
uk: Не вдалося визначити спосіб ініціалізації сховища за адресою «%s».

source: push %s
uk: надсилання зміни%s

source: Setting up the %s (at %s)
uk: Встановлення %s (%s)

source: Delete Branch Remotely
uk: Вилучити гілку віддалено

source: From Repository
uk: Зі сховища

source: Remote:
uk: Віддалений:

source: Arbitrary Location:
uk: Довільна адреса:

source: Branches
uk: Гілки

source: Delete Only If
uk: Вилучати, лише якщо

source: Merged Into:
uk: Злито з:

source: A branch is required for 'Merged Into'.
uk: У пункті «Злито з» слід вказати гілку.

source: The following branches are not completely merged into %s: - %s
uk: Наведені нижче гілки не повністю злито з %s: - %s

source: One or more of the merge tests failed because you have not fetched the necessary commits. Try fetching from %s first.
uk: Одна або декілька перевірок злиття зазнали невдачі, оскільки ви не здобуто зміни необхідних комітів. Спробуйте спершу здобути зміни з %s.

source: Please select one or more branches to delete.
uk: Будь ласка, оберіть одну або декілька гілок, які слід вилучити.

source: Deleting branches from %s
uk: Вилучення гілок з %s

source: No repository selected.
uk: Не позначено жодного сховища.

source: Scanning %s...
uk: Сканування %s...

source: Find:
uk: Знайти:

source: Next
uk: Далі

source: Prev
uk: Назад

source: Case-Sensitive
uk: Чутливе до регістру

source: Cannot write shortcut:
uk: Не вдалося записати скорочення:

source: Cannot write icon:
uk: Не вдалося записати піктограму:

source: Unsupported spell checker
uk: Цей інструмент перевірки правопису не підтримується

source: Spell checking is unavailable
uk: Перевірка правопису недоступна

source: Invalid spell checking configuration
uk: Некоректне налаштування перевірки правопису

source: Reverting dictionary to %s.
uk: Повертаємося до словника %s.

source: Spell checker silently failed on startup
uk: Спроба запуску інструменту перевірки правопису завершилася невдало без додаткових повідомлень

source: Unrecognized spell checker
uk: Не вдалося визначити інструмент перевірки правопису

source: No Suggestions
uk: Варіантів не знайдено

source: Unexpected EOF from spell checker
uk: Неочікуваний символ кінця рядка у даних перевірки правопису

source: Spell Checker Failed
uk: Помилка інструменту перевірки правопису

source: No keys found.
uk: Ключів не знайдено.

source: Found a public key in: %s
uk: Знайдено відкритий ключ у: %s

source: Generate Key
uk: Створити ключ

source: Copy To Clipboard
uk: Скопіювати до буфера

source: Your OpenSSH Public Key
uk: Ваш відкритий ключ OpenSSH

source: Generating...
uk: Створення...

source: Could not start ssh-keygen: %s
uk: Не вдалося запустити ssh-keygen: %s

source: Generation failed.
uk: Спроба створення зазнала невдачі.

source: Generation succeeded, but no keys found.
uk: Створення успішно завершено, але ключів не знайдено.

source: Your key is in: %s
uk: Ваш ключ зберігається у: %s

source: %s ... %*i of %*i %s (%3i%%)
uk: %s ... %*i з %*i %s (%3i%%)

source: Running %s requires a selected file.
uk: Для запуску %s слід обрати файл.

source: Are you sure you want to run %s?
uk: Ви справді бажаєте запустити %s?

source: Tool: %s
uk: Інструмент: %s

source: Running: %s
uk: Запуск: %s

source: Tool completed successfully: %s
uk: Інструмент завершив роботу успішно: %s

source: Tool failed: %s
uk: Інструмент не зміг виконати завдання: %s

source: Add Tool
uk: Додати інструмент

source: Add New Tool Command
uk: Додати новий інструмент-команду

source: Add globally
uk: Додати на загальному рівні

source: Tool Details
uk: Параметри інструменту

source: Use '/' separators to create a submenu tree:
uk: Скористайтеся символами «/» для створення дерева підменю:

source: Command:
uk: Команда:

source: Show a dialog before running
uk: Перед запуском показати діалогове вікно

source: Ask the user to select a revision (sets $REVISION)
uk: Просити користувача обрати модифікацію (встановлює значення $REVISION)

source: Ask the user for additional arguments (sets $ARGS)
uk: Просити користувача вказати додаткові параметри (встановлює значення $ARGS)

source: Don't show the command output window
uk: Не показувати вікна з даними, виведеними командою

source: Run only if a diff is selected ($FILENAME not empty)
uk: Запускати, лише якщо обрано diff (значення $FILENAME не є порожнім)

source: Please supply a name for the tool.
uk: Будь ласка, вкажіть назву інструменту.

source: Tool '%s' already exists.
uk: Інструмент з назвою «%s» вже існує.

source: Could not add tool: %s
uk: Не вдалося додати інструмент: %s

source: Remove Tool
uk: Вилучити інструмент

source: Remove Tool Commands
uk: Команди інструменту вилучення

source: Remove
uk: Вилучити

source: (Blue denotes repository-local tools)
uk: (Блакитним позначено локальні інструменти сховища)

source: Run Command: %s
uk: Виконати команду: %s

source: Arguments
uk: Аргументи

source: OK
uk: Гаразд

source: Fetching new changes from %s
uk: Здобуття списку нових змін з %s

source: remote prune %s
uk: віддалене відсікання %s

source: Pruning tracking branches deleted from %s
uk: Відсічені гілки зі стеженням було вилучено з %s

source: Pushing changes to %s
uk: Надсилання змін до %s

source: Mirroring to %s
uk: Створення дзеркальної копії у %s

source: Pushing %s %s to %s
uk: Надсилання змін %s %s до %s

source: Push Branches
uk: Гілки надсилання змін

source: Source Branches
uk: Гілки джерела

source: Destination Repository
uk: Сховище призначення

source: Transfer Options
uk: Параметри передавання

source: Force overwrite existing branch (may discard changes)
uk: Перезаписувати існуючу гілку (може бути втрачено зміни)

source: Use thin pack (for slow network connections)
uk: Використовувати тонкий пакунок (для повільних з’єднань)

source: Include tags
uk: Включити позначки
