Repository: PlagaMedicum/Ubuntu-Translation-Demo
Catalog: rosetta-eoan/*/LC_MESSAGES/git-gui-glossary.po
Languages: uk

source: English Term (Dear translator: This file will never be visible to the user!)
uk: Англійський термін

source: amend
uk: змінити

source: annotate
uk: анотувати

source: branch [noun]
uk: гілка [іменник]

source: branch [verb]
uk: branch [дієслово]

source: checkout [noun]
uk: checkout [іменник]

source: checkout [verb]
uk: checkout [дієслово]

source: clone [verb]
uk: клонувати [дієслово]

source: commit [noun]
uk: commit [іменник]

source: commit [verb]
uk: commit [дієслово]

source: diff [noun]
uk: різниця [іменник]

source: diff [verb]
uk: diff [дієслово]

source: fast forward merge
uk: злиття з перемотуванням

source: index (in git-gui: staging area)
uk: індекс (в git-gui: область спорядження)

source: merge [noun]
uk: злиття

source: merge [verb]
uk: злити

source: message
uk: повідомлення

source: prune
uk: очистити

source: repository
uk: сховище

source: reset
uk: скинути

source: revert
uk: вивернути

source: revision
uk: редакція

source: staging area
uk: область спорядження

source: status
uk: стан

source: tag [noun]
uk: tag [іменник]

source: tag [verb]
uk: tag [дієслово]

source: tracking branch
uk: відстежувана гілка

source: undo
uk: повернути

source: update
uk: оновити

source: verify
uk: перевірити

source: working copy, working tree
uk: робоча копія, робочий каталог
