Repository: PlagaMedicum/Ubuntu-Translation-Demo
Catalog: rosetta-eoan/*/LC_MESSAGES/git.po
Languages: uk

source: No configured push destination. Either specify the URL from the command-line or configure a remote repository using git remote add <name> <url> and then push using the remote name git push <name>
uk: Не налаштована точка призначення для надсилання змін. Або вкажіть URL за допомогою командного рядка, або налаштуйте віддалене сховище за допомогою git remote add <ім’я> <адреса> а потім надішліть зміни за допомогою імені віддаленого сховища git push <ім’я>

source: repository
uk: сховище

source: push all refs
uk: надіслати усі посилання

source: mirror all refs
uk: зробити дзеркало усіх посилань

source: delete refs
uk: вилучити посилання

source: push tags (can't be used with --all or --mirror)
uk: надіслати позначки (неможливо використовувати разом з --all або --mirror)

source: force updates
uk: примусове оновлення

source: require old value of ref to be at this value
uk: вимагати, щоб старе значення посилання було очікуваним

source: control recursive pushing of submodules
uk: керування рекурсивною відправкою підмодулів

source: use thin pack
uk: використовувати тонкі паки

source: receive pack program
uk: шлях до проґрами запакування на сервері

source: set upstream for git pull/status
uk: встановити upstream для git pull/status

source: prune locally removed refs
uk: почистити локально вилучені посилання

source: bypass pre-push hook
uk: пропустити гак переднадсилання

source: push missing but relevant tags
uk: надіслати пропущені, але потрібні позначки

source: GPG sign the push
uk: підписати відправку за допомогою GPG

source: request atomic transaction on remote side
uk: запитати виконання атомарної транзакції на віддаленому боці

source: --delete is incompatible with --all, --mirror and --tags
uk: --delete несумісно з --all, --mirror і --tags

source: --delete doesn't make sense without any refs
uk: --delete не має сенсу без зазначення посилань

source: --all and --tags are incompatible
uk: --all та --tags неможливо використовувати одночасно

source: --all can't be combined with refspecs
uk: --all неможливо використовувати разом із специфікаціями посилань

source: --mirror and --tags are incompatible
uk: --mirror та --tags неможливо використовувати одночасно

source: --mirror can't be combined with refspecs
uk: --mirror неможливо використовувати разом із специфікаціями посилань

source: --all and --mirror are incompatible
uk: --all та --mirror неможливо використовувати одночасно

source: push options must not have new line characters
uk: опції для надсилання не повинні містити символи нового рядка

source: git read-tree [(-m [--trivial] [--aggressive] | --reset | --prefix=<prefix>) [-u [--exclude-per-directory=<gitignore>] | -i]] [--no-sparse-checkout] [--index-output=<file>] (--empty | <tree-ish1> [<tree-ish2> [<tree-ish3>]])
uk: git read-tree [(-m [--trivial] [--aggressive] | --reset | --prefix=<префікс>) [-u [--exclude-per-directory=<gitignore>] | -i]] [--no-sparse-checkout] [--index-output=<файл>] (--empty | <вказівник-дерева-1> [<вказівник-дерева-2> [<вказівник-дерева-3>]])

source: write resulting index to <file>
uk: записати результуючий індекс у <файл>

source: only empty the index
uk: просто очистити індекс

source: Merging
uk: Злиття

source: perform a merge in addition to a read
uk: виконати злиття у доповнення до читання

source: 3-way merge if no file level merging required
uk: триходове злиття, якщо не потрібне злиття на рівні файлів

source: 3-way merge in presence of adds and removes
uk: триходове злиття у випадку присутности додавань або вилучень файлів

source: same as -m, but discard unmerged entries
uk: те ж, що й -m, але скасовує зміни незлитих записів

source: <subdirectory>/
uk: <підкаталог>/

source: read the tree into the index under <subdirectory>/
uk: прочитати дерево в індекс у <підкаталог>/

source: update working tree with merge result
uk: оновити робочий каталог результатом злиття

source: allow explicitly ignored files to be overwritten
uk: дозволити перезапис явно нехтуваних файлів

source: don't check the working tree after merging
uk: не перевіряти робочий каталог після злиття

source: don't update the index or the work tree
uk: не оновлювати індекс або робочий каталог

source: skip applying sparse checkout filter
uk: пропустити застосування фільтру часткового переходу

source: debug unpack-trees
uk: налагодження unpack-trees

source: Resolve all conflicts manually, mark them as resolved with "git add/rm <conflicted_files>", then run "git rebase --continue". You can instead skip this commit: run "git rebase --skip". To abort and get back to the state before "git rebase", run "git rebase --abort".
uk: Вирішіть усі конфлікти вручну, позначте їх вирішеними за допомогою «git add/rm <конфліктні-файли>», а потім виконайте «git rebase --continue». Якщо ви бажаєте пропустити цей коміт, то виконайте «git rebase --skip». Щоб перервати і повернутися до стану перед «git rebase», виконайте «git rebase --abort».

source: option
uk: параметр

source: It looks like 'git am' is in progress. Cannot rebase.
uk: Схоже виконується «git am». Неможливо виконати перебазування.

source: No rebase in progress?
uk: Немає перебазування у процесі?

source: The --edit-todo action can only be used during interactive rebase.
uk: Дія --edit-todo може використовуватися лише при інтерактивному перебазування.

source: Cannot read HEAD
uk: Не вдалося прочитати HEAD

source: You must edit all merge conflicts and then mark them as resolved using git add
uk: Ви повинні відредагувати усі конфлікти злиття, а потім позначити їх як вирішені за допомогою git add

source: could not remove '%s'
uk: неможливо вилучити %s

source: No such ref: %s
uk: Немає такого посилання: %s

source: Cannot autostash
uk: Не вдалося виконати автоматичне ховання

source: HEAD is now at %s
uk: HEAD зараз на %s

source: Please commit or stash them.
uk: Зробіть коміт або сховайте їх.

source: HEAD is up to date.
uk: HEAD вже в актуальному стані.

source: HEAD is up to date, rebase forced.
uk: HEAD вже в актуальному стані., примусове перебазування

source: The pre-rebase hook refused to rebase.
uk: Гак передперебазування відмовив у перебазуванні.

source: keep empty commits
uk: зберегти порожні коміти

source: allow commits with empty messages
uk: дозволити коміти з порожніми повідомленнями

source: continue rebase
uk: продовжити перебазування

source: shorten commit ids in the todo list
uk: вивести короткі ідентифікатори комітів в списку дій

source: expand commit ids in the todo list
uk: вивести повні ідентифікатори комітів в списку дій

source: check the todo list
uk: перевірити список справ

source: rearrange fixup/squash lines
uk: перевпорядкувати рядки fixup/squash

source: insert exec commands in todo list
uk: вставити команди виконання комітів в список справ

source: git receive-pack <git-dir>
uk: git receive-pack <каталог-git>

source: By default, updating the current branch in a non-bare repository is denied, because it will make the index and work tree inconsistent with what you pushed, and will require 'git reset --hard' to match the work tree to HEAD. You can set the 'receive.denyCurrentBranch' configuration variable to 'ignore' or 'warn' in the remote repository to allow pushing into its current branch; however, this is not recommended unless you arranged to update its work tree to match what you pushed in some other way. To squelch this message and still keep the default behaviour, set 'receive.denyCurrentBranch' configuration variable to 'refuse'.
uk: За замовчування оновлювати поточну гілку в сховищі з робочою копією (не голим) заборонено, оскільки це зробить стан індекса і робочого каталогу непослідовним і вам доведеться виконати «git reset --hard», щоб стан робочого каталогу знову відповідав HEAD. Ви можете встановити значення змінної конфігурації «receive.denyCurrentBranch» в «ignore» або «warn» у віддаленому сховищі, щоб дозволити надсилання змін в його поточну гілку; але це не рекомендується, хіба що ви маєте намір оновити його робочий каталог у спосіб, що подібний наведеному вище. Щоб пропустити це повідомлення і все одно залишити типову поведінку встановіть значення змінної конфігурації «receive.denyCurrentBranch» рівним «refuse».

source: By default, deleting the current branch is denied, because the next 'git clone' won't result in any file checked out, causing confusion. You can set 'receive.denyDeleteCurrent' configuration variable to 'warn' or 'ignore' in the remote repository to allow deleting the current branch, with or without a warning message. To squelch this message, you can set it to 'refuse'.
uk: За замовчуванням видалення поточної гілки заборонене, оскільки наступний «git clone» не зможе отримати жодних файлів, що призведе до плутанини. Ви можете задати значення параметра «receive.denyDeleteCurrent» рівним «warn» чи «ignore» у віддаленому сховищі щоб дозволити видалення поточної гілки з або без попереджувального повідомлення. Щоб пропустити це повідомлення, ви можете задати його рівним «refuse».

source: quiet
uk: без повідомлень

source: You must specify a directory.
uk: Слід зазначити каталог.

source: '%s' is not a valid timestamp
uk: «%s» не є припустимою міткою дати/часу

source: git remote add [-t <branch>] [-m <master>] [-f] [--tags | --no-tags] [--mirror=<fetch|push>] <name> <url>
uk: git remote add [-t <гілка>] [-m <майстер-гілка>] [-f] [--tags | --no-tags] [--mirror=<fetch|push>] <ім’я> <адреса>

source: git remote rename <old> <new>
uk: git remote rename <стара-назва> <нова-назва>

source: git remote remove <name>
uk: git remote remove <ім’я>

source: git remote set-head <name> (-a | --auto | -d | --delete | <branch>)
uk: git remote set-head <ім’я> (-a | --auto | -d | --delete | <гілка>)

source: git remote [-v | --verbose] show [-n] <name>
uk: git remote [-v | --verbose] show [-n] <ім’я>

source: git remote prune [-n | --dry-run] <name>
uk: git remote prune [-n | --dry-run] <ім’я>

source: git remote [-v | --verbose] update [-p | --prune] [(<group> | <remote>)...]
uk: git remote [-v | --verbose] update [-p | --prune] [(<група> | <ім’я-віддаленого-сховища>)…]

source: git remote set-branches [--add] <name> <branch>...
uk: git remote set-branches [--add] <ім’я> <гілка>…

source: git remote get-url [--push] [--all] <name>
uk: git remote get-url [--push] [--all] <ім’я>

source: git remote set-url [--push] <name> <newurl> [<oldurl>]
uk: git remote set-url [--push] <ім’я> <нова-url> [<стара-url>]

source: git remote set-url --add <name> <newurl>
uk: git remote set-url --add <ім’я> <нова-url>

source: git remote set-url --delete <name> <url>
uk: git remote set-url --delete <ім’я> <url>

source: git remote add [<options>] <name> <url>
uk: git remote add [<опції>] <ім’я> <url>

source: git remote set-branches <name> <branch>...
uk: git remote set-branches <ім’я> <гілка>…

source: git remote set-branches --add <name> <branch>...
uk: git remote set-branches --add <ім’я> <гілка>…

source: git remote show [<options>] <name>
uk: git remote show [<опції>] <ім’я>

source: git remote prune [<options>] <name>
uk: git remote prune [<опції>] <ім’я>

source: git remote update [<options>] [<group> | <remote>]...
uk: git remote update [<опції>] [<група> | <ім’я-віддаленого-сховища>]…

source: Updating %s
uk: Оновлюємо %s

source: --mirror is dangerous and deprecated; please use --mirror=fetch or --mirror=push instead
uk: ключ --mirror небезпечний й не рекомендується для використання; використовуйте замість нього --mirror=fetch або --mirror=push

source: unknown mirror argument: %s
uk: невідомий аргумент для mirror: %s

source: fetch the remote branches
uk: здобути віддалені гілки

source: import all tags and associated objects when fetching
uk: імпортувати усі мітки та асоційовані об’єкти при здобуванні змін

source: or do not fetch any tag at all (--no-tags)
uk: або не здобувати мітки взагалі (--no-tags)

source: branch(es) to track
uk: відстежувані гілки

source: master branch
uk: майстер гілка

source: set up remote as a mirror to push to or fetch from
uk: налаштувати віддалене сховище як дзеркало для надсилання або здобування змін

source: specifying a master branch makes no sense with --mirror
uk: зазначення майстер гілки не має сенсу з параметром --mirror

source: specifying branches to track makes sense only with fetch mirrors
uk: зазначення відстежуваних гілок має сенс лише при дзеркальному видобуванні змін

source: remote %s already exists.
uk: віддалене сховище %s вже існує

source: '%s' is not a valid remote name
uk: «%s» не є припустимим іменем віддаленого сховища.

source: Could not setup master '%s'
uk: Не вдалося налаштувати майстер гілку «%s»

source: Could not get fetch map for refspec %s
uk: Не вдалося здобути мапу для специфікації посилання %s

source: (matching)
uk: (відповідність)

source: (delete)
uk: (видалити)

source: Could not rename config section '%s' to '%s'
uk: Не вдалося перейменувати секцію конфігурації з «%s» на «%s»

source: Not updating non-default fetch refspec %s Please update the configuration manually if necessary.
uk: Не оновлюю нестандартну специфікацію посилання для видобування %s Будь ласка, якщо потрібно, оновіть конфігурацію вручну.

source: deleting '%s' failed
uk: не вдалося вилучити «%s»

source: creating '%s' failed
uk: не вдалося створити «%s»

source: Note: A branch outside the refs/remotes/ hierarchy was not removed; to delete it, use:
uk: Нотатка: Деякі гілки поза ієрархією refs/remotes/ не будуть вилучені; щоб вилучити їх, використовуйте:

source: Could not remove config section '%s'
uk: Не вдалося вилучити секцію файлу конфігурації «%s»

source: new (next fetch will store in remotes/%s)
uk: нова (наступне здобування змін збереже її в remotes/%s)

source: tracked
uk: відслідковується

source: stale (use 'git remote prune' to remove)
uk: недійсна (використовуйте «git remote prune», щоб вилучити)

source: invalid branch.%s.merge; cannot rebase onto > 1 branch
uk: неправильний параметр конфігурації branch.%s.merge; неможливо перебазувати більше ніж над 1 гілкою

source: rebases interactively onto remote %s
uk: перебазовує інтерактивно над віддаленою гілкою %s

source: rebases onto remote %s
uk: буде перебазовано над віддалною гілкою %s

source: merges with remote %s
uk: буде злита з віддаленою гілкою %s

source: merges with remote %s
uk: буде злита з віддаленою гілкою %s

source: %-*s and with remote %s
uk: %-*s та з віддаленою гілкою %s

source: create
uk: створена

source: delete
uk: вилучена

source: up to date
uk: вже актуальна

source: fast-forwardable
uk: можливе перемотування вперед

source: local out of date
uk: локальна гілка застаріла

source: %-*s forces to %-*s (%s)
uk: %-*s буде примусово надіслана в %-*s (%s)

source: %-*s pushes to %-*s (%s)
uk: %-*s буде надіслана в %-*s (%s)

source: %-*s forces to %s
uk: %-*s буде примусово надіслана в %s

source: %-*s pushes to %s
uk: %-*s буде надіслана в %s

source: do not query remotes
uk: не опитувати віддалені сховища

source: * remote %s
uk: * віддалене сховище %s

source: Fetch URL: %s
uk: URL для здобування змін: %s

source: (no URL)
uk: (немає URL)

source: Push URL: %s
uk: URL для надсилання: %s

source: HEAD branch: %s
uk: HEAD-гілка: %s

source: (not queried)
uk: (не запитувався)

source: (unknown)
uk: (невідомо)

source: HEAD branch (remote HEAD is ambiguous, may be one of the following):
uk: HEAD гілка (HEAD віддаленого сховища неоднозначний, може бути одним із):

source: Remote branch:%s
uk: Віддалена гілка:%s

source: (status not queried)
uk: (статус не запитаний)

source: Local branch configured for 'git pull':
uk: Локальна гілка, налаштована для «git pull»:

source: Local refs will be mirrored by 'git push'
uk: Локальні посилання, дзеркальовані за допомогою «git push»

source: Local ref configured for 'git push'%s:
uk: Локальне посилання, налаштоване для «git push»%s:

source: set refs/remotes/<name>/HEAD according to remote
uk: встановити refs/remotes/<ім’я>/HEAD у залежності від віддаленого сховища

source: delete refs/remotes/<name>/HEAD
uk: вилучити refs/remotes/<ім’я>/HEAD

source: Cannot determine remote HEAD
uk: Не вдалося визначити віддалений HEAD

source: Multiple remote HEAD branches. Please choose one explicitly with:
uk: Декілька віддалених HEAD гілок. Вкажіть явно одну з них:

source: Could not delete %s
uk: Неможливо вилучити %s

source: Not a valid ref: %s
uk: Неправильне посилання: %s

source: Could not setup %s
uk: Не вдалося налаштувати %s

source: %s will become dangling!
uk: %s буде висячою гілкою!

source: %s has become dangling!
uk: %s стала висячою гілкою!

source: Pruning %s
uk: Очищення %s

source: * [would prune] %s
uk: * [буде очищене] %s

source: * [pruned] %s
uk: * [очищено] %s

source: prune remotes after fetching
uk: почистити віддалені сховища після здобування змін

source: No such remote '%s'
uk: Немає такого віддаленого сховища «%s»

source: add branch
uk: додати гілку

source: no remote specified
uk: не зазначене віддалене сховище

source: query push URLs rather than fetch URLs
uk: запитати URL надсилання, замість URL здобування

source: return all URLs
uk: повернути усі URL

source: no URLs configured for remote '%s'
uk: URL не налаштовані для віддаленого сховища «%s»

source: manipulate push URLs
uk: керування URL надсилання

source: add URL
uk: додати адресу

source: delete URLs
uk: вилучити URL

source: --add --delete doesn't make sense
uk: --add неможливо використовувати одночасно з --delete

source: Invalid old URL pattern: %s
uk: Неправильний шаблон старої URL: %s

source: No such URL found: %s
uk: Не знайдені збіги URL: %s

source: Will not delete all non-push URLs
uk: Неможливо вилучити усі URL не-надсилань

source: be verbose; must be placed before a subcommand
uk: бути багатослівніше; повинно стояти перед підкомандою

source: Unknown subcommand: %s
uk: Невідома підкоманда: %s

source: git repack [<options>]
uk: git repack [<опції>]

source: Incremental repacks are incompatible with bitmap indexes. Use --no-write-bitmap-index or disable the pack.writebitmaps configuration.
uk: Інкрементальні перепакування не сумісні з індексами в бітових мапах. Використовуйте опцію --no-write-bitmap-index або вимкніть параметр конфігурації pack.writebitmaps.

source: pack everything in a single pack
uk: запакувати усе в одну паку

source: same as -a, and turn unreachable objects loose
uk: те ж, що й -a, але додатково відкинути недосяжні об’єкти

source: remove redundant packs, and run git-prune-packed
uk: вилучіть зайві паки й запустіть git-prune-packed

source: pass --no-reuse-delta to git-pack-objects
uk: передати опцію --no-reuse-delta в git-pack-objects

source: pass --no-reuse-object to git-pack-objects
uk: передати опцію --no-reuse-object в git-pack-objects

source: do not run git-update-server-info
uk: не запускати git-update-server-info

source: pass --local to git-pack-objects
uk: передати опцію --local в git-pack-objects

source: write bitmap index
uk: запис індексу в бітових мапах

source: approxidate
uk: приблизна-дата

source: with -A, do not loosen objects older than this
uk: з опцією -A, не відкидувати об’єкти старіші, ніж вказано

source: with -a, repack unreachable objects
uk: з параметром -a, перепаковувати недоступні об'єкти

source: size of the window used for delta compression
uk: розмір вікна, що використовується для стиснення дельт

source: bytes
uk: кількість-байтів

source: same as the above, but limit memory size instead of entries count
uk: те ж, що й вище, але обмежити розмір пам’яті, а не кількість записів

source: limits the maximum delta depth
uk: обмеження на максимальну глибину дельт

source: limits the maximum number of threads
uk: обмеження на максимальну кількість потоків

source: maximum size of each packfile
uk: максимальний розмір кожного з файлів паки

source: repack objects in packs marked with .keep
uk: перезапакувати об’єкти у паки, позначені файлом .keep

source: cannot delete packs in a precious-objects repo
uk: неможливо вилучати паки у precious-objects сховищі

source: --keep-unreachable and -A are incompatible
uk: --keep-unreachable та -A неможливо використовувати одночасно

source: failed to remove '%s'
uk: збій вилучення «%s»

source: git replace [-f] <object> <replacement>
uk: git replace [-f] <об’єкт> <заміна>

source: git replace [-f] --edit <object>
uk: git replace [-f] --edit <об’єкт>

source: git replace [-f] --graft <commit> [<parent>...]
uk: git replace [-f] --graft <коміт> [<батько>…]

source: git replace -d <object>...
uk: git replace -d <об’єкт>…

source: git replace [--format=<format>] [-l [<pattern>]]
uk: git replace [--format=<формат>] [-l [<шаблон>]]

source: bad mergetag in commit '%s'
uk: погана мітка злиття в коміті «%s»

source: malformed mergetag in commit '%s'
uk: пошкоджена мітка злиття в коміті «%s»

source: original commit '%s' contains mergetag '%s' that is discarded; use --edit instead of --graft
uk: оригінальний коміт «%s» містить мітку злиття «%s», яка була відкинута; використовуйте --edit замість --graft

source: the signature will be removed in the replacement commit!
uk: підпис буде вилучено у заміщеному коміті!

source: could not write replacement commit for: '%s'
uk: не вдалося записати заміну для коміту: «%s»

source: list replace refs
uk: вивести перелік замінюваних посилань

source: delete replace refs
uk: вилучення замінюваних посилань

source: edit existing object
uk: змінювання існуючого об’єкту

source: change a commit's parents
uk: змінювання батьків коміту

source: replace the ref if it exists
uk: заміна посилання, якщо воно існує

source: do not pretty-print contents for --edit
uk: не робити структурований вивід вмісту для --edit

source: use this format
uk: використовувати цей формат

source: git rerere [clear | forget <path>... | status | remaining | diff | gc]
uk: git rerere [clear | forget <шлях>… | status | remaining | diff | gc]

source: register clean resolutions in index
uk: записати чисті вирішення конфліктів в індекс

source: git reset [--mixed | --soft | --hard | --merge | --keep] [-q] [<commit>]
uk: git reset [--mixed | --soft | --hard | --merge | --keep] [-q] [<коміт>]

source: git reset [-q] [<tree-ish>] [--] <paths>...
uk: git reset [-q] [<вказівник-дерева>] [--] <пути>…

source: git reset --patch [<tree-ish>] [--] [<paths>...]
uk: git reset --patch [<вказівник-дерева>] [--] [<шляхи>…]

source: soft
uk: м'який

source: hard
uk: жорсткий

source: merge
uk: злити

source: keep
uk: залишити

source: You do not have a valid HEAD.
uk: У вас немає коректного HEAD.

source: Failed to find tree of HEAD.
uk: Не вдалося знайти дерево у HEAD.

source: Failed to find tree of %s.
uk: Не вдалося знайти дерево у %s.

source: Cannot do a %s reset in the middle of a merge.
uk: Неможна виконати скидання в режимі «%s» під час злиття.

source: be quiet, only report errors
uk: тихий режим, виводити лише помилки

source: reset HEAD and index
uk: скинути HEAD та індекс

source: reset only HEAD
uk: скинути лише HEAD

source: reset HEAD, index and working tree
uk: скинути HEAD, індекс і робочий каталог

source: reset HEAD but keep local changes
uk: скинути HEAD, але залишити локальні зміни

source: record only the fact that removed paths will be added later
uk: записати лише факт того, що вилучені шляхи будуть додані пізніше

source: Failed to resolve '%s' as a valid revision.
uk: Не вдалося розпізнати «%s» як дійсну редакцію.

source: Failed to resolve '%s' as a valid tree.
uk: Не вдалося розпізнати «%s» як дійсне дерево.

source: --patch is incompatible with --{hard,mixed,soft}
uk: --patch неможливо використовувати одночасно з --{hard,mixed,soft}

source: --mixed with paths is deprecated; use 'git reset -- <paths>' instead.
uk: використання опції --mixed з шляхами застаріло; використовуйте «git reset -- <шляхи>» instead.

source: Cannot do %s reset with paths.
uk: Неможна виконати скидання у режимі «%s» разом з зазначенням шляху.
