Repository: PlagaMedicum/Ubuntu-Translation-Demo
Catalog: rosetta-eoan/*/LC_MESSAGES/git.po
Languages: uk

source: list both remote-tracking and local branches
uk: показувати і віддалено відстежувані, і локальні гілки

source: delete fully merged branch
uk: вилучити повністю злиті гілки

source: delete branch (even if not merged)
uk: вилучити гілку (навіть якщо не злита)

source: move/rename a branch and its reflog
uk: перемістити/перейменувати гілку і її журнал посилань

source: move/rename a branch, even if target exists
uk: перемістити/перейменувати гілку, навіть якщо ціль вже існує

source: copy a branch and its reflog
uk: копіювати гілку та її журнал посилань

source: copy a branch, even if target exists
uk: копіювати гілку, навіть якщо ціль вже існує

source: list branch names
uk: вивести список назв гілок

source: create the branch's reflog
uk: створити журнал посилань для гілки

source: edit the description for the branch
uk: редагувати опис гілки

source: force creation, move/rename, deletion
uk: примусове створення, переміщення або вилучення гілки

source: print only branches that are merged
uk: вивід лише злитих гілок

source: print only branches that are not merged
uk: вивід лише незлитих гілок

source: list branches in columns
uk: показати гілки в стовпцях

source: key
uk: ключ

source: field name to sort on
uk: ім’я поля, за яким виконати впорядкування

source: object
uk: об’єкт

source: print only branches of the object
uk: вивід лише гілок певного об'єкту

source: sorting and filtering are case insensitive
uk: впорядкування та фільтрування нечутливі до регістру

source: format to use for the output
uk: використовувати формат для виводу

source: HEAD not found below refs/heads!
uk: HEAD не знайдений в refs/heads!

source: --column and --verbose are incompatible
uk: --column і --verbose несумісні

source: branch name required
uk: потрібна назва гілки

source: Cannot give description to detached HEAD
uk: Неможна дати опис відокремленому HEAD

source: cannot edit description of more than one branch
uk: неможливо змінити опис більше однієї гілки за раз

source: No commit on branch '%s' yet.
uk: Ще немає коміту на гілці «%s».

source: No branch named '%s'.
uk: Немає гілки з назвою «%s».

source: too many branches for a copy operation
uk: забагато гілок для операції копіювання

source: too many arguments for a rename operation
uk: забагато аргументів для операції перейменування

source: too many arguments to set new upstream
uk: забагато аргументів для налаштування нового upstream

source: could not set upstream of HEAD to %s when it does not point to any branch.
uk: неможливо встановити upstream для HEAD на %s, коли він не вказує на жодну гілку.

source: no such branch '%s'
uk: немає такої гілки «%s»

source: branch '%s' does not exist
uk: гілки з назвою «%s» не існує.

source: too many arguments to unset upstream
uk: забагато аргументів для скидання upstream

source: could not unset upstream of HEAD when it does not point to any branch.
uk: неможливо прибрати upstream для HEAD, коли він не вказує на жодну гілку.

source: Branch '%s' has no upstream information
uk: Гілка «%s» не відомостей про upstream

source: -a and -r options to 'git branch' do not make sense with a branch name
uk: параметри -a і -r «git branch» не пов’язані з назвою гілки

source: the '--set-upstream' option is no longer supported. Please use '--track' or '--set-upstream-to' instead.
uk: параметр --set-upstream більше не підтримується. Замість нього використовуйте «--track» або «--set-upstream-to»

source: %s is okay
uk: %s в порядку

source: Need a repository to create a bundle.
uk: Для створення згортка потрібне сховище.

source: Need a repository to unbundle.
uk: Для розгортання потрібне сховище.

source: git cat-file (-t [--allow-unknown-type] | -s [--allow-unknown-type] | -e | -p | <type> | --textconv | --filters) [--path=<path>] <object>
uk: git cat-file (-t [--allow-unknown-type] | -s [--allow-unknown-type] | -e | -p | <тип> | --textconv | --filters) [--path=<шлях>] <об'єкт>

source: <type> can be one of: blob, tree, commit, tag
uk: <тип> може бути одним з: blob, tree, commit, tag

source: show object type
uk: показати тип об’єкту

source: show object size
uk: показати розмір об’єкту

source: exit with zero when there's no error
uk: завершувати нулем, коли немає помилок

source: pretty-print object's content
uk: форматований вивід вмісту об’єкту

source: for blob objects, run textconv on object's content
uk: для blob об’єктів, виконати textconv на вмісті об’єкту

source: for blob objects, run filters on object's content
uk: запуск фільтрів на вміст двійкових об'єктів

source: blob
uk: двійковий об'єкт

source: use a specific path for --textconv/--filters
uk: використовувати певний шлях для --textconv/--filters

source: allow -s and -t to work with broken/corrupt objects
uk: дозволити -s і -t працювати з пошкодженими об’єктами

source: buffer --batch output
uk: буферувати вивід --batch

source: show info and content of objects fed from the standard input
uk: показати інформацію і вміст об’єктів, переданих зі стандартного введення

source: show info about objects fed from the standard input
uk: показати інформацію про об’єкти, передані зі стандартного введення

source: follow in-tree symlinks (used with --batch or --batch-check)
uk: переходити за символьними посиланнями всередині дерева (використовується з опціями --batch і --batch-check)

source: show all objects with --batch or --batch-check
uk: показати усі об’єкти з опціями --batch або --batch-check

source: git check-attr [-a | --all | <attr>...] [--] <pathname>...
uk: git check-attr [-a | --all | <атрибут>…] [--] <шлях>…

source: git check-attr --stdin [-z] [-a | --all | <attr>...]
uk: git check-attr --stdin [-z] [-a | --all | <атрибут>…]

source: report all attributes set on file
uk: повідомити усі атрибути, встановлені на файлі

source: use .gitattributes only from the index
uk: використовувати .gitattributes лише з індексу

source: read file names from stdin
uk: читати імена файлів з stdin

source: terminate input and output records by a NUL character
uk: закінчення вводу і виводу записів по НУЛЬОВОМУ символу

source: suppress progress reporting
uk: не виводити звіт про поступ

source: show non-matching input paths
uk: показати уведені шляхи, що не збігаються

source: ignore index when checking
uk: нехтувати індекс при перевірці

source: cannot specify pathnames with --stdin
uk: неможливо вказувати шляхи разом з параметром --stdin

source: -z only makes sense with --stdin
uk: -z має сенс лише разом з параметром --stdin

source: no path specified
uk: шлях не зазначений

source: --quiet is only valid with a single pathname
uk: --quiet можна використовувати лише при вказуванні одного шляху

source: cannot have both --quiet and --verbose
uk: неможливо використовувати одночасно --quiet та --verbose

source: --non-matching is only valid with --verbose
uk: --non-matching можливо використовувати лише разом з --verbose

source: git check-mailmap [<options>] <contact>...
uk: git check-mailmap [<опції>] <контакт>…

source: also read contacts from stdin
uk: також читати контакти із стандартного вводу

source: unable to parse contact: %s
uk: не вдалося розібрати контакт: %s

source: no contacts specified
uk: контакти не зазначені

source: git checkout-index [<options>] [--] [<file>...]
uk: git checkout-index [<опції>] [--] [<файл>…]

source: stage should be between 1 and 3 or all
uk: індекс має бути між 1 та 3 або all

source: check out all files in the index
uk: отримати усі файли з індексу

source: force overwrite of existing files
uk: примусовий перезапис існуючих файлів

source: no warning for existing files and files not in index
uk: не виводити попередження для існуючих файлів і файлів поза індексом

source: don't checkout new files
uk: не отримувати нові файли

source: update stat information in the index file
uk: оновити статичну інформацію в індексному файлі

source: read list of paths from the standard input
uk: читати список шляхів зі стандартного введення

source: write the content to temporary files
uk: записати вміст у тимчасові файли

source: string
uk: рядок

source: when creating files, prepend <string>
uk: при створенні файлів додавати спереду <рядок>

source: copy out the files from named stage
uk: копіювати файли із вказаного індексу

source: git checkout [<options>] <branch>
uk: git checkout [<опції>] <гілка>

source: git checkout [<options>] [<branch>] -- <file>...
uk: git checkout [<опції>] [<гілка>] -- <файл>…

source: path '%s' does not have our version
uk: шлях «%s» не містить нашу версію

source: path '%s' does not have their version
uk: шлях «%s» не містить їхню версію

source: path '%s' does not have all necessary versions
uk: шлях «%s» не містить всі потрібні версії

source: path '%s' does not have necessary versions
uk: шлях «%s» не містить потрібні версії

source: path '%s': cannot merge
uk: шлях «%s»: неможливо злити

source: Unable to add merge result for '%s'
uk: Неможливо додати результат злиття для «%s»

source: '%s' cannot be used with updating paths
uk: «%s» не може бути використано з оновленими шляхами

source: '%s' cannot be used with %s
uk: «%s» неможливо використовувати з %s

source: Cannot update paths and switch to branch '%s' at the same time.
uk: Неможливо оновити шляхи і змінити гілку «%s» одночасно.

source: path '%s' is unmerged
uk: шлях «%s» не злито

source: you need to resolve your current index first
uk: спочатку потрібно вирішити конфлікти у Вашому поточному індексі

source: Can not do reflog for '%s': %s
uk: Не вдалося створити журнал посилань для «%s»: %s

source: HEAD is now at
uk: HEAD тепер на

source: unable to update HEAD
uk: неможливо оновити HEAD

source: Reset branch '%s'
uk: Скинути гілку '%s'

source: Already on '%s'
uk: Вже в «%s»

source: Switched to and reset branch '%s'
uk: Скинути гілку і перейти в «%s»

source: Switched to a new branch '%s'
uk: Перейшов до нової гілки «%s»

source: Switched to branch '%s'
uk: Перейшов до гілки «%s»

source: ... and %d more.
uk: ... і ще %d.

source: Warning: you are leaving %d commit behind, not connected to any of your branches: %s
uk: Увага: ви залишаєте %d коміт неприєднаним до жодної з ваших гілок: %s

source: If you want to keep it by creating a new branch, this may be a good time to do so with: git branch <new-branch-name> %s
uk: Якщо Ви волієте зберегти їх за допомогою створення нової гілки, то наразі самий час зробити це за допомогою: git branch <ім’я-нової-гілки> %s

source: internal error in revision walk
uk: внутрішня помилка при проході по редакціям

source: Previous HEAD position was
uk: Попередня позиція HEAD була

source: You are on a branch yet to be born
uk: Ви знаходитеся у ще не створеній гілці

source: only one reference expected, %d given.
uk: очікується лише одне посилання, а передано %d.

source: invalid reference: %s
uk: некоректне посилання: %s

source: reference is not a tree: %s
uk: посилання не вказує на дерево: %s

source: paths cannot be used with switching branches
uk: шляхи не можуть бути використані при зміні гілок

source: '%s' cannot be used with switching branches
uk: «%s' не може бути використано при зміні гілок

source: '%s' cannot be used with '%s'
uk: «%s» неможливо використовувати з «%s»

source: Cannot switch branch to a non-commit '%s'
uk: Неможливо перемикнути гілку на не коміт «%s»

source: branch
uk: гілка

source: create and checkout a new branch
uk: створити нову гілку і перейти до неї

source: create/reset and checkout a branch
uk: створити/скинути і перейти на гілку

source: create reflog for new branch
uk: створити журнал посилань для нової гілки

source: detach HEAD at named commit
uk: відокремити HEAD на вказаному коміті

source: set upstream info for new branch
uk: встановити інформацію про upstream для нової гілки

source: new-branch
uk: нова-гілка

source: new unparented branch
uk: нова гілка без батьків

source: checkout our version for unmerged files
uk: перейти на нашу версію для незлитих файлів

source: checkout their version for unmerged files
uk: перейти на їх версію для незлитих файлів

source: force checkout (throw away local modifications)
uk: примусовий перехід (відкидує усі локальні зміни)

source: perform a 3-way merge with the new branch
uk: виконати триходове злиття з новою гілкою

source: update ignored files (default)
uk: оновити нехтувані файли (типово)

source: style
uk: стиль

source: conflict style (merge or diff3)
uk: стиль конфліктів злиття (merge або diff3)

source: do not limit pathspecs to sparse entries only
uk: не обмежувати специфікатори шляху лише частковими записами

source: second guess 'git checkout <no-such-branch>'
uk: перегляд «git checkout <no-such-branch>»

source: do not check if another worktree is holding the given ref
uk: не перевіряти, що інше дерево вже містить вказане посилання

source: force progress reporting
uk: примусово виводити поступ

source: -b, -B and --orphan are mutually exclusive
uk: -b, -B та --orphan неможливо використовувати одночасно

source: --track needs a branch name
uk: --track має потребу в імені гілки

source: invalid path specification
uk: неправильна специфікація шляху

source: '%s' is not a commit and a branch '%s' cannot be created from it
uk: «%s» не є коміто і тому з нього неможливо створити гілку «%s»

source: git checkout: --detach does not take a path argument '%s'
uk: git checkout: --detach не приймає шлях «%s» як аргумент

source: git checkout: --ours/--theirs, --force and --merge are incompatible when checking out of the index.
uk: git checkout: --ours/--theirs, --force and --merge неможливо використовувати одночасно при застосуванні стану індексу.

source: git clean [-d] [-f] [-i] [-n] [-q] [-e <pattern>] [-x | -X] [--] <paths>...
uk: git clean [-d] [-f] [-i] [-n] [-q] [-e <шаблон>] [-x | -X] [--] <шляхи>…

source: Removing %s
uk: Вилучення %s.

source: Would remove %s
uk: Буде вилучено %s

source: Skipping repository %s
uk: Пропуск сховища %s

source: Would skip repository %s
uk: Буде пропущено сховище %s

source: failed to remove %s
uk: не вдалося вилучити %s

source: Prompt help: 1 - select a numbered item foo - select item based on unique prefix - (empty) select nothing
uk: Довідка по вибору: 1 - вибрати пронумерований елемент foo - вибрати елемент на основі унікального префіксу - (пусто) нічого не вибирати

source: Prompt help: 1 - select a single item 3-5 - select a range of items 2-3,6-9 - select multiple ranges foo - select item based on unique prefix -... - unselect specified items * - choose all items - (empty) finish selecting
uk: Довідки з виділення: 1 - вибрати один елемент 3-5 - вибрати діапазон елементів 2-3,6-9 - вибрати кілька діапазонів foo - вибрати елемент з вказаним префіксом -… - прибрати виділення з вказаних елементів * - вибрати всі елементи - (пусто) завершити виділення

source: Huh (%s)?
uk: Ага (%s)?

source: Input ignore patterns>>
uk: Шаблони нехтування вводу>>

source: WARNING: Cannot find items matched by: %s
uk: ПОПЕРЕДЖЕННЯ: Не вдалося знайти елементи, що відповідають: %s

source: Select items to delete
uk: Вкажіть елементи для вилучення

source: Remove %s [y/N]?
uk: Вилучити %s [y - так/N - ні]?

source: Bye.
uk: Бувай.

source: clean - start cleaning filter by pattern - exclude items from deletion select by numbers - select items to be deleted by numbers ask each - confirm each deletion (like "rm -i") quit - stop cleaning help - this screen ? - help for prompt selection
uk: clean - почати очистку filter by pattern - виключити вилучення елементів select by numbers - виключити вилучення елементів за номерами ask each - запитувати схвалення на вилучення кожного елементу (як «rm -i») quit - припинити очистку help - цей екран ? - довідка по виділенню

source: *** Commands ***
uk: *** Команди ***

source: What now
uk: Що тепер

source: Would remove the following item:
uk: Вилучити такі елементи:

source: No more files to clean, exiting.
uk: Більше немає файлів для очистки, виходимо.

source: do not print names of files removed
uk: не виводити імена вилучених файлів

source: force
uk: примусово

source: interactive cleaning
uk: інтерактивна очистка

source: remove whole directories
uk: вилучити каталоги повністю

source: pattern
uk: взірець

source: add <pattern> to ignore rules
uk: додати <шаблон> до правил нехтування

source: remove ignored files, too
uk: також вилучити нехтувані файли

source: remove only ignored files
uk: вилучити лише нехтувані файли

source: -x and -X cannot be used together
uk: -x та-X неможливо використовувати разом

source: clean.requireForce set to true and neither -i, -n, nor -f given; refusing to clean
uk: clean.requireForce встановлений як true й жодна з опцій -i, -n або -f не вказана; відмова очистки

source: clean.requireForce defaults to true and neither -i, -n, nor -f given; refusing to clean
uk: clean.requireForce встановлений типово як true й жодна з опцій -i, -n або -f не вказана; відмова очистки

source: git clone [<options>] [--] <repo> [<dir>]
uk: git clone [<опції>] [--] <сховище> [<каталог>]

source: don't create a checkout
uk: не перемикати робочу копію на HEAD

source: create a bare repository
uk: створити голе сховище

source: create a mirror repository (implies bare)
uk: створити дзеркало-сховище (включає у себе й параметр bare)

source: to clone from a local repository
uk: для клонування із локального сховища

source: don't use local hardlinks, always copy
uk: не використовувати жорсткі посилання, завжди копіювати файли

source: setup as shared repository
uk: налаштувати як спільне сховище

source: pathspec
uk: специфікатор шляху

source: initialize submodules in the clone
uk: ініціалізувати підмодулі у клоні

source: number of submodules cloned in parallel
uk: кількість подмодулей, які будуть клоновані паралельно

source: template-directory
uk: каталог шаблонів

source: directory from which templates will be used
uk: каталог, шаблони з якого будуть використані

source: reference repository
uk: еталонне сховище

source: use --reference only while cloning
uk: використовуйте --reference лише при клонуванні

source: name
uk: назва

source: use <name> instead of 'origin' to track upstream
uk: використовувати <ім’я> замість «origin» для відстежування upstream

source: checkout <branch> instead of the remote's HEAD
uk: перейти на <гілку>, замість HEAD віддаленого сховища

source: path to git-upload-pack on the remote
uk: шлях до git-upload-pack на віддаленого сховища

source: depth
uk: глибина

source: create a shallow clone of that depth
uk: зробити частковий клон вказаної глибини

source: time
uk: час

source: create a shallow clone since a specific time
uk: створити частковий клон до визначеного часу

source: revision
uk: редакція

source: deepen history of shallow clone, excluding rev
uk: поглибити історію часткового клону виключивши редакцію

source: clone only one branch, HEAD or --branch
uk: клонувати лише одну гілку, HEAD або --branch

source: don't clone any tags, and make later fetches not to follow them
uk: не клонувати позначки, а також зробити щоб наступні здобуття змін не слідкували за ними

source: any cloned submodules will be shallow
uk: всі склоновані підмодулі будуть частковими клонами

source: gitdir
uk: каталог-git

source: separate git dir from working tree
uk: розташувати каталог git окремо від робочої копії

source: key=value
uk: ключ=значення

source: set config inside the new repository
uk: встановити параметри всередині нового сховища

source: use IPv4 addresses only
uk: використовувати лише IPv4-адреса

source: use IPv6 addresses only
uk: використовувати лише IPv6-адреса

source: No directory name could be guessed. Please specify a directory on the command line
uk: Назву каталогу неможливо вгадати. Вкажіть назву каталогу за допомогою параметра командного рядка

source: info: Could not add alternate for '%s': %s
uk: Відомості: Не вдалося додати альтернативу для «%s»: %s

source: failed to open '%s'
uk: не вдалося відкрити «%s»

source: %s exists and is not a directory
uk: %s існує, і це не каталог

source: failed to stat %s
uk: не вдалося виконати stat %s

source: failed to unlink '%s'
uk: не вдалося від’єднати «%s»

source: failed to create link '%s'
uk: не вдалося створити посилання «%s»

source: failed to copy file to '%s'
uk: не вдалося скопіювати файл в «%s»

source: done.
uk: виконано.

source: Clone succeeded, but checkout failed. You can inspect what was checked out with 'git status' and retry the checkout with 'git checkout -f HEAD'
uk: Клонування пройшло успішно, але під час переходу сталася помилка. За допомогою команди «git status» Ви можете продивится, які файли були отримані, а повторити спробу переходу за допомогою «git checkout -f HEAD»

source: Could not find remote branch %s to clone.
uk: Не вдалося знайти віддалену гілку %s для клонування.

source: unable to update %s
uk: не вдалося оновити %s

source: remote HEAD refers to nonexistent ref, unable to checkout.
uk: віддалений HEAD посилається на неіснуюче посилання, неможливо перейти.

source: unable to checkout working tree
uk: не вдалося оновити робочий каталог

source: unable to write parameters to config file
uk: неможливо записати параметри у файл конфігурації

source: cannot repack to clean up
uk: не вдалося виконати перепакування для очистки

source: cannot unlink temporary alternates file
uk: не вдалося від’єднати тимчасові альтернативні файли

source: Too many arguments.
uk: Забагато аргументів.

source: You must specify a repository to clone.
uk: Потрібно вказати сховище для клонування.

source: --bare and --origin %s options are incompatible.
uk: --bare та --origin %s неможливо використовувати одночасно.

source: --bare and --separate-git-dir are incompatible.
uk: --bare та --separate-git-dir неможливо використовувати одночасно.

source: repository '%s' does not exist
uk: сховище «%s» не існує

source: depth %s is not a positive number
uk: глибина %s не є додатнім числом

source: destination path '%s' already exists and is not an empty directory.
uk: шлях призначення «%s» вже існує, й це не порожній каталог.

source: working tree '%s' already exists.
uk: робочий каталог «%s» вже існує.

source: could not create leading directories of '%s'
uk: не вдалося створити батьківські каталоги для «%s»

source: could not create work tree dir '%s'
uk: не вдалося створити робочий каталог «%s»

source: Cloning into bare repository '%s'...
uk: Клонування у голе сховище «%s»…

source: Cloning into '%s'...
uk: Клонування в «%s»...

source: clone --recursive is not compatible with both --reference and --reference-if-able
uk: клонування з параметром --recursive неможливо використовувати одночасно ані з --reference, ані з --reference-if-able

source: --depth is ignored in local clones; use file:// instead.
uk: --depth ігнорується в локальних клонах; використовуйте на заміну file://

source: --shallow-since is ignored in local clones; use file:// instead.
uk: --shallow-since ігнорується в локальних клонах; використовуйте на заміну file://.

source: --shallow-exclude is ignored in local clones; use file:// instead.
uk: --shallow-exclude --shallow-since ігнорується в локальних клонах; використовуйте на заміну file://.

source: --filter is ignored in local clones; use file:// instead.
uk: --filter ігнорується на локальних клонах; натомість використовуйте file://.

source: source repository is shallow, ignoring --local
uk: початкове сховище є частковим, --local нехтується

source: --local is ignored
uk: --local нехтується

source: Remote branch %s not found in upstream %s
uk: Зовнішня гілка %s не знайдена у upstream %s

source: You appear to have cloned an empty repository.
uk: Схоже, ви клонували порожнє сховище

source: git column [<options>]
uk: git column [<опції>]

source: lookup config vars
uk: запитати змінні конфігурації

source: layout to use
uk: використовувати схему розташування

source: Maximum width
uk: Максимальна ширина

source: Padding space on left border
uk: Відстань відступу ліворуч
