Repository: PlagaMedicum/Ubuntu-Translation-Demo
Catalog: rosetta-eoan/*/LC_MESSAGES/git.po
Languages: uk

source: Apply mode change to index [y,n,q,a,d%s,?]?
uk: Застосувати зміну режиму доступу до індексу [y,n,q,a,d%s,?]?

source: Apply deletion to index [y,n,q,a,d%s,?]?
uk: Застосувати видалення до індексу [y,n,q,a,d%s,?]?

source: Apply this hunk to index [y,n,q,a,d%s,?]?
uk: Застосувати зміни цього блоку до індексу [y,n,q,a,d%s,?]?

source: Discard mode change from worktree [y,n,q,a,d%s,?]?
uk: Скасувати зміну режиму доступу в робочому каталозі [y,n,q,a,d%s,?]?

source: Discard deletion from worktree [y,n,q,a,d%s,?]?
uk: Скасувати видалення в робочому каталозі [y,n,q,a,d%s,?]?

source: Discard this hunk from worktree [y,n,q,a,d%s,?]?
uk: Скасувати зміни цього блоку в робочому каталозі [y,n,q,a,d%s,?]?

source: Discard mode change from index and worktree [y,n,q,a,d%s,?]?
uk: Скасувати зміну режиму доступу в індексі та робочому каталозі [y,n,q,a,d%s,?]?

source: Discard deletion from index and worktree [y,n,q,a,d%s,?]?
uk: Скасувати видалення в індексі та робочому каталозі [y,n,q,a,d%s,?]?

source: Discard this hunk from index and worktree [y,n,q,a,d%s,?]?
uk: Скасувати зміни цього блоку в індексі та робочому каталозі [y,n,q,a,d%s,?]?

source: Apply mode change to index and worktree [y,n,q,a,d%s,?]?
uk: Застосувати зміну режиму доступу до індексу та робочого каталогу [y,n,q,a,d%s,?]?

source: Apply deletion to index and worktree [y,n,q,a,d%s,?]?
uk: Застосувати видалення до індексу та робочого каталогу [y,n,q,a,d%s,?]?

source: Apply this hunk to index and worktree [y,n,q,a,d%s,?]?
uk: Застосувати зміни цього блоку до індексу та робочого каталогу [y,n,q,a,d%s,?]?

source: No other hunks to goto
uk: Немає більше блоків змін для переходу

source: go to which hunk (<ret> to see more)?
uk: на котрий блок змін перейти (натисніть <enter> щоб побачити ще)?

source: go to which hunk?
uk: на котрий блок змін перейти?

source: Invalid number: '%s'
uk: Неприпустимий номер: «%s»

source: Sorry, only %d hunk available.
uk: Перепрошуємо, але лише %d блок змін доступний.

source: No other hunks to search
uk: Більше блоків змін для пошуку немає

source: search for regex?
uk: шукати за допомогою регулярного виразу?

source: Malformed search regexp %s: %s
uk: Спотворений регулярний вираз для пошуку %s: %s

source: No hunk matches the given pattern
uk: Відсутні блоки змін, які відповідають зазначеному шаблонові

source: No previous hunk
uk: Немає попереднього блоку змін

source: No next hunk
uk: Немає наступного блоку змін

source: Sorry, cannot split this hunk
uk: Перепрошуємо, але цей блок змін розбити неможливо

source: Split into %d hunk.
uk: Розбито на %d блок змін.

source: Sorry, cannot edit this hunk
uk: Перепрошуємо, це блок змін редагувати неможливо

source: Review diff
uk: Переглянути різницю

source: status - show paths with changes update - add working tree state to the staged set of changes revert - revert staged set of changes back to the HEAD version patch - pick hunks and update selectively diff - view diff between HEAD and index add untracked - add contents of untracked files to the staged set of changes
uk: status - показати шлях зі змінами update - додати стан робочого каталогу в споряджений набір змін revert - повернути споряджений набір змін до версії HEAD patch - вибрати блоки змін і вибірково оновити diff - переглянути різницю між HEAD та індексом add untracked - додати вміст невідслідковуваних файлів в споряджений набір змін

source: missing --
uk: відсутній --

source: unknown --patch mode: %s
uk: невідомий режим для --patch: %s

source: invalid argument %s, expecting --
uk: неприпустимий аргумент %s, очікується --

source: local zone differs from GMT by a non-minute interval
uk: локальний часовий пояс відмінний від GMT на нехвилинний інтервал

source: local time offset greater than or equal to 24 hours
uk: локальний зсув часу перевищує або рівний 24 години

source: the editor exited uncleanly, aborting everything
uk: редактор був закритий з помилкою, перериваю все

source: '%s' contains an intermediate version of the email you were composing.
uk: «%s» містить проміжну версію електронного листа, що ви створюєте.

source: '%s.final' contains the composed email.
uk: «%s.final» містить підготовлений електронний лист.

source: --dump-aliases incompatible with other options
uk: --dump-aliases несумісне з іншими опціями

source: Cannot run git format-patch from outside a repository
uk: Неможливо запустити git format-patch поза сховищем

source: `batch-size` and `relogin` must be specified together (via command-line or configuration option)
uk: «batch-size» та «relogin» мають бути зазначені разом (через командний рядок чи параметр конфігурації)

source: Unknown --suppress-cc field: '%s'
uk: Невідоме поле --suppress-cc: «%s»

source: Unknown --confirm setting: '%s'
uk: Невідомий параметр --confirm: «%s»

source: warning: sendmail alias with quotes is not supported: %s
uk: попередження: скорочення для sendmail з лапками не підтримується: %s

source: warning: `:include:` not supported: %s
uk: попередження: «:include:» не підтримується: %s

source: warning: `/file` or `|pipe` redirection not supported: %s
uk: попередження: переспрямування «/file» або «|pipe» не підтримується: %s

source: warning: sendmail line is not recognized: %s
uk: попередження: рядок sendmail не розпізнаний: %s

source: File '%s' exists but it could also be the range of commits to produce patches for. Please disambiguate by... * Saying "./%s" if you mean a file; or * Giving --format-patch option if you mean a range.
uk: Файл «%s» існує, але він також може бути діапазоном комітів, для яких потрібно створити латки. Просимо усунути неоднозначність... * Вказавши «./%s», якщо ви маєте на увазі ім'я файлу; або * Надавши опцію --format-patch, якщо ви маєте на увазі діапазон комітів.

source: Failed to opendir %s: %s
uk: Не вдалося виконати opendir %s: %s

source: fatal: %s: %s warning: no patches were sent
uk: критична помилка: %s: %s попередження: латки не були надіслані

source: No patch files specified!
uk: Не зазначений файл з латкою!

source: No subject line in %s?
uk: Відсутній рядок з темою в %s?

source: Failed to open for writing %s: %s
uk: Не вдалося відкрити для запису %s: %s

source: Lines beginning in "GIT:" will be removed. Consider including an overall diffstat or table of contents for the patch you are writing. Clear the body content if you don't wish to send a summary.
uk: Рядки, що починаються з «GIT:» будуть вилучені. Можливо знадобиться додати статистику додавань та вилучень чи таблицю вмісту в латку, що ви створюєте. Очистіть вміст, якщо ви , если вы не бажаєте надсилати лист з короткими відомостями.

source: Failed to open %s: %s
uk: Не вдалося відкрити %s: %s

source: Failed to open %s.final: %s
uk: Не вдалося відкрити %s.final: %s

source: Summary email is empty, skipping it
uk: Лист з короткими відомостями порожній, пропускаю його

source: Are you sure you want to use <%s> [y/N]?
uk: Ви дійсно бажаєте використовувати <%s> [y/N]?

source: The following files are 8bit, but do not declare a Content-Transfer-Encoding.
uk: Наступні файли 8-бітні, але містять Content-Transfer-Encoding.

source: Which 8bit encoding should I declare [UTF-8]?
uk: Котре 8-бітне кодування потрібно вказати [UTF-8]?

source: Refusing to send because the patch %s has the template subject '*** SUBJECT HERE ***'. Pass --force if you really want to send.
uk: Відмова надсилання, оскільки латка %s містить шаблонний заголовок «*** SUBJECT HERE ***». Вкажіть параметр --force, якщо ви дійсно бажаєте відправити його.

source: To whom should the emails be sent (if anyone)?
uk: Кому слід надсилати електронні листи (за наявності)?

source: fatal: alias '%s' expands to itself
uk: критична помилка: синонім «%s» вказує на самого себе

source: Message-ID to be used as In-Reply-To for the first email (if any)?
uk: Message-ID, що буде використовуватись в полі In-Reply-To для для першого листа (за наявності)?

source: error: unable to extract a valid address from: %s
uk: помилка: неможливо видобути чинну адресу з: %s

source: What to do with this address? ([q]uit|[d]rop|[e]dit):
uk: Що робити з цією адресою? ([q] - вийти|[d] - відкинути|[e] - редагувати):

source: CA path "%s" does not exist
uk: шлях CA «%s» не існує

source: The Cc list above has been expanded by additional addresses found in the patch commit message. By default send-email prompts before sending whenever this occurs. This behavior is controlled by the sendemail.confirm configuration setting. For additional information, run 'git send-email --help'. To retain the current behavior, but squelch this message, run 'git config --global sendemail.confirm auto'.
uk: Список Cc (отримувачів копії листа) був розширений додатковими адресами, знайденими в повідомленні коміта латки. Типово send-email перепитує перед надсилання, коли воно відбувається. Цю поведінку можливо змінити параметром у файлі конфігурації sendemail.confirm. Для додаткових відомостей виконайте «git send-email --help». Щоб залишити поточну поведінку, але приховати це повідомлення, виконайте «git config --global sendemail.confirm auto».

source: Send this email reply required
uk: Надсилання цієї відповіді на лист обов'язкове

source: The required SMTP server is not properly defined.
uk: Необхідний SMTP-сервер належним чином не визначений.

source: Server does not support STARTTLS! %s
uk: Сервер не підтримує STARTTLS! %s

source: STARTTLS failed! %s
uk: Збій STARTTLS! %s

source: Unable to initialize SMTP properly. Check config and use --smtp-debug.
uk: Неможливо ініціалізувати SMTP. Перевірте ваші налаштування і спробуйте запустити з параметром --smtp-debug.

source: Failed to send %s
uk: Не вдалося надіслати %s

source: Dry-Sent %s
uk: Імітація надсилання %s

source: Sent %s
uk: Надіслано %s

source: Dry-OK. Log says:
uk: Імітація OK. Журнал містить:

source: OK. Log says:
uk: OK. Журнал містить:

source: Result:
uk: Результат:

source: Result: OK
uk: Результат: OK

source: can't open file %s
uk: неможливо відкрити файл %s

source: (mbox) Adding cc: %s from line '%s'
uk: (mbox) Додавання cc: %s з рядка «%s»

source: (mbox) Adding to: %s from line '%s'
uk: (mbox) Додавання to: %s з рядка «%s»

source: (non-mbox) Adding cc: %s from line '%s'
uk: (non-mbox) Додавання cc: %s з рядка «%s»

source: (body) Adding cc: %s from line '%s'
uk: (body) Додавання cc: %s з рядка «%s»

source: (%s) Could not execute '%s'
uk: (%s) Неможливо виконати «%s»

source: (%s) Adding %s: %s from: '%s'
uk: (%s) Додавання %s: %s з: «%s»

source: (%s) failed to close pipe to '%s'
uk: (%s) не вдалося закрити катало до «%s»

source: cannot send message as 7bit
uk: неможливо надіслати повідомлення у 7-бітному кодуванні

source: invalid transfer encoding
uk: неприпустиме кодування передавання

source: unable to open %s: %s
uk: не вдалося відкрити %s: %s

source: %s: patch contains a line longer than 998 characters
uk: %s: латка містить рядок довжиною понад 998 символів

source: Skipping %s with backup suffix '%s'.
uk: Пропускаю %s з суфіксом резервної копії «%s».

source: Do you really want to send %s? [y|N]:
uk: Ви дійсно бажаєте надіслати %s? [y - так|N - ні]:
