Repository: PlagaMedicum/Ubuntu-Translation-Demo
Catalog: rosetta-eoan/*/LC_MESSAGES/git.po
Languages: uk

source: %s: no such path in the working tree. Use 'git <command> -- <path>...' to specify paths that do not exist locally.
uk: %s: немає такого шляху в робочому каталозі. Використовуйте «git <команда> -- <путь>…» щоб зазначити шляхи, які не існують локально.

source: ambiguous argument '%s': unknown revision or path not in the working tree. Use '--' to separate paths from revisions, like this: 'git <command> [<revision>...] -- [<file>...]'
uk: неоднозначний аргумент «%s»: невідома редакція чи шлях в робочому каталозі. Використовуйте «--» щоб відокремити шляхи від редакцій, наприклад: «git <команда> [<редакція>…] -- [<файл>…]»

source: option '%s' must come before non-option arguments
uk: параметр «%s» має йти перед аргументом, що не є опцією

source: ambiguous argument '%s': both revision and filename Use '--' to separate paths from revisions, like this: 'git <command> [<revision>...] -- [<file>...]'
uk: неоднозначний аргумент «%s»: одночасно і редація і назва файлу. Використовуйте «--» щоб відокремити шляхи від редакцій, наприклад: «git <команда> [<редакція>…] -- [<файл>…]»

source: unable to set up work tree using invalid config
uk: неможливо встановити робочий каталог за допомогою неприпустимої конфігурації

source: this operation must be run in a work tree
uk: ця операція має виконуватись в робочому каталозі

source: Expected git repo version <= %d, found %d
uk: Очікувана версія git-сховища <= %d, а знайдена %d

source: unknown repository extensions found:
uk: знайдені невідомі розширення сховища:

source: error opening '%s'
uk: помилка відкривання «%s»

source: too large to be a .git file: '%s'
uk: завеликий, щоб бути файлом .git: «%s»

source: error reading %s
uk: помилка читання з %s

source: invalid gitfile format: %s
uk: неприпустимий формат файлу git: %s

source: no path in gitfile: %s
uk: відсутній шлях у файлі git: %s

source: not a git repository: %s
uk: не є сховищем git: %s

source: '$%s' too big
uk: «$%s» завеликий

source: not a git repository: '%s'
uk: не є сховищем git: «%s»

source: cannot chdir to '%s'
uk: неможливо змінити каталог на «%s»

source: cannot come back to cwd
uk: неможливо повернутися у поточний робочий каталог

source: not a git repository (or any of the parent directories): %s
uk: не є сховищем git (або будь-яким з батьківських каталогів): %s

source: failed to stat '%*s%s%s'
uk: не вдалося отримати дані «%*s%s%s»

source: Unable to read current working directory
uk: Неможливо прочитати поточний робочий каталог

source: cannot change to '%s'
uk: неможливо змінити на «%s»

source: not a git repository (or any parent up to mount point %s) Stopping at filesystem boundary (GIT_DISCOVERY_ACROSS_FILESYSTEM not set).
uk: не є сховищем git repository (або будь-яким батьком аж до точки монтування %s) Зупинка на межі файлової системи (GIT_DISCOVERY_ACROSS_FILESYSTEM не задане).

source: problem with core.sharedRepository filemode value (0%.3o). The owner of files must always have read and write permissions.
uk: проблема із значенням режиму файлу для core.sharedRepository (0%.3o). Власник файлу повинен мати права на читання та запис.

source: open /dev/null or dup failed
uk: відкривання /dev/null чи дублікату завершилося невдачею

source: fork failed
uk: невдале розгалуження

source: setsid failed
uk: помилка у setsid

source: path '%s' does not exist
uk: шляху «%s» не існує

source: reference repository '%s' as a linked checkout is not supported yet.
uk: сховище, що посилається «%s» як зв’язаний стан, поки не підтримується.

source: reference repository '%s' is not a local repository.
uk: сховище, що посилається «%s» не є локальним.

source: reference repository '%s' is shallow
uk: сховище, що посилається «%s» є частковим

source: reference repository '%s' is grafted
uk: сховище, що посилається «%s» є зрощеним

source: %s is not a valid '%s' object
uk: %s не є дійсним об’єктом «%s»

source: unable to open %s
uk: неможливо відкрити %s

source: short SHA1 %s is ambiguous
uk: скорочений SHA1-ідентифікато %s неоднозначний

source: The candidates are:
uk: Можливо, ви мали на увазі:

source: Git normally never creates a ref that ends with 40 hex characters because it will be ignored when you just specify 40-hex. These refs may be created by mistake. For example, git checkout -b $br $(git rev-parse ...) where "$br" is somehow empty and a 40-hex ref is created. Please examine these refs and maybe delete them. Turn this message off by running "git config advice.objectNameWarning false"
uk: Зазвичай Git не створює посилання, що закінчуються на 40 шістнадцядкових символів, тому, що вони будуть нехтуватися, коли Ви просто вкажете це 40-символьне шістнадцяткове число. Такі посилання могли бути створені помилково. Наприклад, за допомогою: git checkout -b $br $(git rev-parse …) , якщо «$br» виявився порожнім, то посилання з 40-символьним шістнадцятковим числом буде створене. Будь ласка, продивіться ці посилання й, можливо, вилучіть їх. Ви можете відімкнути це повідомлення запустивши «git config advice.objectNameWarning false»

source: Cannot change unmerged .gitmodules, resolve merge conflicts first
uk: Неможливо змінити незлитий .gitmodules, спочатку вирішіть конфлікти злиття

source: Could not find section in .gitmodules where path=%s
uk: Не вдалося знайти розділ в .gitmodules, де шлях дорівнює %s

source: Could not remove .gitmodules entry for %s
uk: Не вдалося вилучити запис в .gitmodules для %s

source: staging updated .gitmodules failed
uk: збій споряджання оновленого .gitmodules

source: in unpopulated submodule '%s'
uk: в порожньому підмодулі «%s»

source: Pathspec '%s' is in submodule '%.*s'
uk: Специфікація шляху «%s» у підмодулі «%.*s»

source: submodule entry '%s' (%s) is a %s, not a commit
uk: запис підмодуля «%s» (%s) є %s, а не коміт

source: Failed to resolve HEAD as a valid ref.
uk: Неможливо перепризначити HEAD як чинне посилання

source: '%s' not recognized as a git repository
uk: «%s» не розпізнаний як сховище git

source: could not start 'git status' in submodule '%s'
uk: неможливо запустити «git status» в підмодулі «%s»

source: could not run 'git status' in submodule '%s'
uk: неможливо виконати «git status» в підмодулі «%s»

source: submodule '%s' has dirty index
uk: підмодуль «%s» має змінений індекс

source: relocate_gitdir for submodule '%s' with more than one worktree not supported
uk: relocate_gitdir для підмодуля «%s» із зазначення понад одного робочого каталогу не підтримується

source: could not lookup name for submodule '%s'
uk: не вдалося запитати назву підмодуля «%s»

source: Migrating git directory of '%s%s' from '%s' to '%s'
uk: Переміщення каталогу git для «%s%s» из «%s» в «%s»

source: could not recurse into submodule '%s'
uk: неможливо рекурсивно зайти в підмодуль «%s»

source: could not start ls-files in ..
uk: неможливо виконати ls-files в ..

source: ls-tree returned unexpected return code %d
uk: ls-tree повернув несподіваний код %d

source: negative values not allowed for submodule.fetchjobs
uk: не дозволено використовувати від'ємні значення для submodule.fetchjobs

source: invalid value for %s
uk: неприпустиме значення %s

source: Could not update .gitmodules entry %s
uk: Неможливо оновити запис в .gitmodules %s

source: running trailer command '%s' failed
uk: збій запуску команди завершувача «%s»

source: unknown value '%s' for key '%s'
uk: невідоме значення «%s» для ключа «%s»

source: more than one %s
uk: більше одного %s

source: empty trailer token in trailer '%.*s'
uk: порожня остання лексема у завершувачі «%.*s»

source: could not read input file '%s'
uk: не вдалося прочитати вхідний файл «%s»

source: could not read from stdin
uk: не вдалося прочитати із стандартного вводу

source: could not stat %s
uk: не вдалося виконати stat для %s

source: file %s is not a regular file
uk: файл %s не є звичайним файлом

source: file %s is not writable by user
uk: файл %s недоступний для запису користувачем

source: could not open temporary file
uk: неможливо відкрити тимчасовий файл

source: could not rename temporary file to %s
uk: неможливо перейменувати тимчасовий файл в %s

source: Would set upstream of '%s' to '%s' of '%s'
uk: Буде налаштований upstream для «%s» на «%s» з «%s»

source: transport: invalid depth option '%s'
uk: транспорт: неприпустимий параметр глибини «%s»

source: The following submodule paths contain changes that can not be found on any remote:
uk: Підмодулі за вказаними шляхами містять зміни, які не знайдені на жодному з віддалених сховищ:

source: Please try git push --recurse-submodules=on-demand or cd to the path and use git push to push them to a remote.
uk: Спробуйте виконати git push --recurse-submodules=on-demand чи перейти за допомогою команди cd і виконати git push для передавання змін на віддалене сховище.

source: Aborting.
uk: Скасування.

source: too-short tree object
uk: закороткий об'єкт дерева

source: malformed mode in tree entry
uk: пошкоджений режим в записі дерева

source: empty filename in tree entry
uk: порожня назва файлу в записі дерева

source: too-short tree file
uk: закороткий файл дерева

source: Your local changes to the following files would be overwritten by checkout: %%sPlease commit your changes or stash them before you switch branches.
uk: Ваші локальні зміни в наступних файлах будуть перезаписані при переході: %%sСтворіть коміт ваших змін чи приховайте їх перед перемиканням гілок.

source: Your local changes to the following files would be overwritten by checkout: %%s
uk: Ваші локальні зміни в наступних файлах будуть перезаписані при переході: %%s

source: Your local changes to the following files would be overwritten by merge: %%sPlease commit your changes or stash them before you merge.
uk: Ваші локальні зміни в наступних файлах будуть перезаписані при злитті: %%sСтворіть коміт ваших змін чи приховайте їх перед злиттям гілок.

source: Your local changes to the following files would be overwritten by merge: %%s
uk: Ваші локальні зміни в наступних файлах будуть перезаписані при злитті: %%s

source: Your local changes to the following files would be overwritten by %s: %%sPlease commit your changes or stash them before you %s.
uk: Ваші локальні зміни в наступних файлах будуть перезаписані при процедурі %s: %%sЗробіть коміт ваших змін чи приховайте їх перед процедурою %s.

source: Your local changes to the following files would be overwritten by %s: %%s
uk: Ваші локальні зміни в наступних файлах будуть перезаписані при операції %s: %%s

source: Updating the following directories would lose untracked files in them: %s
uk: Оновлення таких каталогів приведе до втрати невідслідковуваних файлів в них: %s

source: The following untracked working tree files would be removed by checkout: %%sPlease move or remove them before you switch branches.
uk: Наступні невідслідковувані файли в робочому каталозі будуть вилучені при переході: %%sПеремістіть або вилучіть ці файли до перемикання гілок.

source: The following untracked working tree files would be removed by checkout: %%s
uk: Наступні невідслідковувані файли в робочому каталозі будуть вилучені при переході: %%s

source: The following untracked working tree files would be removed by merge: %%sPlease move or remove them before you merge.
uk: Наступні невідслідковувані файли в робочому каталозі будуть вилучені при злитті: %%sПеремістіть або вилучіть ці файли до злиття.

source: The following untracked working tree files would be removed by merge: %%s
uk: Наступні невідслідковувані файли в робочому каталозі будуть вилучені при злитті: %%s

source: The following untracked working tree files would be removed by %s: %%sPlease move or remove them before you %s.
uk: Наступні невідслідковувані файли в робочому каталозі будуть вилучені при процессі %s: %%sПеремістіть або вилучіть ці файли до процесу %s:

source: The following untracked working tree files would be removed by %s: %%s
uk: Наступні невідслідковувані файли в робочому каталозі будуть вилучені при процессі %s: %%s

source: The following untracked working tree files would be overwritten by checkout: %%sPlease move or remove them before you switch branches.
uk: Наступні невідслідковувані файли в робочому каталозі будуть перезаписані при переході: %%sПеремістіть або вилучіть ці файли до перемикання гілок:

source: The following untracked working tree files would be overwritten by checkout: %%s
uk: Наступні невідслідковувані файли в робочому каталозі будуть перезаписані при переході: %%s

source: The following untracked working tree files would be overwritten by merge: %%sPlease move or remove them before you merge.
uk: Наступні невідслідковувані файли в робочому каталозі будуть перезаписані при злитті: %%sПеремістіть або вилучіть ці файли до злиття:

source: The following untracked working tree files would be overwritten by merge: %%s
uk: Наступні невідслідковувані файли в робочому каталозі будуть перезаписані при злитті: %%s

source: The following untracked working tree files would be overwritten by %s: %%sPlease move or remove them before you %s.
uk: Наступні невідслідковувані файли в робочому каталозі будуть перезаписані при процессі %s: %%sПеремістіть або вилучіть ці файли до процесу %s:

source: The following untracked working tree files would be overwritten by %s: %%s
uk: Наступні невідслідковувані файли в робочому каталозі будуть перезаписані при процессі %s: %%s

source: Entry '%s' overlaps with '%s'. Cannot bind.
uk: Запис «%s» частково перетинається з «%s». Не вдалося призначити відповідність..

source: Cannot update sparse checkout: the following entries are not up to date: %s
uk: Неможливо оновити частковий перехід: наступні записи не останньої версії: %s

source: The following working tree files would be overwritten by sparse checkout update: %s
uk: Наступні файли в робочому каталозі будуть перезаписані при оновленні часткового переходу: %s

source: The following working tree files would be removed by sparse checkout update: %s
uk: Наступні файли в робочому каталозі будуть вилучені при оновленні часткового переходу: %s

source: Cannot update submodule: %s
uk: Неможливо оновити підмодуль: %s

source: Aborting
uk: Припинення

source: Checking out files
uk: Отримання файлів

source: invalid URL scheme name or missing '://' suffix
uk: Неприпустиме ім’я URL-схеми або пропущено суфікс «://»

source: invalid %XX escape sequence
uk: неприпустима екрануюча послідовність %XX

source: missing host and scheme is not 'file:'
uk: відсутнє ім’я сервера і схема доступу не «file:»

source: a 'file:' URL may not have a port number
uk: URL зі схемою «file:» не може містити номер порту

source: invalid characters in host name
uk: неприпустимі символи в імені сервера

source: invalid port number
uk: неприпустимий номер порта

source: invalid '..' path segment
uk: неприпустима частина шляху «..»

source: failed to read '%s'
uk: не вдалося прочитати «%s»

source: '%s' at main working tree is not the repository directory
uk: «%s» у основному робочому каталозі не є каталогом сховища

source: '%s' file does not contain absolute path to the working tree location
uk: файл «%s» не містить абсолютний шлях до робочого каталогу

source: '%s' does not exist
uk: «%s» не існує

source: '%s' is not a .git file, error code %d
uk: «%s» не є файлом.git, код помилки %d

source: '%s' does not point back to '%s'
uk: «%s» не вказує на «%s»

source: could not open '%s' for reading and writing
uk: неможливо відкрити «%s» для читання та запису

source: unable to access '%s'
uk: «%s» недоступно

source: unable to get current working directory
uk: неможливо отримати поточний робочий каталог

source: Unmerged paths:
uk: Незлиті шляхи:

source: (use "git reset %s <file>..." to unstage)
uk: (використовуйте "git reset %s <file>..." щоб прибрати з буфера)

source: (use "git rm --cached <file>..." to unstage)
uk: (використовуйте "git rm --cached <file>..." що прибрати з буфера)

source: (use "git add <file>..." to mark resolution)
uk: (використовуйте "git add <file>..." щоб позначити зміни)

source: (use "git add/rm <file>..." as appropriate to mark resolution)
uk: (використовуйте "git add/rm <file>..." щоб позначити відповідні зміни)

source: (use "git rm <file>..." to mark resolution)
uk: (використовуйте "git rm <file>..." щоб позначити зміни)

source: Changes to be committed:
uk: Зміни, що мають бути збережені в коміті

source: Changes not staged for commit:
uk: Зміни не споряджені для коміту

source: (use "git add <file>..." to update what will be committed)
uk: (використовуйте "git add <file>..." щоб оновити дані, котрі будуть збережені в коміті)

source: (use "git add/rm <file>..." to update what will be committed)
uk: (використовуйте «git add/rm <file>...» щоб оновити дані, котрі будуть збережені в коміті)

source: (use "git checkout -- <file>..." to discard changes in working directory)
uk: (використовуйте «git checkout -- <file>...» щоб скасувати зміни в робочому каталозі)

source: (commit or discard the untracked or modified content in submodules)
uk: (зробіть коміт або скасуйте невідстежуваний або змінений вміст у підмодулях)

source: (use "git %s <file>..." to include in what will be committed)
uk: (використовуйте «git %s <file>...» щоб долучити те, що повинно бути збережено в коміті)

source: both deleted:
uk: вилучено і там, і тут:

source: added by us:
uk: додано нами:

source: deleted by them:
uk: вилучено ними:

source: added by them:
uk: додано ними:

source: deleted by us:
uk: вилучено нами:

source: both added:
uk: додано і там, і тут:

source: both modified:
uk: обидві зміни:

source: new file:
uk: новий файл:

source: copied:
uk: скопійовано:

source: deleted:
uk: вилучено:

source: modified:
uk: змінено:

source: renamed:
uk: перейменовано:

source: typechange:
uk: змінено тип:

source: unknown:
uk: невідомо:

source: unmerged:
uk: незлиті:

source: new commits,
uk: нові коміти,

source: modified content,
uk: змінений вміст,

source: untracked content,
uk: невідстежуваний вміст,

source: Your stash currently has %d entry
uk: У вас наразі схований %d запис

source: Submodules changed but not updated:
uk: Змінені, але не оновлені підмодулі:

source: Submodule changes to be committed:
uk: Зміни у підмодулях, які будуть додані в коміт:

source: Do not modify or remove the line above. Everything below it will be ignored.
uk: Не змінюйте або вилучайте рядок вище цього.. Все, що нижче — буде проігноровано.

source: You have unmerged paths.
uk: В Вас є незлиті шляхи.

source: (fix conflicts and run "git commit")
uk: (виправте конфлікти і запустіть «git commit»)

source: (use "git merge --abort" to abort the merge)
uk: (використовуйте «git merge --abort», щоб зупинити злиття)

source: All conflicts fixed but you are still merging.
uk: Усі конфлікти виправлені, але Ви усе ще у процесі злиття.

source: (use "git commit" to conclude merge)
uk: (використовуйте «git commit», щоб завершити злиття)

source: You are in the middle of an am session.
uk: Ви у процесі сесії am.

source: The current patch is empty.
uk: Поточна латка порожня.

source: (fix conflicts and then run "git am --continue")
uk: (вирішіть конфлікти, потім запустіть «git am --continue»)

source: (use "git am --skip" to skip this patch)
uk: (використовуйте «git am --skip», щоб пропустити цю латку)

source: (use "git am --abort" to restore the original branch)
uk: (використовуйте «git am --abort», щоб відновити оригінальну гілку)

source: git-rebase-todo is missing.
uk: git-rebase-todo відсутній.

source: No commands done.
uk: Команди не виконані.

source: Last command done (%d command done):
uk: Остання команда виконана (%d команд виконано):

source: (see more in file %s)
uk: (дивіться додатково у файлі %s)

source: No commands remaining.
uk: Команд більше не залишилося.

source: Next command to do (%d remaining command):
uk: Наступна команда для виконання (%d команда залишилася):

source: (use "git rebase --edit-todo" to view and edit)
uk: (використовуйте «git rebase --edit-todo», щоб продивитися та змінити)

source: You are currently rebasing branch '%s' on '%s'.
uk: Наразі ви перебазовуєте гілку «%s» над «%s».

source: You are currently rebasing.
uk: Наразі ви перебазовуєте гілку.

source: (fix conflicts and then run "git rebase --continue")
uk: (виправте конфлікти і виконайте «git rebase --continue»)

source: (use "git rebase --skip" to skip this patch)
uk: (використовуйте «git rebase --skip», щоб пропустити цю латку)

source: (use "git rebase --abort" to check out the original branch)
uk: (використовуйте «git rebase --abort», щоб перейти на оригінальну гілку)

source: (all conflicts fixed: run "git rebase --continue")
uk: (усі конфлікти виправлено: виконайте «git rebase --continue»)

source: You are currently splitting a commit while rebasing branch '%s' on '%s'.
uk: Наразі ви розбиваєте коміт при перебазуванні гілки «%s» над «%s».

source: You are currently splitting a commit during a rebase.
uk: Наразі ви розбиваєте коміт при перебазуванні гілки.

source: (Once your working directory is clean, run "git rebase --continue")
uk: (Як тільки Ваш робочий каталог буде чистий, запустіть «git rebase --continue»)

source: You are currently editing a commit while rebasing branch '%s' on '%s'.
uk: Наразі ви редагуєте коміт при перебазуванні гілки «%s» над «%s».

source: You are currently editing a commit during a rebase.
uk: Наразі ви редагуєте коміт при перебазуванні гілки.

source: (use "git commit --amend" to amend the current commit)
uk: (використовуйте «git commit --amend», щоб виправити поточний комміт)

source: (use "git rebase --continue" once you are satisfied with your changes)
uk: (використовуйте «git rebase --continue», коли будете задоволені змінами)

source: You are currently cherry-picking commit %s.
uk: Ви наразі висмикуєте коміт %s.

source: (fix conflicts and run "git cherry-pick --continue")
uk: (вирішіть конфлікти, потім запустіть «git cherry-pick --continue»)

source: (all conflicts fixed: run "git cherry-pick --continue")
uk: (усі конфлікти вирішені: запустіть «git cherry-pick --continue»)

source: (use "git cherry-pick --abort" to cancel the cherry-pick operation)
uk: (використовуйте «git cherry-pick --abort», щоб скасувати операцію висмикування)

source: You are currently reverting commit %s.
uk: Ви зараз вивертаєте коміт %s.

source: (fix conflicts and run "git revert --continue")
uk: (вирішіть конфликти, потім запустіть «git revert --continue»)

source: (all conflicts fixed: run "git revert --continue")
uk: (усі конфлікти вирішені: запустіть «git revert --continue»)

source: (use "git revert --abort" to cancel the revert operation)
uk: (використовуйте «git revert --abort», щоб скасувати операцію вивертання)

source: You are currently bisecting, started from branch '%s'.
uk: Ви зараз у процесі двійкового пошуку, початого з гілки «%s».

source: You are currently bisecting.
uk: Наразі ви у процесі двійкового пошуку.

source: (use "git bisect reset" to get back to the original branch)
uk: (використовуйте «git bisect reset» щоб повернутися до оригінальної гілки)

source: On branch
uk: На гілці

source: interactive rebase in progress; onto
uk: Інтерактивне перебазування у процесі; над

source: rebase in progress; onto
uk: перебазування у процесі; над

source: HEAD detached at
uk: HEAD відокремлений на

source: HEAD detached from
uk: HEAD відокремлений починаючи з

source: Not currently on any branch.
uk: Зараз на жодній з гілок

source: Initial commit
uk: Початковий коміт

source: No commits yet
uk: Ще немає комітів

source: Untracked files
uk: Невідстежувані файли

source: Ignored files
uk: Ігноровані файли
