Repository: PlagaMedicum/Ubuntu-Translation-Demo
Catalog: rosetta-eoan/*/LC_MESSAGES/git.po
Languages: uk

source: deepen history of shallow repository based on time
uk: поглибити історію часткового клону, заснованого на часі

source: convert to a complete repository
uk: перетворити на повне сховище

source: prepend this to submodule path output
uk: приєднувати це спереду до виводу шляхів підмодулю

source: default for recursive fetching of submodules (lower priority than config files)
uk: налаштувати за замовчуванням рекурсивне здобування подмодулей (нижчий пріоритет, ніж файли конфігурації)

source: accept refs that update .git/shallow
uk: приймати посилання, які оновлюють .git/shallow

source: refmap
uk: відповідність-посилань

source: specify fetch refmap
uk: вказати відповідність посилань при здобуванні

source: server-specific
uk: залежить-від-сервера

source: option to transmit
uk: передавані параметри

source: Couldn't find remote ref HEAD
uk: Не вдалося знайти посилання HEAD на віддалене сховище

source: configuration fetch.output contains invalid value %s
uk: конфігурація fetch.output містить невірне значення для %s

source: object %s not found
uk: не знайдено об’єкта %s

source: [up to date]
uk: [актуально]

source: [rejected]
uk: [відкинуто]

source: can't fetch in current branch
uk: неможливо видобути зміни в поточну гілку

source: [tag update]
uk: [оновлення мітки]

source: unable to update local ref
uk: не вдалося оновити локальне посилання

source: [new tag]
uk: [нова мітка]

source: [new branch]
uk: [нова гілка]

source: [new ref]
uk: [нове посилання]

source: forced update
uk: примусове оновлення

source: non-fast-forward
uk: без перемотування

source: %s did not send all necessary objects
uk: %s не відправив усі необхідні об’єкти

source: reject %s because shallow roots are not allowed to be updated
uk: %s відхилено оскільки часткове коріння не дозволено оновлювати

source: From %.*s
uk: З %.*s

source: some local refs could not be updated; try running 'git remote prune %s' to remove any old, conflicting branches
uk: не вдалося оновити деякі локальні посилання; спробуйте запустити «git remote prune %s», щоб почистити старі, конфліктуючі гілки

source: (%s will become dangling)
uk: (%s буде висячою гілкою)

source: (%s has become dangling)
uk: (%s стала висячою гілкою)

source: [deleted]
uk: [вилучено]

source: (none)
uk: (нічого)

source: Refusing to fetch into current branch %s of non-bare repository
uk: Відмова отримання у поточну гілку %s неголого сховища

source: Option "%s" value "%s" is not valid for %s
uk: Неправильне значення «%2$s» для параметру «%1$s» для %3$s

source: Option "%s" is ignored for %s
uk: Параметр «%s» нехтується для %s

source: Fetching %s
uk: Отримуємо %s

source: Could not fetch %s
uk: Не вдалося здобути зміни %s

source: --filter can only be used with the remote configured in core.partialClone
uk: --filter може бути використане з налаштованим віддаленим сховищенм у core.partialClone

source: No remote repository specified. Please, specify either a URL or a remote name from which new revisions should be fetched.
uk: Не вказане віддалене сховище. Вкажіть URL або ім’я віддаленого сховища з якого повинні здобуватися зміни нових редакцій.

source: You need to specify a tag name.
uk: Вам потрібно вказати ім’я мітки.

source: Negative depth in --deepen is not supported
uk: Негативна глибина для --deepen не підтримується

source: --deepen and --depth are mutually exclusive
uk: --deepen та --depth неможливо використовувати одночасно

source: --depth and --unshallow cannot be used together
uk: неможливо використовувати одночасно --depth та --unshallow

source: --unshallow on a complete repository does not make sense
uk: --unshallow немає сенсу на повному сховищі

source: fetch --all does not take a repository argument
uk: fetch --all не приймає назву сховища як аргумент

source: fetch --all does not make sense with refspecs
uk: fetch --all не має сенсу при вказуванні специфікацій посилань

source: No such remote or remote group: %s
uk: Немає такого віддаленого сховища або групи: %s

source: Fetching a group and specifying refspecs does not make sense
uk: Отримання групи та зазначення специфікацій посилань не має сенсу

source: git fmt-merge-msg [-m <message>] [--log[=<n>] | --no-log] [--file <file>]
uk: git fmt-merge-msg [-m <повідомлення>] [--log[=<n>] | --no-log] [--file <файл>]

source: populate log with at most <n> entries from shortlog
uk: відправити у журнал <n> записів із короткого журналу

source: alias for --log (deprecated)
uk: скорочення для --log (застаріле)

source: text
uk: текст

source: use <text> as start of message
uk: використовувати <текст> як початкове повідомлення

source: file to read from
uk: файл для читання

source: git for-each-ref [<options>] [<pattern>]
uk: git for-each-ref [<опції>] [<шаблон>]

source: git for-each-ref [--points-at <object>]
uk: git for-each-ref [--points-at <об’єкт>]

source: git for-each-ref [(--merged | --no-merged) [<commit>]]
uk: git for-each-ref [(--merged | --no-merged) [<коміт>]]

source: git for-each-ref [--contains [<commit>]] [--no-contains [<commit>]]
uk: git for-each-ref [--contains [<коміт>]] [--no-contains [<коміт>]]

source: quote placeholders suitably for shells
uk: виводити вказівники місця заповнення у відповідному форматі для командного процесора

source: quote placeholders suitably for perl
uk: виводити вказівники місця заповнення у відповідному форматі для perl

source: quote placeholders suitably for python
uk: виводити вказівники місця заповнення у відповідному форматі для python

source: quote placeholders suitably for Tcl
uk: виводити вказівники місця заповнення у відповідному форматі для Tcl

source: show only <n> matched refs
uk: показати лише <n> посилань, що збігаються

source: respect format colors
uk: використовувати кольори з формату

source: print only refs which points at the given object
uk: вивід лише посилань, які вказують на переданий об’єкт

source: print only refs that are merged
uk: вивід лише злитих посилань

source: print only refs that are not merged
uk: вивід лише незлитих посилань

source: print only refs which contain the commit
uk: вивід лише посилань, які містять коміт

source: print only refs which don't contain the commit
uk: виведення лише посилань, які не містять коміт

source: Checking object directories
uk: Перевірка каталогів об’єктів

source: git fsck [<options>] [<object>...]
uk: git fsck [<опції>] [<об’єкт>…]

source: show unreachable objects
uk: показати недоступні об’єкти

source: show dangling objects
uk: показати об’єкти, на які немає посилань

source: report tags
uk: вивести звіт по міткам

source: report root nodes
uk: вивести звіт по кореневим вузлам

source: make index objects head nodes
uk: сприймати об’єкти у індексі як кореневі вузли

source: make reflogs head nodes (default)
uk: створити кореневі вузли журналів посилань (типово)

source: also consider packs and alternate objects
uk: також перевіряти паки та альтернативні об’єкти

source: check only connectivity
uk: лише перевірити з’єднання

source: enable more strict checking
uk: використовувати суворішу перевірку

source: write dangling objects in .git/lost-found
uk: записати об’єкти, на які немає посилань в .git/lost-found

source: show progress
uk: показати поступ

source: show verbose names for reachable objects
uk: показати докладні назви для недоступних об'єктів

source: Checking objects
uk: Перевірка об’єктів

source: git gc [<options>]
uk: git gc [<опції>]

source: Failed to fstat %s: %s
uk: Не вдалося виконати fstat %s: %s

source: cannot stat '%s'
uk: не вдалося отримати дані щодо «%s»

source: cannot read '%s'
uk: не вдалося прочитати «%s»

source: The last gc run reported the following. Please correct the root cause and remove %s. Automatic cleanup will not be performed until the file is removed. %s
uk: Останній запуск gc повідомив таке. Будь ласка, виправте помилку та вилучіть %s. Автоматична очистка сховища не буде робитися, доки цей файл не вилучений. %s

source: prune unreferenced objects
uk: почистити об’єкти, на які немає посилань

source: be more thorough (increased runtime)
uk: перевіряти уважніше (займає більше часу)

source: enable auto-gc mode
uk: увімкнути режим auto-gc

source: force running gc even if there may be another gc running
uk: примусово запустити gc, навіть є інша копія gc вже запущена

source: Auto packing the repository in background for optimum performance.
uk: Автоматичне запакування сховища у тлі, для оптимальної швидкодії.

source: Auto packing the repository for optimum performance.
uk: Автоматичне запакування сховища, для оптимальної швидкодії.

source: See "git help gc" for manual housekeeping.
uk: Дивіться «git help gc» посібника з ручного очищування.

source: gc is already running on machine '%s' pid %<PRIuMAX> (use --force if not)
uk: gc вже запущений на цьому комп’ютері «%s» pid %<PRIuMAX> (якщо ні, використовуйте --force)

source: There are too many unreachable loose objects; run 'git prune' to remove them.
uk: Є забагато об’єктів, на які немає посилань; запустіть «git prune» для їх вилучення.

source: git grep [<options>] [-e] <pattern> [<rev>...] [[--] <path>...]
uk: git grep [<опції>] [-e] <шаблон> [<редакція>…] [[--] <шлях>…]

source: grep: failed to create thread: %s
uk: grep: збій створення потоку: %s

source: invalid number of threads specified (%d) for %s
uk: зазначено неприпустиму кількість потоків (%d) для %s

source: no threads support, ignoring %s
uk: немає підтримки потоків, нехтування %s

source: unable to read tree (%s)
uk: не вдалося прочитати дерево (%s)

source: unable to grep from object of type %s
uk: не вдалося виконати grep із об’єкту типу %s

source: switch `%c' expects a numerical value
uk: параметр «%c» очікує числове значення

source: search in index instead of in the work tree
uk: шукати в індексі, а не у робочому каталозі

source: find in contents not managed by git
uk: шукати у вмісті, що є не керованим git

source: search in both tracked and untracked files
uk: шукати і у відстежуваних, і у невідстежуваних файлах

source: ignore files specified via '.gitignore'
uk: нехтувати файли вказані у «.gitignore»

source: recursively search in each submodule
uk: рекурсивний пошук по всім підмодулям

source: show non-matching lines
uk: шукати у рядках які не збігаються

source: case insensitive matching
uk: без врахування регістру

source: match patterns only at word boundaries
uk: шукати збіги шаблону лише на межах слів

source: process binary files as text
uk: опрацювання двійкових файлів як тексту

source: don't match patterns in binary files
uk: не шукати збіги шаблону у двійкових файлах

source: process binary files with textconv filters
uk: опрацьовувати двійкові файли за допомогою фільтрів textconv

source: descend at most <depth> levels
uk: на глибині максимум <глибина> рівнів

source: use extended POSIX regular expressions
uk: використовувати розширені регулярні вирази POSIX

source: use basic POSIX regular expressions (default)
uk: використовувати базові регулярні вирази POSIX (типово)

source: interpret patterns as fixed strings
uk: інтерпретувати шаблони як фіксовані рядки

source: use Perl-compatible regular expressions
uk: використовувати формальні вирази, сумісні з Perl

source: show line numbers
uk: показувати номери рядків

source: don't show filenames
uk: не виводити імена файлів

source: show filenames
uk: виводити імена файлів

source: show filenames relative to top directory
uk: виводити імена файлів відносно вехнього каталогу

source: show only filenames instead of matching lines
uk: виводити лише імена файлів, а не рядки, що збігаються

source: synonym for --files-with-matches
uk: синонім для --files-with-matches

source: show only the names of files without match
uk: виводити лише імена файлів, що не збігаються

source: print NUL after filenames
uk: виводити двійковий НУЛЬ після переліку імен файлів

source: show the number of matches instead of matching lines
uk: виводити кількість збігів, а не рядки, що збігаються

source: highlight matches
uk: позначення відповідників

source: print empty line between matches from different files
uk: виводити порожній рядок після збігів із різних файлів

source: show filename only once above matches from same file
uk: виводити ім’я файлу лише раз на декілька збігів у одному файлі

source: show <n> context lines before and after matches
uk: показати <n> рядків контексту перед та після збігу

source: show <n> context lines before matches
uk: показати <n> рядків контексту перед збігом

source: show <n> context lines after matches
uk: показати <n> рядків контексту після збігу

source: use <n> worker threads
uk: використовувати <n> робочих потоків

source: shortcut for -C NUM
uk: те саме, що й -C КІЛЬКІСТЬ

source: show a line with the function name before matches
uk: показати рядок з іменем функції перед збігом

source: show the surrounding function
uk: показати оточуючу функцію

source: read patterns from file
uk: прочитати шаблони з файлу

source: match <pattern>
uk: пошук відповідників згідно <взірець>

source: combine patterns specified with -e
uk: об’єднати шаблони вказані за допомогою -e

source: indicate hit with exit status without output
uk: нічого не виводити, вказати на збіг за допомогою коду виходу

source: show only matches from files that match all patterns
uk: показати лише збіги із файлів у яких збігаються усі шаблони

source: show parse tree for grep expression
uk: показати дерево розбору для виразу пошуку

source: pager
uk: пейджер

source: show matching files in the pager
uk: показувати файли, що порівнюються у вказаному пейджері

source: allow calling of grep(1) (ignored by this build)
uk: дозволити виклик grep(1) (нехтується у цій збірці)

source: --no-index or --untracked cannot be used with revs
uk: --no-index або --untracked неможливо використовувати одночасно із зазначанням редакцій

source: unable to resolve revision: %s
uk: не вдалося визначити редакцію: %s

source: no threads support, ignoring --threads
uk: немає підтримки потоків, ігнорування --threads

source: invalid number of threads specified (%d)
uk: вказано неправильну кількість потоків (%d)

source: --open-files-in-pager only works on the worktree
uk: --open-files-in-pager працює лише у робочому каталозі

source: git hash-object [-t <type>] [-w] [--path=<file> | --no-filters] [--stdin] [--] <file>...
uk: git hash-object [-t <тип>] [-w] [--path=<файл> | --no-filters] [--stdin] [--] <файл>…

source: type
uk: тип

source: object type
uk: тип об’єкта

source: write the object into the object database
uk: запис об’єкту у базу даних об’єктів

source: read the object from stdin
uk: прочитати об’єкт із стандартного вводу

source: store file as is without filters
uk: зберегти файл без використовування фільтрів

source: just hash any random garbage to create corrupt objects for debugging Git
uk: хешувати будь-яке сміття й створювати пошкоджені об’єкти для налагодження Git

source: process file as it were from this path
uk: опрацювати файл так, ніби він знаходиться за вказаним шляхом

source: print all available commands
uk: вивести перелік усіх доступних команд

source: exclude guides
uk: вилучити керівництва

source: print list of useful guides
uk: вивести перелік корисних керівництв

source: show man page
uk: відкрити керівництво у форматі man

source: show manual in web browser
uk: відкрити керівництво у оглядачі тенет

source: show info page
uk: відкрити керівництво у форматі info

source: git help [--all] [--guides] [--man | --web | --info] [<command>]
uk: git help [--all] [--guides] [--man | --web | --info] [<команда>]

source: unrecognized help format '%s'
uk: нерозпізнаний формат керівництва «%s»

source: Failed to start emacsclient.
uk: Збій при запуску emacsclient.

source: Failed to parse emacsclient version.
uk: Збій при визначенні версії emacsclient.

source: emacsclient version '%d' too old (< 22).
uk: версія emacsclient «%d» застара (< 22).

source: failed to exec '%s'
uk: збій запуску «%s»

source: '%s': path for unsupported man viewer. Please consider using 'man.<tool>.cmd' instead.
uk: «%s»: шлях для непідтримуваної проґрами перегляду man. Замість цього використовуйте «man.<проґрама>.cmd».

source: '%s': cmd for supported man viewer. Please consider using 'man.<tool>.path' instead.
uk: «%s»: команда для непідтримуваної проґрами перегляду man. Замість цього використовуйте «man.<проґрама>.path».

source: '%s': unknown man viewer.
uk: «%s»: невідома проґрама перегляду man.

source: no man viewer handled the request
uk: проґрама перегляду man не опрацювала запит

source: no info viewer handled the request
uk: проґрама перегляду info не опрацювала запит

source: '%s' is aliased to '%s'
uk: «%s» — це синонім для «%s»

source: usage: %s%s
uk: використання: %s%s

source: object type mismatch at %s
uk: невідповідність типу об’єкту на %s

source: did not receive expected object %s
uk: очікуваний об’єкт не отриманий на %s

source: object %s: expected type %s, found %s
uk: об’єкт %s: очікуваний тип %s, отриманий %s

source: cannot fill %d byte
uk: не вдалося заповнити %d байт

source: early EOF
uk: несподіваний кінець файлу

source: read error on input
uk: помилка читання вводу

source: used more bytes than were available
uk: використано більше байтів, ніж було доступно

source: pack too large for current definition of off_t
uk: пака завеликий для поточного визначення off_t

source: pack exceeds maximum allowed size
uk: розмір паки перевищує максимально дозволений

source: unable to create '%s'
uk: не вдалося створити «%s»

source: cannot open packfile '%s'
uk: не вдалося відкрити файл пакунку «%s»

source: pack signature mismatch
uk: невідповідність підпису паки

source: pack version %<PRIu32> unsupported
uk: версія паки %<PRIu32> не підтримується

source: pack has bad object at offset %<PRIuMAX>: %s
uk: пака містить поганий об'єкт за зміщенням %<PRIuMAX>: %s

source: inflate returned %d
uk: проґрама стискання повернула %d

source: offset value overflow for delta base object
uk: переповнення значення зміщення у базового об’єкту дельти

source: delta base offset is out of bound
uk: зміщення базової дельти вийшло за припустимі межі

source: unknown object type %d
uk: невідомий тип об’єкту %d

source: cannot pread pack file
uk: не вдалося виконати pread для файлу паки

source: premature end of pack file, %<PRIuMAX> byte missing
uk: передчасне закінчення файлу пакунку, %<PRIuMAX> байт відсутній

source: serious inflate inconsistency
uk: серйозна невідповідність при розпакуванні

source: SHA1 COLLISION FOUND WITH %s !
uk: ЗНАЙДЕНА КОЛІЗІЯ SHA1 З %s !

source: unable to read %s
uk: не вдалося прочитати %s

source: cannot read existing object info %s
uk: неможливо прочитати відомості про наявний об'єкт %s

source: cannot read existing object %s
uk: не вдалося прочитати існуючий об’єкт %s

source: invalid blob object %s
uk: неправильний файл двійкового об’єкту %s

source: invalid %s
uk: неправильний %s

source: Not all child objects of %s are reachable
uk: Не усі дочірні об’єкти %s досяжні

source: failed to apply delta
uk: збій при застосуванні дельти

source: Receiving objects
uk: Отримання об’єктів

source: Indexing objects
uk: Індексування об’єктів

source: pack is corrupted (SHA1 mismatch)
uk: пака пошкоджена (невідповідність SHA1)

source: cannot fstat packfile
uk: не вдалося виконати fstat для файлу пакунку

source: pack has junk at the end
uk: файл паки містить сміття у кінці

source: confusion beyond insanity in parse_pack_objects()
uk: божевільна плутанина в parse_pack_objects()

source: Resolving deltas
uk: Обробка відмінностей

source: unable to create thread: %s
uk: не вдалося створити потік: %s

source: confusion beyond insanity
uk: божевільна плутанина

source: completed with %d local object
uk: завершено з %d локальним об'єктом

source: Unexpected tail checksum for %s (disk corruption?)
uk: Неочікувана контрольна сума у кінці %s (диск пошкоджений?)

source: pack has %d unresolved delta
uk: пака містить %d невирішену дельту

source: unable to deflate appended object (%d)
uk: неможливо стиснути приєднаний об'єкт (%d)

source: local object %s is corrupt
uk: локальний об’єкт %s пошкоджений

source: packfile name '%s' does not end with '.pack'
uk: ім’я пакунку «%s» не закінчується на «.pack»

source: cannot write %s file '%s'
uk: неможливо записати файл %s «%s»

source: cannot close written %s file '%s'
uk: неможливо закрити записаний файл %s «%s»

source: error while closing pack file
uk: помилка при закритті файлу паки

source: cannot store pack file
uk: неможливо зберегти файл паки

source: cannot store index file
uk: неможливо зберегти файл індексу

source: bad pack.indexversion=%<PRIu32>
uk: поганий pack.indexversion=%<PRIu32>

source: Cannot open existing pack file '%s'
uk: Не вдалося відкрити існуючий файл паки «%s»

source: Cannot open existing pack idx file for '%s'
uk: Не вдалося відкрити існуючий файл індексу паки для «%s»

source: non delta: %d object
uk: не дельти: %d об’єкт

source: chain length = %d: %lu object
uk: довжина ланцюжка = %d: %lu об’єкт

source: Cannot come back to cwd
uk: Неможливо повернутися у поточний робочий каталог

source: bad %s
uk: поганий %s

source: --fix-thin cannot be used without --stdin
uk: --fix-thin неможливо використовувати без --stdin

source: --stdin requires a git repository
uk: опція --stdin вимагає наявності сховища git

source: --verify with no packfile name given
uk: --verify без зазначення імені файлу пакунку

source: cannot stat template '%s'
uk: не вдалося виконати stat для шаблону «%s»

source: cannot opendir '%s'
uk: не вдалося відкрити каталог «%s»

source: cannot readlink '%s'
uk: не вдалося виконати readlink для «%s»

source: cannot symlink '%s' '%s'
uk: не вдалося створити символьне посилання «%s» на «%s»

source: cannot copy '%s' to '%s'
uk: не вдалося скопіювати файл «%s» в «%s»

source: ignoring template %s
uk: нехтування шаблону %s

source: not copying templates from '%s': %s
uk: не копіюю шаблони з «%s»: %s

source: unable to handle file type %d
uk: не вдається опрацювати файл типу %d

source: unable to move %s to %s
uk: не вдається перемістити файл %s в %s

source: %s already exists
uk: %s вже існує

source: Reinitialized existing shared Git repository in %s%s
uk: Переініціалізоване наявне спільне сховище Git в %s%s

source: Reinitialized existing Git repository in %s%s
uk: Переініціалізоване наявне сховище Git в %s%s

source: Initialized empty shared Git repository in %s%s
uk: Ініціалізоване порожнє спільне сховище Git в %s%s

source: Initialized empty Git repository in %s%s
uk: Переініціалізоване наявне спільне сховище Git в %s%s

source: git init [-q | --quiet] [--bare] [--template=<template-directory>] [--shared[=<permissions>]] [<directory>]
uk: git init [-q | --quiet] [--bare] [--template=<каталог-шаблонів>] [--shared[=<права-доступу>]] [<каталог>]

source: permissions
uk: права доступу

source: specify that the git repository is to be shared amongst several users
uk: вкажіть, якщо сховище git буде використовуватися декількома користувачами

source: cannot mkdir %s
uk: не вдалося виконати mkdir %s

source: cannot chdir to %s
uk: не вдалося перейти до каталогу %s

source: %s (or --work-tree=<directory>) not allowed without specifying %s (or --git-dir=<directory>)
uk: %s (або --work-tree=<каталог>) неможливо використовувати без зазначення %s (або --git-dir=<каталог>)

source: Cannot access work tree '%s'
uk: Не вдалося отримати доступ до робочого каталогу «%s»

source: git interpret-trailers [--in-place] [--trim-empty] [(--trailer <token>[(=|:)<value>])...] [<file>...]
uk: git interpret-trailers [--in-place] [--trim-empty] [(--trailer <ключ>[(=|:)<значення>])…] [<файл>…]

source: edit files in place
uk: редагувати файли на місці

source: trim empty trailers
uk: вилучати порожні завершувачі

source: where to place the new trailer
uk: де помістити новий завершувач

source: action if trailer already exists
uk: дія, якщо завершувач вже існує
