Repository: PlagaMedicum/Ubuntu-Translation-Demo
Catalog: rosetta-eoan/*/LC_MESSAGES/git.po
Languages: uk

source: It took %.2f seconds to enumerate untracked files. 'status -uno' may speed it up, but you have to be careful not to forget to add new files yourself (see 'git help status').
uk: %.2f секунди зайняв вивід переліку невідстежуваних файлів. «status -uno» можливо може пришвидшити це, але будьте уважні, й не забудьте додати нові файли вручну (дивіться «git help status» для подробиць).

source: Untracked files not listed%s
uk: Невідстежувані файли не перелічені%s

source: (use -u option to show untracked files)
uk: (використовуйте -u щоб показати невідстежувані файли)

source: No changes
uk: Немає змін

source: no changes added to commit (use "git add" and/or "git commit -a")
uk: жодних зміни у коміт не додано (використовуйте «git add» та/або «git commit -a»)

source: no changes added to commit
uk: немає змін, доданих у коміт

source: nothing added to commit but untracked files present (use "git add" to track)
uk: немає змін, доданих у коміт, але існують невідстежувані файли (використовуйте «git add» щоб додати файли для відстежування)

source: nothing added to commit but untracked files present
uk: немає змін, доданих у коміт, але існують невідстежувані файли

source: nothing to commit (create/copy files and use "git add" to track)
uk: немає чого додати в коміт (створіть/копіюйте файли і використовуйте «git add» щоб відстежувати їх)

source: nothing to commit
uk: немає чого додати в коміт

source: nothing to commit (use -u to show untracked files)
uk: немає чого додати в коміт (використовуйте -u щоб показати невідстежувані файли)

source: nothing to commit, working tree clean
uk: немає чого додати в коміт, немає змін в робочому каталозі

source: No commits yet on
uk: Ще немає комітів в

source: HEAD (no branch)
uk: HEAD (не є гілкою)

source: different
uk: різний

source: behind
uk: позаду

source: ahead
uk: попереду

source: cannot %s: You have unstaged changes.
uk: неможливо виконати %s: У вас є неспоряджені зміни.

source: additionally, your index contains uncommitted changes.
uk: до того ж, у вашому індексі є незбережені в коміті зміни.

source: cannot %s: Your index contains uncommitted changes.
uk: неможливо виконати %s: У вашому індексі є незбережені в коміті зміни.

source: git add [<options>] [--] <pathspec>...
uk: git add [<опції>] [--] <специфікація-шляху>…

source: unexpected diff status %c
uk: несподіваний статус різниці %c

source: updating files failed
uk: оновлення фалів не вдалося

source: remove '%s'
uk: вилучити «%s»

source: Unstaged changes after refreshing the index:
uk: Неспоряджені зміни після оновлення індексу:

source: Could not read the index
uk: Неможливо прочитати індекс

source: Could not open '%s' for writing.
uk: Неможливо відкрити «%s» для запису.

source: Could not write patch
uk: Неможливо записати латку

source: editing patch failed
uk: збій при редагуванні латки

source: Could not stat '%s'
uk: Неможливо отримати дані щодо «%s»

source: Empty patch. Aborted.
uk: Порожня латка. Скасовано.

source: Could not apply '%s'
uk: Неможливо застосувати «%s»

source: The following paths are ignored by one of your .gitignore files:
uk: Такі шляхи ігноруються одним з ваших файлів .gitignore:

source: dry run
uk: тестовий запуск

source: interactive picking
uk: Інтерактивний вибір

source: select hunks interactively
uk: вибрати частини інтерактивно

source: edit current diff and apply
uk: редагувати поточну різницю і потім підтвердити

source: allow adding otherwise ignored files
uk: дозволити додавання нехтуваних інакше файлів

source: update tracked files
uk: оновити відстежувані файли

source: renormalize EOL of tracked files (implies -u)
uk: перенормалізувати кінці рядків (EOL) відслідковуваних файлів (має на увазі -u)

source: record only the fact that the path will be added later
uk: запис свідчить про те, що шлях буде додано пізніше

source: add changes from all tracked and untracked files
uk: усі зміни з відстежуваних і невідстежуваних файлів

source: ignore paths removed in the working tree (same as --no-all)
uk: нехтувати шляхи вилучені з робочого каталогу (те саме, що й --no-all)

source: don't add, only refresh the index
uk: не додавати, лише оновити індекс

source: just skip files which cannot be added because of errors
uk: просто пропустити файли, які неможливо додати через помилки

source: check if - even missing - files are ignored in dry run
uk: переконатися, що навіть відсутні файли будуть знехтувані при пробному запуску

source: override the executable bit of the listed files
uk: перевизначити біт виконання на вказаних файлах

source: warn when adding an embedded repository
uk: попереджати при додаванні вбудованого сховища git

source: You've added another git repository inside your current repository. Clones of the outer repository will not contain the contents of the embedded repository and will not know how to obtain it. If you meant to add a submodule, use: git submodule add <url> %s If you added this path by mistake, you can remove it from the index with: git rm --cached %s See "git help submodule" for more information.
uk: Вы додали інше сховище git до поточного сховища Клони зовнішнього сховища не будуть містити внутрішнє сховище і не будуть знати, як його отримати. Якщо ви бажали додати підмодуль: git submodule add <url> %s Якщо ви додали цей шлях помилково, то ви можете видалити його з індексу за допомогою: git rm --cached %s Додаткові відомості див. «git help submodule».

source: adding embedded git repository: %s
uk: додавання вбудованого сховища git: %s

source: Use -f if you really want to add them.
uk: Використовуйте -f, якщо ви справді бажаєте додати їх.

source: adding files failed
uk: додавання файлів не вдалося

source: -A and -u are mutually incompatible
uk: -A і -u взаємно несумісні

source: Option --ignore-missing can only be used together with --dry-run
uk: Опцію --ignore-missing можна використовувати лише разом з --dry-run

source: --chmod param '%s' must be either -x or +x
uk: параметр --chmod «%s» має бути з -x або +x

source: Nothing specified, nothing added.
uk: Нічого не вказано, нічого не додано.

source: Maybe you wanted to say 'git add .'?
uk: Можливо, ви бажали набрати «git add .»?

source: could not parse author script
uk: не вдалося розібрати сценарій авторства

source: '%s' was deleted by the applypatch-msg hook
uk: «%s» був вилучений перехоплювачем applypatch-msg

source: Malformed input line: '%s'.
uk: Спотворений рядок введення: «%s».

source: Failed to copy notes from '%s' to '%s'
uk: Не вдалося скопіювати примітку з «%s» в «%s»

source: fseek failed
uk: збій при виконанні fseek

source: could not parse patch '%s'
uk: неможливо розібрати латку «%s»

source: Only one StGIT patch series can be applied at once
uk: Лише серія латок StGIT може бути застосована за раз

source: invalid timestamp
uk: неприпустима мітка дати/часу

source: invalid Date line
uk: неприпустимий рядок дати

source: invalid timezone offset
uk: неприпустиме зміщення часового пояса

source: Patch format detection failed.
uk: Збій визначення формату латки.

source: failed to create directory '%s'
uk: не вдалося створити каталог «%s»

source: Failed to split patches.
uk: Не вдалося розділити латку на частини.

source: unable to write index file
uk: не вдалося записати індекс

source: When you have resolved this problem, run "%s --continue".
uk: Коли ви усунете цю проблему, запустіть «%s --continue».

source: If you prefer to skip this patch, run "%s --skip" instead.
uk: Якщо ви бажаєте пропустити цю латку, то запустіть «%s --skip».

source: To restore the original branch and stop patching, run "%s --abort".
uk: Щоб повернутися на попередню гілку й зупинити застосування змін, запустіть «%s --abort».

source: Patch is empty.
uk: Латка порожня

source: invalid ident line: %.*s
uk: неприпустимий рядок ідентифікації: %.*s

source: unable to parse commit %s
uk: неможливо розібрати коміт %s

source: Repository lacks necessary blobs to fall back on 3-way merge.
uk: У сховищі відсутні двійкові об’єкти, необхідні для відкату до триходового злиття.

source: Using index info to reconstruct a base tree...
uk: Використовую індекс для реконструкції базового дерева…

source: Did you hand edit your patch? It does not apply to blobs recorded in its index.
uk: Ви вручну змінювали латку? Вона не застосовується без помилок на двійкові об’єкти, записані у його заголовку.

source: Falling back to patching base and 3-way merge...
uk: Відкат до застосування змін до базового коміту за допомогою триходового злиття…

source: Failed to merge in the changes.
uk: Не вдалося злити зміни.

source: applying to an empty history
uk: застосування до порожньої історії

source: cannot resume: %s does not exist.
uk: немжливо продовжити: %s не існує

source: cannot be interactive without stdin connected to a terminal.
uk: не вдалося використати інтерактивну поведінку, без stdin під’єднаного до терміналу.

source: Commit Body is:
uk: Тіло коміту:

source: Apply? [y]es/[n]o/[e]dit/[v]iew patch/[a]ccept all:
uk: Застосувати? [y] - так/[n] - ні/[e] - редагувати/[v] - продивитися латку/[a] - застосувати усе:

source: Dirty index: cannot apply patches (dirty: %s)
uk: Індекс непорожній: неможливо застосовувати латки (в індексі: %s)

source: Applying: %.*s
uk: Застосування: %.*s

source: No changes -- Patch already applied.
uk: Немає змін — Латка вже застосована.

source: Patch failed at %s %.*s
uk: Помилка застосування латки на %s %.*s

source: Use 'git am --show-current-patch' to see the failed patch
uk: Використовуйте «git am --show-current-patch» щоб побачити провалену латку.

source: No changes - did you forget to use 'git add'? If there is nothing left to stage, chances are that something else already introduced the same changes; you might want to skip this patch.
uk: Немає змін — можливо, Ви забули викликати «git add»? Якщо нічого не залишилося для індексації, то, швидше за все, щось інше вже зробило ті ж зміни; можливо, Вам слід пропустити цю латку.

source: You still have unmerged paths in your index. You should 'git add' each file with resolved conflicts to mark them as such. You might run `git rm` on a file to accept "deleted by them" for it.
uk: У вас є незлиті шляхи в індексі. Ви маєте виконати «git add» для кожного файлу з вирішеними конфліктами, щоб позначити їх такими. Ви можете виконати «git rm» з іменем файлу, щоб прийняти для нього «вилучено ними».

source: Could not parse object '%s'.
uk: Не вдалося розібрати об’єкт «%s».

source: failed to clean index
uk: не вдалося очистити індекс

source: You seem to have moved HEAD since the last 'am' failure. Not rewinding to ORIG_HEAD
uk: Схоже, що Ви перемістили HEAD з миті останньої помилки виконання «am». Перемотання на ORIG_HEAD не виконується

source: Invalid value for --patch-format: %s
uk: Неправильне значення для --patch-format: %s

source: git am [<options>] [(<mbox> | <Maildir>)...]
uk: git am [<опції>] [(<mbox> | <Maildir>)…]

source: git am [<options>] (--continue | --skip | --abort)
uk: git am [<опції>] (--continue | --skip | --abort)

source: run interactively
uk: запустити в інтерактивному режимі

source: historical option -- no-op
uk: історична опція — нічого не робить

source: allow fall back on 3way merging if needed
uk: дозволити відкотитися до триходового злиття, якщо потрібно

source: be quiet
uk: тихий режим

source: add a Signed-off-by line to the commit message
uk: додати рядок Signed-off-by до повідомлення коміту

source: recode into utf8 (default)
uk: перекодувати на utf8 (типово)

source: pass -k flag to git-mailinfo
uk: передати прапор -k в git-mailinfo

source: pass -b flag to git-mailinfo
uk: передати прапор -b в git-mailinfo

source: pass -m flag to git-mailinfo
uk: передати прапор -m в git-mailinfo

source: pass --keep-cr flag to git-mailsplit for mbox format
uk: передати прапор --keep-cr в git-mailsplit для формату mbox

source: do not pass --keep-cr flag to git-mailsplit independent of am.keepcr
uk: не передавати --keep-cr прапор в git-mailsplit поза залежністю від am.keepcr

source: strip everything before a scissors line
uk: обрізати усе до рядка обрізки

source: pass it through git-apply
uk: передати його в git-apply

source: format
uk: формат

source: format the patch(es) are in
uk: формат, у якому знаходяться латки

source: override error message when patch failure occurs
uk: перевизначити повідомлення про помилку, якщо не вдалося накласти латку

source: continue applying patches after resolving a conflict
uk: продовжити застосування латок після вирішення конфлікту

source: synonyms for --continue
uk: синоніми для --continue

source: skip the current patch
uk: пропустити поточну латку

source: restore the original branch and abort the patching operation.
uk: відновити оригінальну гілку і скасувати операцію застосування латок.

source: abort the patching operation but keep HEAD where it is.
uk: перервати застосування латки, але залишити HEAD на місці.

source: show the patch being applied.
uk: показати латку, що буде застосована

source: lie about committer date
uk: збрехати про дату комітера

source: use current timestamp for author date
uk: використовувати поточний час як час авторства

source: GPG-sign commits
uk: підписати коміти за допомогою GPG

source: (internal use for git-rebase)
uk: (внутрішнє використання для git-rebase)

source: The -b/--binary option has been a no-op for long time, and it will be removed. Please do not use it anymore.
uk: Опція -b/--binary вже довгий час нічого не робить й буде вилучена у наступних версіях Git. Будь ласка, не використовуйте її.

source: failed to read the index
uk: збій читання індексу

source: previous rebase directory %s still exists but mbox given.
uk: попередній каталог перебазування %s ще існує, але переданий mbox.

source: Stray %s directory found. Use "git am --abort" to remove it.
uk: Знайдено забутий каталог %s. Використовуйте «git am --abort», щоб вилучити його.

source: Resolve operation not in progress, we are not resuming.
uk: Операція вирішення конфліктів не у процесі виконання, не продовжуємо.

source: git apply [<options>] [<patch>...]
uk: git apply [<опції>] [<патч>…]

source: could not create archive file '%s'
uk: не вдалося створити файл архіву «%s»

source: could not redirect output
uk: неможливо переспрямувати виведення

source: git archive: Remote with no URL
uk: git-архів: віддалене сховище без URL

source: git archive: expected ACK/NAK, got a flush packet
uk: git archive: очікувалось ACK/NAK, отримано пакет скидання

source: git archive: NACK %s
uk: git-архів: NACK %s

source: git archive: protocol error
uk: git archive: помилка протоколу

source: git archive: expected a flush
uk: git archive: очікувалося скидання буферу

source: git bisect--helper --write-terms <bad_term> <good_term>
uk: git bisect--helper --write-terms <погане-визначення> <гарне-визначення>

source: '%s' is not a valid term
uk: «%s» не є припустимим визначенням

source: can't use the builtin command '%s' as a term
uk: неможливо використовувати команду «%s» як визначення

source: can't change the meaning of the term '%s'
uk: неможливо змінити значення визначення «%s»

source: please use two different terms
uk: використовуйте два різних визначення

source: could not open the file BISECT_TERMS
uk: неможливо відкрити файл BISECT_TERMS

source: perform 'git bisect next'
uk: виконати «git bisect next»

source: write the terms to .git/BISECT_TERMS
uk: записати визначення в .git/BISECT_TERMS

source: cleanup the bisection state
uk: очистити стан двійкового пошуку

source: check for expected revs
uk: перевірити очікувані редакції

source: update BISECT_HEAD instead of checking out the current commit
uk: оновити BISECT_HEAD замість перевірки поточного коміту

source: --write-terms requires two arguments
uk: --write-terms вимагає зазначення двох аргументів

source: --bisect-clean-state requires no arguments
uk: --bisect-clean-state не вимагає зазначення параметрів

source: git blame [<options>] [<rev-opts>] [<rev>] [--] <file>
uk: git blame [<опції>] [<опції-редакції>] [<редакція>] [--] <файл>

source: <rev-opts> are documented in git-rev-list(1)
uk: <опції-rev-list> документовані в git-rev-list(1)

source: Show blame entries as we find them, incrementally
uk: Показувати записи авторства, як тільки ми їх знайдемо, поступово

source: Show blank SHA-1 for boundary commits (Default: off)
uk: Показувати порожній SHA-1 для граничних комітів (Типово: off)

source: Do not treat root commits as boundaries (Default: off)
uk: Виправляти кореневі коміти як граничні (Типово: off)

source: Show work cost statistics
uk: Показувати статистику працевитрат

source: Force progress reporting
uk: Примусово виводити поступ виконання

source: Show output score for blame entries
uk: Показувати оцінку для записів авторства

source: Show original filename (Default: auto)
uk: Показувати оригінальне ім’я файлу (Типово: auto)

source: Show original linenumber (Default: off)
uk: Показувати оригінальний номер рядка (Типово: off)

source: Show in a format designed for machine consumption
uk: Показати у форматі, призначеному для машинного сприйняття

source: Show porcelain format with per-line commit information
uk: Показувати уразливий формат з щорядковою інформацією про коміт

source: Use the same output mode as git-annotate (Default: off)
uk: Використовувати такий самий формат виводу як git-анотації (Типово: off)

source: Show raw timestamp (Default: off)
uk: Показувати необроблені позначки часу (Типово: off)

source: Show long commit SHA1 (Default: off)
uk: Показувати довгий SHA1 коміту (Типово: off)

source: Suppress author name and timestamp (Default: off)
uk: Приховувати ім’я автора і позначку часу (Типово: off)

source: Show author email instead of name (Default: off)
uk: Показувати електронну адресу автора замість ім’я (Типово: off)

source: Ignore whitespace differences
uk: Ігнорувати різницю в пробілах

source: Use an experimental heuristic to improve diffs
uk: Використовувати експериментальну еврістику для покращення файлів різниць

source: Spend extra cycles to find better match
uk: Використовувати екстра цикли, щоб знайти кращий збіг

source: Use revisions from <file> instead of calling git-rev-list
uk: Використовувати редакції з <file> замість виклику git-rev-list

source: Use <file>'s contents as the final image
uk: Використовувати вміст <file> як фінальний знімок

source: score
uk: рахунок

source: Find line copies within and across files
uk: Знайти копії рядків всередині і поза файлами

source: Find line movements within and across files
uk: Знайти переміщення рядків всередині і поза файлами

source: Process only line range n,m, counting from 1
uk: Обробити лише діапазон рядків n,m, рахуючи з 1

source: --progress can't be used with --incremental or porcelain formats
uk: --progress неможливо використовувати одночасно з --incremental або машинним (porcelain) форматом

source: 4 years, 11 months ago
uk: 4 роки і 11 місяців тому

source: file %s has only %lu line
uk: файл %s містить лише %lu рядок

source: Blaming lines
uk: Перегляд авторів рядків

source: git branch [<options>] [-r | -a] [--merged | --no-merged]
uk: git branch [<опції>] [-r | -a] [--merged | --no-merged]

source: git branch [<options>] [-l] [-f] <branch-name> [<start-point>]
uk: git branch [<опції>] [-l] [-f] <імя-гілки> [<точка-початку>]

source: git branch [<options>] [-r] (-d | -D) <branch-name>...
uk: git branch [<опції>] [-r] (-d | -D) <ім’я-гілки>…

source: git branch [<options>] (-m | -M) [<old-branch>] <new-branch>
uk: git branch [<опції>] (-m | -M) [<стара-гілка>] <нова-гілка>

source: git branch [<options>] (-c | -C) [<old-branch>] <new-branch>
uk: git branch [<опції>] (-c | -C) [<стара-гілка>] <нова-гілка>

source: git branch [<options>] [-r | -a] [--points-at]
uk: git branch [<опції>] [-r | -a] [--points-at]

source: git branch [<options>] [-r | -a] [--format]
uk: git branch [<опції>] [-r | -a] [--format]

source: deleting branch '%s' that has been merged to '%s', but not yet merged to HEAD.
uk: вилучення гілки «%s», яка була злита з «%s», але ще не злита з HEAD.

source: not deleting branch '%s' that is not yet merged to '%s', even though it is merged to HEAD.
uk: залишити гілку «%s», яка ще не злита з «%s», навіть якщо вона злита з HEAD.

source: Couldn't look up commit object for '%s'
uk: Неможливо знайти об’єкт коміту для «%s»

source: The branch '%s' is not fully merged. If you are sure you want to delete it, run 'git branch -D %s'.
uk: Злиття гілки «%s» виконано не повністю. Якщо ви справді бажаєте вилучити її, виконайте «git branch -D %s».

source: Update of config-file failed
uk: Оновлення config-файлу не вдалося

source: cannot use -a with -d
uk: неможливо використовувати -a з -d

source: Couldn't look up commit object for HEAD
uk: Неможливо знайти об'єкт коміту для HEAD

source: Cannot delete branch '%s' checked out at '%s'
uk: Неможливо видалити гілку «%s» оскільки вона активна на «%s»

source: remote-tracking branch '%s' not found.
uk: зовнішня відстежувана гілка «%s» не знайдена.

source: branch '%s' not found.
uk: гілка «%s» не знайдена.

source: Error deleting remote-tracking branch '%s'
uk: Помилка вилучення зовнішньої відстежуваної гілки «%s»

source: Error deleting branch '%s'
uk: Помилка вилучення гілки «%s»

source: Deleted remote-tracking branch %s (was %s).
uk: Зовнішня відстежувана гілка %s вилучена (була %s).

source: Deleted branch %s (was %s).
uk: Вилучена гілка %s (була %s).

source: unable to parse format string
uk: неможливо розібрати рядок формату

source: Branch %s is being rebased at %s
uk: Виконується перебазування гілки %s на %s

source: Branch %s is being bisected at %s
uk: Виконується двійковий пошук у гілці %s на %s

source: cannot copy the current branch while not on any.
uk: неможливо скопіювати поточну гілку, якщо ви не знаходитесь на жодній з гілок

source: cannot rename the current branch while not on any.
uk: неможливо перейменувати поточну гілку, якщо ви не знаходитись на ній

source: Invalid branch name: '%s'
uk: Неприпустима назва гілки: «%s»

source: Branch rename failed
uk: Не вдалося перейменувати гілку

source: Branch copy failed
uk: Не вдалося скопіювати гілку

source: Created a copy of a misnamed branch '%s'
uk: Створена копія неправильно названої гілки «%s»

source: Renamed a misnamed branch '%s' away
uk: Перейменована неправильно названа гілка «%s»

source: Branch renamed to %s, but HEAD is not updated!
uk: Гілка перейменована в %s, але HEAD не оновлено!

source: Branch is renamed, but update of config-file failed
uk: Гілка перейменована, але оновлення файлу конфігурації завершилося невдачею

source: Branch is copied, but update of config-file failed
uk: Гілка скопійована, але оновлення файлу конфігурації завершилося невдачею

source: Please edit the description for the branch %s Lines starting with '%c' will be stripped.
uk: Змініть опис для гілки: %s Рядки, що починаються з «%c» будуть вирізані.

source: Generic options
uk: Загальні параметри

source: show hash and subject, give twice for upstream branch
uk: показувати хеш-суму і тему, вкажіть двічі для гілки, що вище

source: suppress informational messages
uk: не виводити інформаційні повідомлення

source: set up tracking mode (see git-pull(1))
uk: налаштувати режим відстеження (дивіться git-pull(1))

source: do not use
uk: не використовувати

source: change the upstream info
uk: змінити відомості про upstream

source: Unset the upstream info
uk: Прибрати відомості про upstream

source: use colored output
uk: використовувати кольорове виведення

source: act on remote-tracking branches
uk: діяти на віддалено відстежуваних гілках

source: print only branches that contain the commit
uk: вивести лише ті гілки, що містять такий коміт

source: print only branches that don't contain the commit
uk: вивести лише гілки, що не містять такий коміт

source: Specific git-branch actions:
uk: Спеціальні події git-гілки:
