Repository: PlagaMedicum/Ubuntu-Translation-Demo
Catalog: rosetta-eoan/*/LC_MESSAGES/git.po
Languages: uk

source: action if trailer is missing
uk: дія, якщо завершувач не існує

source: output only the trailers
uk: вивести лише завершувачі

source: do not apply config rules
uk: не застосовувати правила з файлу конфігурації

source: join whitespace-continued values
uk: об'єднати значення, відокремлені пробілами

source: set parsing options
uk: задавання опцій розбору

source: trailer
uk: завершувач

source: trailer(s) to add
uk: завершувачі для додавання

source: --trailer with --only-input does not make sense
uk: --trailer одночасно з с --only-input не має сенсу

source: no input file given for in-place editing
uk: нічого не передано для редагування файлів на місці

source: git log [<options>] [<revision-range>] [[--] <path>...]
uk: git log [<опції>] [<діяпазон-редакцій>] [[--] <шлях>…]

source: git show [<options>] <object>...
uk: git show [<опції>] <об’єкт>…

source: invalid --decorate option: %s
uk: неправильний параметр для --decorate: %s

source: suppress diff output
uk: не виводити різниці

source: show source
uk: показувати вихідний код

source: Use mail map file
uk: Використовувати файл відповідності поштових адрес

source: only decorate refs that match <pattern>
uk: декорувати лише посилання, що відповідають <шаблону>

source: do not decorate refs that match <pattern>
uk: не декорувати лише посилання, що відповідають <шаблону>

source: decorate options
uk: опції формату виводу посилань

source: Process line range n,m in file, counting from 1
uk: Опрацьовувати діапазон рядків n,m із файлу, починаючи з 1

source: Final output: %d %s
uk: Фінальний вивід: %d %s

source: git show %s: bad file
uk: git show %s: поганий файл

source: Could not read object %s
uk: Не вдалося прочитати об’єкт %s

source: Unknown type: %d
uk: Невідомий тип об’єкту: %d

source: format.headers without value
uk: в format.headers не вказано значення

source: name of output directory is too long
uk: задовге ім’я вихідного каталогу

source: Cannot open patch file %s
uk: Не вдалося відкрити файл змін %s

source: Need exactly one range.
uk: Потрібен лише один діапазон.

source: Not a range.
uk: Не є діапазоном.

source: Cover letter needs email format
uk: Супроводжуючий лист має бути у форматі електронної пошти

source: insane in-reply-to: %s
uk: помилка у полі in-reply-to: %s

source: git format-patch [<options>] [<since> | <revision-range>]
uk: git format-patch [<опції>] [<починаючи-з> | <діапазон-редакцій>]

source: Two output directories?
uk: Два вихідних каталоги?

source: Unknown commit %s
uk: Невідомий коміт %s

source: Failed to resolve '%s' as a valid ref.
uk: Не вдалося визначити«%s» як посилання.

source: Could not find exact merge base.
uk: Неможливо знайти точну базу злиття.

source: Failed to get upstream, if you want to record base commit automatically, please use git branch --set-upstream-to to track a remote branch. Or you could specify base commit by --base=<base-commit-id> manually.
uk: Неможливо отримати upstream. Якщо ви бажаєте записати базовий коміт автоматично, то використовуйте git branch --set-upstream-to для відслідковування віддаленої гілки. Або ви можете зазначити базовий коміт вручну через --base=<ідентифікатор-базового-коміту>.

source: Failed to find exact merge base
uk: Не вдалося знайти точну базу злиття.

source: base commit should be the ancestor of revision list
uk: базовий коміт має бути пращуром списка редакцій

source: base commit shouldn't be in revision list
uk: базовий коміт не має бути в списку редакцій

source: cannot get patch id
uk: неможливо отримати ідентифікатор латки

source: use [PATCH n/m] even with a single patch
uk: виводити [PATCH n/m] навіть коли одна латка

source: use [PATCH] even with multiple patches
uk: виводити [PATCH] навіть коли декілька латок

source: print patches to standard out
uk: виводити латки на стандартний вивід

source: generate a cover letter
uk: генерувати супроводжуючого листа

source: use simple number sequence for output file names
uk: використовувати просту послідовність чисел для імен вихідних файлів

source: sfx
uk: суфікс

source: use <sfx> instead of '.patch'
uk: використовувати суфікс <суфікс> замість «.patch»

source: start numbering patches at <n> instead of 1
uk: почати нумерацію латок з <n>, а не з 1

source: mark the series as Nth re-roll
uk: позначити серію як енну спробу

source: Use [RFC PATCH] instead of [PATCH]
uk: Використовувати [RFC PATCH] замість [PATCH]

source: Use [<prefix>] instead of [PATCH]
uk: Використовувати [<префікс>] замість [PATCH]

source: store resulting files in <dir>
uk: зберегти результуючі файли у <каталог>

source: don't strip/add [PATCH]
uk: не обрізати/додавати [PATCH]

source: don't output binary diffs
uk: не виводити двійкові відмінности

source: output all-zero hash in From header
uk: виводити порожню хеш-суму у заголовку From

source: don't include a patch matching a commit upstream
uk: не включати латку, якщо коміт вже є в upstream

source: show patch format instead of default (patch + stat)
uk: виводити у форматі латки, а не у стандартному (латка + статистика)

source: Messaging
uk: Обмін повідомленнями

source: header
uk: заголовок

source: add email header
uk: додати заголовок повідомлення

source: email
uk: ел. пошта

source: add To: header
uk: додати заголовок To:

source: add Cc: header
uk: додати заголовок Cc:

source: ident
uk: ідентифікатор

source: set From address to <ident> (or committer ident if absent)
uk: встановити адресу відправника на <ідентифікатор> (або на ідентифікатор комітера, якщо відсутній)

source: message-id
uk: ідентифікатор повідомлення

source: make first mail a reply to <message-id>
uk: зробити першого листа відповіддю на <ідентифікатор-повідомлення>

source: boundary
uk: вкладення

source: attach the patch
uk: долучити латку

source: inline the patch
uk: вбудувати латку

source: enable message threading, styles: shallow, deep
uk: увімкнути у листах ієрархічність, стилі: shallow (часткову), deep (глибоку)

source: signature
uk: підпис

source: add a signature
uk: додати підпис

source: base-commit
uk: базовий коміт

source: add prerequisite tree info to the patch series
uk: додати дані про необхідність дерева до серії латок

source: add a signature from a file
uk: додати підпис із файлу

source: don't print the patch filenames
uk: не виводити імена файлів латок

source: show progress while generating patches
uk: показати поступ виконання при генеруванні латок

source: invalid ident line: %s
uk: неправильний рядок ідентифікації: %s

source: --name-only does not make sense
uk: --name-only не має сенсу

source: --name-status does not make sense
uk: --name-status не має сенсу

source: --check does not make sense
uk: --check не має сенсу

source: standard output, or directory, which one?
uk: стандартний вивід чи каталог?

source: Could not create directory '%s'
uk: Не вдалося створити каталог «%s»

source: unable to read signature file '%s'
uk: не вдалося прочитати файл підпису «%s»

source: Generating patches
uk: Генерування латок

source: Failed to create output files
uk: Збій при створенні вихідних файлів

source: git cherry [-v] [<upstream> [<head> [<limit>]]]
uk: git cherry [-v] [<гілка-що вище> [<голова> [<обмеження>]]]

source: Could not find a tracked remote branch, please specify <upstream> manually.
uk: Не вдалося знайти відстежувану зовнішню гілку, вкажіть <гілку-що вище> вручну.

source: git ls-files [<options>] [<file>...]
uk: git ls-files [<опції>] [<файл>…]

source: identify the file status with tags
uk: виводити імена файлів з мітками

source: use lowercase letters for 'assume unchanged' files
uk: використовувати символи у нижньому регістрі для «припущення без змін» файлів

source: use lowercase letters for 'fsmonitor clean' files
uk: використовувати символи нижнього регістра для виведення файлів «fsmonitor clean»

source: show cached files in the output (default)
uk: показувати кешовані файли при виводі (типово)

source: show deleted files in the output
uk: показувати вилучені файли при виводі

source: show modified files in the output
uk: показувати змінені файли при виводі

source: show other files in the output
uk: показувати інші файли при виводі

source: show ignored files in the output
uk: показувати нехтувані файли при виводі

source: show staged contents' object name in the output
uk: показувати ім'я спорядженого об'єкту у виведенні

source: show files on the filesystem that need to be removed
uk: показувати файли у файловій системі, які мають бути вилучені

source: show 'other' directories' names only
uk: показувати лише імена в «інших» каталогів

source: show line endings of files
uk: показати завершення рядків у файлах

source: don't show empty directories
uk: не показувати порожні каталоги

source: show unmerged files in the output
uk: показувати не злиті файли на виводі

source: show resolve-undo information
uk: показувати інформацію про вирішення конфліктів і скасування

source: skip files matching pattern
uk: пропустити файли, що відповідають шаблону

source: exclude patterns are read from <file>
uk: прочитати шаблони виключення із <файл>

source: read additional per-directory exclude patterns in <file>
uk: прочитати додаткові покаталогові шаблони виключення із <файл>

source: add the standard git exclusions
uk: додати стандартні виключення git

source: make the output relative to the project top directory
uk: виводити шляхи відносно кореневого каталогу проєкту

source: recurse through submodules
uk: рекурсивно за підмодулями

source: if any <file> is not in the index, treat this as an error
uk: якщо якийсь <файл> не у індексі, вважати це помилкою

source: tree-ish
uk: вказівник-дерева

source: pretend that paths removed since <tree-ish> are still present
uk: прикинутися, що шляхи вилучені, оскільки. <вказівник-дерева> ще існує

source: show debugging data
uk: показати налагоджувальну інформацію

source: git ls-remote [--heads] [--tags] [--refs] [--upload-pack=<exec>] [-q | --quiet] [--exit-code] [--get-url] [--symref] [<repository> [<refs>...]]
uk: git ls-remote [--heads] [--tags] [--refs] [--upload-pack=<запуск>] [-q | --quiet] [--exit-code] [--get-url] [--symref] [<сховище> [<посилання>…]]

source: do not print remote URL
uk: не виводити URL віддалених сховищ

source: exec
uk: запуск

source: path of git-upload-pack on the remote host
uk: шлях до git-upload-pack на віддаленому сервері

source: limit to tags
uk: обмежити виведенння мітками

source: limit to heads
uk: обмежити виведенння вказівниками на гілки

source: do not show peeled tags
uk: не показувати вилучені мітки

source: take url.<base>.insteadOf into account
uk: враховувати url.<база>.insteadOf

source: exit with exit code 2 if no matching refs are found
uk: виходити з кодом 2, якщо відповідні посилання не знайдені

source: show underlying ref in addition to the object pointed by it
uk: показати також внутрішнє посилання на додаток до об'єкта, на який вона вказує

source: git ls-tree [<options>] <tree-ish> [<path>...]
uk: git ls-tree [<опції>] <вказівник-дерева> [<шлях>…]

source: only show trees
uk: виводити лише дерева

source: recurse into subtrees
uk: проходити рекурсивно у піддерева

source: show trees when recursing
uk: виводити дерева при рекурсивному проході

source: terminate entries with NUL byte
uk: розділяти записи за допомогою НУЛЬОВОГО байту

source: include object size
uk: включити розмір об’єкту

source: list only filenames
uk: виводити лише імена файлів

source: use full path names
uk: використовувати повні шляхи

source: list entire tree; not just current directory (implies --full-name)
uk: вивести повне дерево; не лише поточний каталог (включає у себе --full-name)

source: empty mbox: '%s'
uk: порожній mbox: «%s»

source: git merge [<options>] [<commit>...]
uk: git merge [<опції>] [<коміт>…]

source: switch `m' requires a value
uk: при вказуванні параметру «m» потрібно вказати значення

source: Could not find merge strategy '%s'.
uk: Не вдалося знайти стратегію злиття «%s».

source: Available strategies are:
uk: Доступні стратегії:

source: Available custom strategies are:
uk: Доступні користувацькі стратегії:

source: do not show a diffstat at the end of the merge
uk: не виводити статистику змін після закінчення злиття

source: show a diffstat at the end of the merge
uk: вивести статистику змін після закінчення злиття

source: (synonym to --stat)
uk: (синонім для --stat)

source: add (at most <n>) entries from shortlog to merge commit message
uk: додати (максимум <n>) записів із короткого журналу у повідомлення коміту у злиття

source: create a single commit instead of doing a merge
uk: створити один коміт, замість виконання злиття

source: perform a commit if the merge succeeds (default)
uk: зробити коміт, якщо злиття пройшло успішно (типово)

source: edit message before committing
uk: відредагувати повідомлення перед виконанням коміту

source: allow fast-forward (default)
uk: дозволити перемотування вперед (типово)

source: abort if fast-forward is not possible
uk: скасувати виконання злиття, якщо перемотування вперед неможливе

source: verify that the named commit has a valid GPG signature
uk: перевірити, що вказаний коміт має вірний електронний підпис GPG

source: strategy
uk: стратегія

source: merge strategy to use
uk: стратегія злиття, що використовується

source: option=value
uk: опція=значення

source: option for selected merge strategy
uk: опції для вибраної стратегії злиття

source: merge commit message (for a non-fast-forward merge)
uk: повідомлення коміту для злиття (для злиття без перемотування вперед)

source: abort the current in-progress merge
uk: скасувати виконання злиття, що відбувається

source: continue the current in-progress merge
uk: продовжити виконання поточного злиття, що триває

source: allow merging unrelated histories
uk: дозволити злиття непов'язаних історій змін

source: verify commit-msg hook
uk: перевірити гак commit-msg

source: could not run stash.
uk: не вдалося виконати stash.

source: stash failed
uk: збій при виконанні stash

source: not a valid object: %s
uk: неправильний об’єкт: %s

source: read-tree failed
uk: збій при виконанні read-tree

source: (nothing to squash)
uk: (нічого зчавлювати)

source: Squash commit -- not updating HEAD
uk: Зчавлювання коміту — без оновлення HEAD

source: No merge message -- not updating HEAD
uk: Немає повідомлення злиття — не оновлюємо HEAD

source: '%s' does not point to a commit
uk: «%s» не вказує на коміт

source: Bad branch.%s.mergeoptions string: %s
uk: Неправильний рядок branch.%s.mergeoptions: %s

source: Not handling anything other than two heads merge.
uk: Не опрацьовую нічого, окрім злиття двох вказівників на коміти.

source: Unknown option for merge-recursive: -X%s
uk: Невідомий параметр merge-recursive: -X%s

source: unable to write %s
uk: не вдалося записати %s

source: Could not read from '%s'
uk: Не вдалося прочитати із «%s»

source: Not committing merge; use 'git commit' to complete the merge.
uk: Не виконую коміт злиття; використовуйте «git commit» для завершення злиття.

source: Please enter a commit message to explain why this merge is necessary, especially if it merges an updated upstream into a topic branch. Lines starting with '%c' will be ignored, and an empty message aborts the commit.
uk: Будь ласка, уведіть повідомлення коміту, для пояснення, нащо потрібне це злиття, особливо, якщо це злиття оновленого upstream у тематичну гілку. Рядки, що починаються з «%c» будуть знехтувані, а порожнє повідомлення скасовує процес комміту.

source: Empty commit message.
uk: Порожнє повідомлення коміту.

source: Wonderful.
uk: Чудово.

source: Automatic merge failed; fix conflicts and then commit the result.
uk: Не вдалося провести автоматичне злиття; виправте конфлікти й зробіть коміт результату.

source: No current branch.
uk: Немає поточної гілки.

source: No remote for the current branch.
uk: У поточної гілки немає віддаленого сховища.

source: No default upstream defined for the current branch.
uk: Для поточної гілки не вказана типова гілка, що вище.

source: No remote-tracking branch for %s from %s
uk: Не вказана віддалена відстежувана гілка для %s на %s

source: Bad value '%s' in environment '%s'
uk: Погане значення «%s» в змінній сховища «%s»

source: not something we can merge in %s: %s
uk: не є тим, що можливо злити в %s: %s

source: not something we can merge
uk: не є тим, що можливо злити

source: --abort expects no arguments
uk: опція --abort не приймає аргументи

source: There is no merge to abort (MERGE_HEAD missing).
uk: Немає злиття, яке можна скасувати (відсутній файл MERGE_HEAD).

source: --continue expects no arguments
uk: опція --continue не приймає аргументи

source: There is no merge in progress (MERGE_HEAD missing).
uk: Наразі злиття не відбувається (відсутній файл MERGE_HEAD).

source: You have not concluded your merge (MERGE_HEAD exists). Please, commit your changes before you merge.
uk: Ви не завершили злиття (присутній файл MERGE_HEAD). Виконайте коміт ваших змін перед злиттям.

source: You have not concluded your cherry-pick (CHERRY_PICK_HEAD exists). Please, commit your changes before you merge.
uk: Ви не завершили висмикуванння (присутній файл CHERRY_PICK_HEAD). Будь ласка, виконайте коміт ваших змін перед злиттям.

source: You have not concluded your cherry-pick (CHERRY_PICK_HEAD exists).
uk: Ви не завершили висмикування (присутній файл CHERRY_PICK_HEAD).

source: You cannot combine --squash with --no-ff.
uk: Неможна використовувати одночасно --squash і --no-ff.

source: No commit specified and merge.defaultToUpstream not set.
uk: Коміт не вказаний і параметр merge.defaultToUpstream не встановлений.

source: Squash commit into empty head not supported yet
uk: Зчавлення коміту у порожній HEAD ще не підтримується

source: Non-fast-forward commit does not make sense into an empty head
uk: Коміт, що не є перемотуванням вперед, немає сенсу робити у порожній HEAD.

source: %s - not something we can merge
uk: %s не є тим, що можна злити

source: Can merge only exactly one commit into empty head
uk: Можна злити лише один коміт у порожній HEAD.

source: refusing to merge unrelated histories
uk: відмова від злиття непов'язаних історій змін

source: Already up to date.
uk: Вже актуальне.

source: Updating %s..%s
uk: Оновлення %s..%s

source: Trying really trivial in-index merge...
uk: Спроба тривіального злиття в індексі…

source: Nope.
uk: Не вийшло.

source: Already up to date. Yeeah!
uk: Вже актуальне. Чудово!

source: Not possible to fast-forward, aborting.
uk: Перемотування вперед неможливе, переривання.

source: Rewinding the tree to pristine...
uk: Перемотування дерева до початкового стану…

source: Trying merge strategy %s...
uk: Спроба злиття за допомогою стратегії %s…

source: No merge strategy handled the merge.
uk: Жодна стратегія злиття не опрацювала злиття.

source: Merge with strategy %s failed.
uk: Збій при злитті за допомогою стратегії %s.

source: Using the %s to prepare resolving by hand.
uk: Використовую %s для підготовки ручного вирішення конфліктів.

source: Automatic merge went well; stopped before committing as requested
uk: Автоматичне злиття пройшло успішно; як і запитували, зупинено перед виконанням коміту

source: git merge-base [-a | --all] <commit> <commit>...
uk: git merge-base [-a | --all] <коміт> <коміт>…

source: git merge-base [-a | --all] --octopus <commit>...
uk: git merge-base [-a | --all] --octopus <коміт>…

source: git merge-base --independent <commit>...
uk: git merge-base --independent <коміт>…

source: git merge-base --is-ancestor <commit> <commit>
uk: git merge-base --is-ancestor <коміт> <коміт>

source: git merge-base --fork-point <ref> [<commit>]
uk: git merge-base --fork-point <посилання> [<коміт>]

source: output all common ancestors
uk: вивести усіх спільних пращурів

source: find ancestors for a single n-way merge
uk: вивести пращурів для одного багатоходового злиття

source: list revs not reachable from others
uk: вивести перелік ревізій, які не досяжні із один одного

source: is the first one ancestor of the other?
uk: є першим пращуром другого вказаного коміту?

source: find where <commit> forked from reflog of <ref>
uk: знайти журнал посилань <посилання> де саме <коміт> розгілкувався

source: git merge-file [<options>] [-L <name1> [-L <orig> [-L <name2>]]] <file1> <orig-file> <file2>
uk: git merge-file [<опції>] [-L ім’я1 [-L orig [-L ім’я2]]] <файл1> <ориг-файл> <файл2>

source: send results to standard output
uk: вивести результат на стандартний вивід

source: use a diff3 based merge
uk: використовувати diff3 злиття

source: for conflicts, use our version
uk: при виникненні конфліктів, використовувати нашу версію

source: for conflicts, use their version
uk: при виникненні конфліктів, використовувати їх версію

source: for conflicts, use a union version
uk: при виникненні конфліктів, використовувати обидві версії

source: for conflicts, use this marker size
uk: при виникненні конфліктів, використовувати цей розмір маркера

source: do not warn about conflicts
uk: не попереджувати про конфлікти

source: set labels for file1/orig-file/file2
uk: встановити мітки для файл1/ориг-файл/файл2

source: unknown option %s
uk: невідомий параметр %s

source: could not parse object '%s'
uk: неможливо розібрати об'єкт «%s»

source: cannot handle more than %d base. Ignoring %s.
uk: неможливо обробити понад %d базу. Ігноруємо %s.

source: not handling anything other than two heads merge.
uk: не обробляю нічого, крім злиття двох вказівників на гілки.

source: could not resolve ref '%s'
uk: неможливо розпізнати посилання «%s»

source: Merging %s with %s
uk: Злиття %s та %s

source: input is NUL terminated
uk: ввід відокремлений НУЛЬОВИМИ символами

source: allow missing objects
uk: допустити відсутність об’єктів

source: allow creation of more than one tree
uk: допустити створення більше одного дерева

source: git mv [<options>] <source>... <destination>
uk: git mv [<опції>] <джерело>… <призначення>

source: Directory %s is in index and no submodule?
uk: Каталог %s в індексі і не є підмодулем?

source: Please stage your changes to .gitmodules or stash them to proceed
uk: Щоб продовжити, проіндексуйте або сховайте Ваші зміни у файлі .gitmodules

source: %.*s is in index
uk: %.*s в індексі

source: force move/rename even if target exists
uk: примусово переміщувати/перейменовувати, навіть якщо мета існує

source: skip move/rename errors
uk: пропускати помилки при переміщенні/перейменуванні

source: destination '%s' is not a directory
uk: цільовий шлях «%s» не є каталогом

source: Checking rename of '%s' to '%s'
uk: Перевірка перейменування із «%s» на «%s»

source: bad source
uk: погане джерело

source: can not move directory into itself
uk: неможливо перемістити каталог сам у себе

source: cannot move directory over file
uk: неможливо перемістити каталог у файл

source: source directory is empty
uk: початковий каталог порожній

source: not under version control
uk: не під версійним контролем

source: destination exists
uk: шлях мети вже існує

source: overwriting '%s'
uk: перезапис «%s»

source: Cannot overwrite
uk: Не вдалося перезаписати

source: multiple sources for the same target
uk: декілька джерел для одного шляху мети

source: destination directory does not exist
uk: каталог мети не існує

source: %s, source=%s, destination=%s
uk: %s, звідки=%s, куди=%s

source: Renaming %s to %s
uk: Перейменування %s на %s

source: renaming '%s' failed
uk: невдача при пейменуванні «%s»

source: git name-rev [<options>] <commit>...
uk: git name-rev [<опції>] <коміт>…

source: git name-rev [<options>] --all
uk: git name-rev [<опції>] --all

source: git name-rev [<options>] --stdin
uk: git name-rev [<опції>] --stdin

source: print only names (no SHA-1)
uk: виводити лише імена (без SHA-1)

source: only use tags to name the commits
uk: використовувати лише мітки для йменування комітів
