Repository: PlagaMedicum/Ubuntu-Translation-Demo
Catalog: rosetta-eoan/*/LC_MESSAGES/git.po
Languages: uk

source: Cherry-picking is not possible because you have unmerged files.
uk: Висмикування неможливе оскільки ви маєте незлиті файли.

source: Committing is not possible because you have unmerged files.
uk: Створення коміту неможливе оскільки ви маєте незлиті файли.

source: Merging is not possible because you have unmerged files.
uk: Злиття неможливе оскільки ви маєте незлиті файли.

source: Pulling is not possible because you have unmerged files.
uk: Надсилання змін неможливе оскільки ви маєте незлиті файли.

source: Reverting is not possible because you have unmerged files.
uk: Вивертання неможливе оскільки ви маєте незлиті файли.

source: It is not possible to %s because you have unmerged files.
uk: Неможливо %s оскільки ви маєте незлиті файли.

source: Fix them up in the work tree, and then use 'git add/rm <file>' as appropriate to mark resolution and make a commit.
uk: Виправте їх у робочому каталозі, потім запустіть «git add/rm <файл>», щоб позначити виправлення й зробіть коміт.

source: Exiting because of an unresolved conflict.
uk: Вихід через невирішений конфлікт.

source: You have not concluded your merge (MERGE_HEAD exists).
uk: Ви не завершили злиття (присутній файл MERGE_HEAD).

source: Please, commit your changes before merging.
uk: Перед злиттям виконайте коміт ваших змін.

source: Exiting because of unfinished merge.
uk: Вихід через незавершене злиття.

source: Note: checking out '%s'. You are in 'detached HEAD' state. You can look around, make experimental changes and commit them, and you can discard any commits you make in this state without impacting any branches by performing another checkout. If you want to create a new branch to retain commits you create, you may do so (now or later) by using -b with the checkout command again. Example: git checkout -b <new-branch-name>
uk: Примітка: перехід на «%s». Ви перебуваєте в стані «відокремленого HEAD». Ви можете озирнутися навколо, зробити експериметнальні зміни та закомітити їх, також ви можете скасувати будь-які коміти в цьому стані не зачіпаючи решту гілок і не переходячи на них. Якщо ви бажаєте створити нову гілку і зберегти свої коміти, то ви можете зробити це (зараз чи потім) виконавши знову команду checkout з параметром -b. Наприклад: git checkout -b <назва-нової-гілки>

source: unrecognized whitespace option '%s'
uk: нерозпізнана опція для пробілів «%s»

source: unrecognized whitespace ignore option '%s'
uk: нерозпізнана опція для нехтування пробілів «%s»

source: --reject and --3way cannot be used together.
uk: --reject та --3way неможливо використовувати разом.

source: --cached and --3way cannot be used together.
uk: --cached та --3way неможливо використовувати разом.

source: --3way outside a repository
uk: --3way поза сховищем

source: --index outside a repository
uk: --index поза сховищем

source: --cached outside a repository
uk: --cached поза сховищем

source: Cannot prepare timestamp regexp %s
uk: Неможливо підготувати позначку часу регулярного виразу %s

source: regexec returned %d for input: %s
uk: regexec повертає %d для введення: %s

source: unable to find filename in patch at line %d
uk: неможливо знайти ім’я файлу у латці на рядку %d

source: git apply: bad git-diff - expected /dev/null, got %s on line %d
uk: git apply: поганий git-diff — очікувалося /dev/null, отримано %s на рядку %d

source: git apply: bad git-diff - inconsistent new filename on line %d
uk: git apply: поганий git-diff — несумісне нове ім’я файлу на рядку %d

source: git apply: bad git-diff - inconsistent old filename on line %d
uk: git apply: поганий git-diff — несумісне старе ім’я файлу на рядку %d

source: git apply: bad git-diff - expected /dev/null on line %d
uk: git apply: поганий git-diff — очікувалося /dev/null на рядку %d

source: invalid mode on line %d: %s
uk: неприпустимий режим на рядку %d: %s

source: inconsistent header lines %d and %d
uk: несумісні рядки заголовка %d та %d

source: recount: unexpected line: %.*s
uk: перерахунок: несподіваний рядок: %.*s

source: patch fragment without header at line %d: %.*s
uk: фрагмент латки без заголовку в рядку %d: %.*s

source: git diff header lacks filename information when removing %d leading pathname component (line %d)
uk: заголовок git diff не знайшов інформацію про ім’я файлу при вилученні %d ведучого компоненту шляху до файлу (рядок %d)

source: git diff header lacks filename information (line %d)
uk: заголовок git diff не містить даних про назву файлу (рядок %d)

source: new file depends on old contents
uk: новий файл залежить від старого вмісту

source: deleted file still has contents
uk: вилучений файл все ще має вміст

source: corrupt patch at line %d
uk: спотворення латки на рядку %d

source: new file %s depends on old contents
uk: новий файл %s залежить від старого вмісту

source: deleted file %s still has contents
uk: файл, що вилучається %s все ще має вміст

source: ** warning: file %s becomes empty but is not deleted
uk: ** попередження: файл %s порожній, але не вилучений

source: corrupt binary patch at line %d: %.*s
uk: пошкоджена двійкова латка на рядку %d: %.*s

source: unrecognized binary patch at line %d
uk: нерозпізнана двійкова латка на рядку %d

source: patch with only garbage at line %d
uk: латка зі сміттям на рядку %d

source: unable to read symlink %s
uk: неможливо прочитати символічне посилання %s

source: unable to open or read %s
uk: неможливо відкрити чи прочитати %s

source: invalid start of line: '%c'
uk: неприпустимий початок рядка: «%c»

source: Hunk #%d succeeded at %d (offset %d line).
uk: Частина #%d успішно застосована на %d (зі зсувом в %d рядок).

source: Context reduced to (%ld/%ld) to apply fragment at %d
uk: Контекст звужений до (%ld/%ld), щоб застосувати фрагмент на %d рядку

source: while searching for: %.*s
uk: при пошуку: %.*s

source: missing binary patch data for '%s'
uk: втрачено вміст двійкової латки «%s»

source: cannot reverse-apply a binary patch without the reverse hunk to '%s'
uk: неможливо виконати reverse-apply для двійкової латки без повернення змін блоку «%s»

source: cannot apply binary patch to '%s' without full index line
uk: неможливо застосувати двійкову латку «%s» без рядка з вказаною повною версією індекса

source: the patch applies to '%s' (%s), which does not match the current contents.
uk: латка застосовується до файлу «%s» (%s), але його поточний вміст не відповідає очікуваному.

source: the patch applies to an empty '%s' but it is not empty
uk: латка застосовується до порожнього файлу «%s», але він не порожній

source: the necessary postimage %s for '%s' cannot be read
uk: неможливо прочитати необхідне посилання postimage %s для «%s»

source: binary patch does not apply to '%s'
uk: двійкову латку не застосовано до «%s»

source: binary patch to '%s' creates incorrect result (expecting %s, got %s)
uk: після застосування двійкової латки для «%s» був отриманий неправильний результат (очікувалося %s, отримано %s)

source: patch failed: %s:%ld
uk: помилка латки: %s:%ld

source: cannot checkout %s
uk: неможливо перейти на %s

source: failed to read %s
uk: не вдалося прочитати %s

source: reading from '%s' beyond a symbolic link
uk: читання з «%s» за символічним посиланням

source: path %s has been renamed/deleted
uk: шлях %s був перейменований/вилучений

source: %s: does not exist in index
uk: %s: не існує в індексі

source: %s: does not match index
uk: %s: не відповідає індексу

source: repository lacks the necessary blob to fall back on 3-way merge.
uk: в сховищі відсутній необхідний двійковий об'єкт для відкочування до трикрокового злиття.

source: Falling back to three-way merge...
uk: Відкочування до трикрокового злиття…

source: cannot read the current contents of '%s'
uk: неможливо прочитати поточний вміст «%s»

source: Failed to fall back on three-way merge...
uk: Не вдалося відкотитися до трикрокового злиття…

source: Applied patch to '%s' with conflicts.
uk: Латка застосована до «%s» з конфліктами.

source: Applied patch to '%s' cleanly.
uk: Латка застосована до «%s» без помилок.

source: removal patch leaves file contents
uk: латка-вилучення не вилучила вміст файлу

source: %s: wrong type
uk: %s: неправильний тип

source: %s has type %o, expected %o
uk: %s має тип %o, очікувався %o

source: invalid path '%s'
uk: неприпустимий шлях «%s»

source: %s: already exists in index
uk: %s: вже існує в індексі

source: %s: already exists in working directory
uk: %s: вже існує в робочому каталозі

source: new mode (%o) of %s does not match old mode (%o)
uk: новий режим доступу (%o) для %s не відповідає старому режиму доступу (%o)

source: new mode (%o) of %s does not match old mode (%o) of %s
uk: новий режим доступу (%o) для %s не відповідає старому режиму доступу (%o) для %s

source: affected file '%s' is beyond a symbolic link
uk: зачеплений файл «%s» знаходиться за символічним посиланням

source: %s: patch does not apply
uk: %s: латку неможливо застосувати

source: Checking patch %s...
uk: Перевірка латки %s...

source: sha1 information is lacking or useless for submodule %s
uk: дані про sha1 відсутні або непридатні для підмодуля %s

source: mode change for %s, which is not in current HEAD
uk: змінено режим доступу для %s, який не знаходиться в поточному HEAD

source: sha1 information is lacking or useless (%s).
uk: дані про sha1 відсутні або непридатні (%s).

source: make_cache_entry failed for path '%s'
uk: make_cache_entry помилка для шляху «%s»

source: could not add %s to temporary index
uk: неможливо додати %s до тимчасового індексу

source: could not write temporary index to %s
uk: неможливо записати тимчасовий індекс до %s

source: unable to remove %s from index
uk: неможливо вилучити %s з індексу

source: corrupt patch for submodule %s
uk: пошкоджена латка для підмодуля %s

source: unable to stat newly created file '%s'
uk: не вдалося виконати stat для створеного файлу «%s»

source: unable to create backing store for newly created file %s
uk: не вдалося створити допоміжний файл для створеного файлу %s

source: unable to add cache entry for %s
uk: не вдалося створити запис у кеші для %s

source: failed to write to '%s'
uk: не вдалося записати до «%s»

source: closing file '%s'
uk: закриття файлу '%s'

source: unable to write file '%s' mode %o
uk: неможливо записати файл «%s» з режимом доступу %o

source: Applied patch %s cleanly.
uk: Латка %s застосована без помилок.

source: internal error
uk: внутрішня помилка

source: Applying patch %%s with %d reject...
uk: Застосування латки %%s з %d відмовою…

source: truncating .rej filename to %.*s.rej
uk: усічення ім’я .rej файлу до %.*s.rej

source: cannot open %s
uk: не вдається відкрити %s

source: Hunk #%d applied cleanly.
uk: Блок №%d застосований без помилок.

source: Rejected hunk #%d.
uk: Блок №%d відхилений.

source: Skipped patch '%s'.
uk: Латка «%s» пропущена.

source: unrecognized input
uk: нерозпізнане введення

source: unable to read index file
uk: не вдається прочитати індексний файл

source: can't open patch '%s': %s
uk: неможливо відкрити латку «%s»: %s

source: squelched %d whitespace error
uk: пропущена %d помилка в пробільних символах

source: %d line adds whitespace errors.
uk: %d рядок додав помилки в пробільних символах.

source: %d line applied after fixing whitespace errors.
uk: %d рядок додано після виправлення помилки в пробільних символах.

source: Unable to write new index file
uk: Не вдається записати новий індексний файл

source: path
uk: шлях

source: don't apply changes matching the given path
uk: не застосовувати зміни за вказаним шляхом

source: apply changes matching the given path
uk: застосовувати зміни за вказаним шляхом

source: num
uk: кількість

source: remove <num> leading slashes from traditional diff paths
uk: вилучити <кількість> ведучих косих рисок із традиційних шляхів переліку змін

source: ignore additions made by the patch
uk: Нехтувати додавання, зроблені цією латкою.

source: instead of applying the patch, output diffstat for the input
uk: замість застосування латки вивести статистику додавань та вилучень для введення

source: show number of added and deleted lines in decimal notation
uk: показати кількість доданих і вилучених рядків в десятковій системі

source: instead of applying the patch, output a summary for the input
uk: замість застосування латки вивести статистику змін для введення

source: instead of applying the patch, see if the patch is applicable
uk: замість застосування латки перевірити чи вона підходить

source: make sure the patch is applicable to the current index
uk: переконайтеся, що латка застосовна до поточного індексу

source: apply a patch without touching the working tree
uk: застосувати латку не чіпаючи робоче дерево

source: accept a patch that touches outside the working area
uk: прийняти латку, яка зачіпає файли за робочим каталогом

source: also apply the patch (use with --stat/--summary/--check)
uk: а також застосувати латку (використовуйте з --stat/--summary/--check)

source: attempt three-way merge if a patch does not apply
uk: спробувати зробити триходове злиття, якщо латка не застосовується

source: build a temporary index based on embedded index information
uk: зібрати тимчасовий індекс, заснований на вбудованій індексній інформації

source: paths are separated with NUL character
uk: шляхи розділені символом NUL

source: ensure at least <n> lines of context match
uk: переконайтеся, що принаймні <n> рядків відповідають контексту

source: action
uk: дія

source: detect new or modified lines that have whitespace errors
uk: знайти нові або змінені рядки, що містять помилки

source: ignore changes in whitespace when finding context
uk: нехтувати зміни у пробільних символах при пошуку контексту

source: apply the patch in reverse
uk: застосувати латку з поверненням змін

source: don't expect at least one line of context
uk: некоректний як мінімум один рядок з контексту

source: leave the rejected hunks in corresponding *.rej files
uk: залишити відхилені блоки у відповідних *.rej файлах

source: allow overlapping hunks
uk: дозволити блоки змін, що перекриваються

source: be verbose
uk: режим докладних повідомлень

source: tolerate incorrectly detected missing new-line at the end of file
uk: допускати невірно визначену відсутність нового рядка у кінці файлу

source: do not trust the line counts in the hunk headers
uk: не довіряти кількості рядків, вказаній у заголовку блоку

source: root
uk: корінь

source: prepend <root> to all filenames
uk: додавати <root> на початок імен усіх файлів

source: git archive [<options>] <tree-ish> [<path>...]
uk: git archive [<опції>] <вказівник-дерева> [<шлях>…]

source: git archive --remote <repo> [--exec <cmd>] [<options>] <tree-ish> [<path>...]
uk: git archive --remote <сховище> [--exec <команда>] [<опції>] <вказівник-дерева> [<шлях>…]

source: git archive --remote <repo> [--exec <cmd>] --list
uk: git archive --remote <сховище> [--exec <команда>] --list

source: pathspec '%s' did not match any files
uk: специфікатор шляху «%s» не відповідає жодному файлу

source: fmt
uk: формат

source: archive format
uk: формат архіву

source: prefix
uk: префікс

source: prepend prefix to each pathname in the archive
uk: додати префікс до кожного шляху в архіві

source: file
uk: файл

source: write the archive to this file
uk: записати архів до цього файлу

source: read .gitattributes in working directory
uk: прочитати файл .gitattributes в робочому каталозі

source: report archived files on stderr
uk: вивести звіт щодо архівованих файлів до stderr

source: store only
uk: тільки збереження

source: compress faster
uk: стискати швидше

source: compress better
uk: більш сильне стиснення

source: list supported archive formats
uk: вивести список підтримуваних форматів архіву

source: repo
uk: сховище

source: retrieve the archive from remote repository <repo>
uk: отримати архів з віддаленого сховища <repo>

source: command
uk: команда

source: path to the remote git-upload-archive command
uk: шлях до віддаленої команди git-upload-archive

source: Unexpected option --remote
uk: Несподіваний параметр --remote

source: Option --exec can only be used together with --remote
uk: Параметр --exec може використовуватись лише разом з --remote

source: Unexpected option --output
uk: Несподіваний параметр --output

source: Unknown archive format '%s'
uk: Невідомий формат архіву «%s»

source: Argument not supported for format '%s': -%d
uk: Аргумент не підтримується форматом «%s»: -%d

source: deflate error (%d)
uk: помилка стиснення (%d)

source: %.*s is not a valid attribute name
uk: %.*s не є припустимою назвою атрибута

source: Negative patterns are ignored in git attributes Use '\!' for literal leading exclamation.
uk: Некоректні шаблони знехтувані в атрибутах git Використовуйте «\!» для використання знаку оклику.

source: Badly quoted content in file '%s': %s
uk: Поганий вміст файлу «%s»: %s

source: We cannot bisect more!
uk: Неможливо продовжити двійковий пошук!

source: Not a valid commit name %s
uk: Неправильна назва коміту %s

source: The merge base %s is bad. This means the bug has been fixed between %s and [%s].
uk: База злиття %s зіпсована. Це означає, що помилка була виправлена десь між %s та [%s].

source: The merge base %s is new. The property has changed between %s and [%s].
uk: База злиття %s нова. Властивість була змінена між %s та [%s].

source: The merge base %s is %s. This means the first '%s' commit is between %s and [%s].
uk: База злиття %s %s. Це означає, що коміт «%s» знаходиться десь між %s та [%s].

source: Some %s revs are not ancestors of the %s rev. git bisect cannot work properly in this case. Maybe you mistook %s and %s revs?
uk: Деякі %s редакції не є нащадками %s редакції. В цьому випадку git bisect не може працювати належним чином. Можливо ви сплутали редакції %s та %s ?

source: the merge base between %s and [%s] must be skipped. So we cannot be sure the first %s commit is between %s and %s. We continue anyway.
uk: База злиття між %s та [%s] має бути пропущена. Тому ми не можемо бути певні, що перший коміт %s знаходиться між %s та %s. Але все ж ми продовжуємо пошук.

source: Bisecting: a merge base must be tested
uk: Двійковий пошук: база злиття має бути перевірена

source: a %s revision is needed
uk: потрібно вказати редакцію %s

source: could not create file '%s'
uk: не вдалося створити файл «%s»

source: could not read file '%s'
uk: неможливо прочитати файл «%s»

source: reading bisect refs failed
uk: збій при читанні посилань двійкового пошуку

source: %s was both %s and %s
uk: %s була водночас і %s і %s

source: No testable commit found. Maybe you started with bad path parameters?
uk: Жодног досупного для тестування коміту не знайдено. Можливо, ви почали пошук із зазначенням неправильного параметру шляху?

source: (roughly %d step)
uk: (приблизно %d крок)

source: Bisecting: %d revision left to test after this %s
uk: Двійковий пошук: %d редакцію залишилось перевірити після цієї %s

source: --contents and --reverse do not blend well.
uk: --contents та --reverse не дуже сумісні.

source: cannot use --contents with final commit object name
uk: неможливо використовувати --contents із зазначенням назви об'єкта фінального коміту

source: --reverse and --first-parent together require specified latest commit
uk: при використанні --reverse та --first-parent разом потрібно зазначати останній коміт

source: revision walk setup failed
uk: збій ініціалізації проходу по редакціям

source: --reverse --first-parent together require range along first-parent chain
uk: при використанні --reverse та --first-parent разом потрібно зазначати діапазон за ланцюжком першого батька

source: no such path %s in %s
uk: немає шляху %s в %s

source: cannot read blob %s for path %s
uk: неможливо прочитати об'єкт %s для шляху %s

source: After fixing the error cause you may try to fix up the remote tracking information by invoking "git branch --set-upstream-to=%s%s%s".
uk: Після виправлення помилки, ви можете спробувати виправити дані про відслідковування зовнішньої гілки за допомогою команди «git branch --set-upstream-to=%s%s%s».

source: Not setting branch %s as its own upstream.
uk: Не встановлена гілка %s як її upstream

source: Branch '%s' set up to track remote branch '%s' from '%s' by rebasing.
uk: Гілка «%s» відслідковує зовнішню гілку «%s» з «%s» шляхом перебазування.

source: Branch '%s' set up to track remote branch '%s' from '%s'.
uk: Гілка «%s» відслідковує зовнішню гілку «%s» з «%s».

source: Branch '%s' set up to track local branch '%s' by rebasing.
uk: Гілка «%s» відслідковує локальну гілку «%s» шляхом перебазування.

source: Branch '%s' set up to track local branch '%s'.
uk: Гілка «%s» відслідковує локальну гілку «%s».

source: Branch '%s' set up to track remote ref '%s' by rebasing.
uk: Гілка «%s» відслідковує зовнішнє посилання «%s» шляхом перебазування.

source: Branch '%s' set up to track remote ref '%s'.
uk: Гілка «%s» відслідковує зовнішнє посилання «%s».

source: Branch '%s' set up to track local ref '%s' by rebasing.
uk: Гілка «%s» відслідковує локальне посилання «%s» шляхом перебазування.

source: Branch '%s' set up to track local ref '%s'.
uk: Гілка «%s» відслідковує локальне посилання «%s».

source: Unable to write upstream branch configuration
uk: Не вдається записати конфігурацію гілки upstream

source: Not tracking: ambiguous information for ref %s
uk: Немає відстеження: неоднозначна інформація для посилання %s

source: '%s' is not a valid branch name.
uk: «%s» не є припустимою назвою гілки.

source: A branch named '%s' already exists.
uk: Гілка з назвою «%s» вже існує.

source: Cannot force update the current branch.
uk: Не вдається примусово оновити поточну гілку.

source: Cannot setup tracking information; starting point '%s' is not a branch.
uk: Не вдається налаштувати відстеження інформації; відправна точка «%s» не є гілкою.

source: the requested upstream branch '%s' does not exist
uk: запитувана гілка upstream «%s»не існує

source: If you are planning on basing your work on an upstream branch that already exists at the remote, you may need to run "git fetch" to retrieve it. If you are planning to push out a new local branch that will track its remote counterpart, you may want to use "git push -u" to set the upstream config as you push.
uk: Якщо Ви плануєте засновувати свою роботу на на гілці upstream, яка вже існує у зовнішньому сховищі, вам потрібно буде виконати «git fetch» для її отримання. Якщо ви плануєте надіслати зміни з нової локальної гілки, яка буде відслідковувати її віддалений аналог, вам потрібно буде використати команду «git push -u» щоб зберегти налаштування upstream під час надсилання змін.

source: Not a valid object name: '%s'.
uk: Неправильна назва об'єкту:«%s».

source: Ambiguous object name: '%s'.
uk: Неоднозначна назва об'єкта : «%s».

source: Not a valid branch point: '%s'.
uk: Неприпустима точка розгалуження: «%s».

source: '%s' is already checked out at '%s'
uk: «%s» вже знаходиться на «%s»

source: HEAD of working tree %s is not updated
uk: HEAD робочого каталогу %s не оновлений

source: '%s' does not look like a v2 bundle file
uk: «%s» не схожий нв пакетний файл v2

source: unrecognized header: %s%s (%d)
uk: нерозпізнаний заголовок: %s%s (%d)

source: could not open '%s'
uk: не вдалося відкрити «%s»

source: Repository lacks these prerequisite commits:
uk: Сховище не містить необхідних комітів:

source: The bundle contains this ref:
uk: Пакунок містить це %d посилання:

source: The bundle records a complete history.
uk: Пакунок містить повну історію.

source: The bundle requires this ref:
uk: Пакунок потребує це %d посилання:

source: Could not spawn pack-objects
uk: Неможливо розмножити об’єкти пакунку

source: pack-objects died
uk: критична помилка pack-objects

source: rev-list died
uk: критична помилка rev-list

source: ref '%s' is excluded by the rev-list options
uk: посилання «%s» виключене відповідно до налаштувань rev-list
