Repository: PlagaMedicum/Ubuntu-Translation-Demo
Catalog: rosetta-eoan/*/LC_MESSAGES/git.po
Languages: uk

source: %s reset is not allowed in a bare repository
uk: скидання «%s» дозволено лише з голим сховищем

source: -N can only be used with --mixed
uk: -N можна використовувати разом з --mixed

source: Unstaged changes after reset:
uk: Неспоряджені зміни після скидання:

source: Could not reset index file to revision '%s'.
uk: Не вдалося скинути файл індексу на редакцію «%s».

source: Could not write new index file.
uk: Не вдалося записати новий файл індексу.

source: cannot combine --exclude-promisor-objects and --missing
uk: неможливо використовувати --exclude-promisor-objects одночасно з --missing

source: object filtering requires --objects
uk: фільтрування об'єктів потребує зазначення параметра --objects

source: invalid sparse value '%s'
uk: неприпустиме часткове значення «%s»

source: rev-list does not support display of notes
uk: rev-list не підтримує відображення нотаток

source: cannot combine --use-bitmap-index with object filtering
uk: неможливо використовувати --use-bitmap-index одночасно з фільтруванням об'єктів

source: git rev-parse --parseopt [<options>] -- [<args>...]
uk: git rev-parse --parseopt [<опції>] -- [<аргументи>…]

source: keep the `--` passed as an arg
uk: передавати далі «--» як аргумент

source: stop parsing after the first non-option argument
uk: зупинити розбір після першого аргументу, що не є опцією

source: output in stuck long form
uk: виводити аргументи у довгому форматі

source: git rev-parse --parseopt [<options>] -- [<args>...] or: git rev-parse --sq-quote [<arg>...] or: git rev-parse [<options>] [<arg>...] Run "git rev-parse --parseopt -h" for more information on the first usage.
uk: git rev-parse --parseopt [<опції>] -- [<аргументи>…] or: git rev-parse --sq-quote [<аргумент>…] or: git rev-parse [<опції>] [<аргумент>…] Запустіть команду «git rev-parse --parseopt -h» для отримання докладної інформації про перше використання.

source: git revert [<options>] <commit-ish>...
uk: git revert [<опції>] <вказівник-коміту>…

source: git revert <subcommand>
uk: git revert <підкоманда>

source: git cherry-pick [<options>] <commit-ish>...
uk: git cherry-pick [<опції>] <вказівник-коміту>…

source: git cherry-pick <subcommand>
uk: git cherry-pick <підкоманда>

source: %s: %s cannot be used with %s
uk: %s: %s неможливо використовувати одночасно з %s

source: end revert or cherry-pick sequence
uk: кінець послідовності висмикування або повернення комміту

source: resume revert or cherry-pick sequence
uk: продовжити послідовність висмикування або повернення коміту

source: cancel revert or cherry-pick sequence
uk: скасування послідовності висмикування або повернення коміту

source: don't automatically commit
uk: не комітити автоматично

source: edit the commit message
uk: змінити повідомлення коміту

source: parent-number
uk: номер-батька

source: select mainline parent
uk: вибір основного батька

source: merge strategy
uk: стратегія злиття

source: option for merge strategy
uk: параметр стратегії злиття

source: append commit name
uk: дописувати назву коміта

source: preserve initially empty commits
uk: зберегти початково порожні коміти

source: keep redundant, empty commits
uk: залишити надлишкові, порожні коміти

source: revert failed
uk: спроба повернення до попередньої версії зазнала невдачі

source: cherry-pick failed
uk: висмикування зазнало невдачі

source: git rm [<options>] [--] <file>...
uk: git rm [<опції>] [--] <файл>…

source: the following file has staged content different from both the file and the HEAD:
uk: наступний файл містить споряджений вміст, що відрізняється й від файлу, й від HEAD:

source: (use -f to force removal)
uk: (використовуйте опцію «-f» для примусового вилучення)

source: the following file has changes staged in the index:
uk: наступний файл містить споряджені зміни в індексі:

source: (use --cached to keep the file, or -f to force removal)
uk: (використовуйте опцію «--cached» для збереження файлу, або «-f» для примусового вилучення)

source: the following file has local modifications:
uk: наступний файл містить локальні зміни:

source: do not list removed files
uk: не виводити перелік вилучених файлів

source: only remove from the index
uk: вилучити лише з індексу

source: override the up-to-date check
uk: пропустити перевірку актуальності

source: allow recursive removal
uk: дозволити рекурсивне вилучення

source: exit with a zero status even if nothing matched
uk: вихід з нульовим кодом завершення, навіть якщо нічого не знайдено

source: not removing '%s' recursively without -r
uk: не вилучаю рекурсивно «%s» без зазначення опції -r

source: git rm: unable to remove %s
uk: git rm: не вдалося вилучити %s

source: git send-pack [--all | --mirror] [--dry-run] [--force] [--receive-pack=<git-receive-pack>] [--verbose] [--thin] [--atomic] [<host>:]<directory> [<ref>...] --all and explicit <ref> specification are mutually exclusive.
uk: git send-pack [--all | --mirror] [--dry-run] [--force] [--receive-pack=<git-receive-pack>] [--verbose] [--thin] [--atomic] [<сервер>:]<каталог> [<посилання>…] --all та явне зазначення <посилання> неможливо використовувати одночасно.

source: remote name
uk: ім’я віддаленого сховища

source: use stateless RPC protocol
uk: протокол без збереження стану для RPC

source: read refs from stdin
uk: прочитати посилання із стандартного вводу

source: print status from remote helper
uk: вивести статус від скрипта віддаленого сервера

source: quit after a single request/response exchange
uk: вихід після обміну одним запитом/відповіддю

source: Group by committer rather than author
uk: Групувати за комітером, а не за автором

source: sort output according to the number of commits per author
uk: впорядкувати вивід за кількістю комітів у автора

source: Suppress commit descriptions, only provides commit count
uk: Не виводити опису комітів, а лише їх кількість

source: Show the email address of each author
uk: Показати пошту кожного із авторів

source: Linewrap output
uk: Перенесення рядків на виведенні

source: git show-branch [-a | --all] [-r | --remotes] [--topo-order | --date-order] [--current] [--color[=<when>] | --no-color] [--sparse] [--more=<n> | --list | --independent | --merge-base] [--no-name | --sha1-name] [--topics] [(<rev> | <glob>)...]
uk: git show-branch [-a | --all] [-r | --remotes] [--topo-order | --date-order] [--current] [--color[=<коли>] | --no-color] [--sparse] [--more=<n> | --list | --independent | --merge-base] [--no-name | --sha1-name] [--topics] [(<редакція> | <шаблон>)...]

source: git show-branch (-g | --reflog)[=<n>[,<base>]] [--list] [<ref>]
uk: git show-branch (-g | --reflog)[=<n>[,<база>]] [--list] [<посилання>]

source: ignoring %s; cannot handle more than %d ref
uk: нехтування %s; неможливо обробити понад %d посилання

source: no matching refs with %s
uk: немає посилань, що збігаються з %s

source: show remote-tracking and local branches
uk: показати перелік відстежуваних віддалених і локальних гілок

source: show remote-tracking branches
uk: показати перелік відстежуваних віддалених гілок

source: color '*!+-' corresponding to the branch
uk: забарвлювати «*!+-» відповідно до гілки

source: show <n> more commits after the common ancestor
uk: показати <n> комітів після спільного пращура

source: synonym to more=-1
uk: синонім для more=-1

source: suppress naming strings
uk: не виводити іменовані рядки

source: include the current branch
uk: додати у вивід поточну гілку

source: name commits with their object names
uk: іменувати коміти їх іменами об’єктів

source: show possible merge bases
uk: вивести можливі бази злиття

source: show refs unreachable from any other ref
uk: вивести посилання, недоступні з будь-яких інших посилань

source: show commits in topological order
uk: вивести коміти у топологічному порядку

source: show only commits not on the first branch
uk: вивести лише коміти, відсутні у першій гілці

source: show merges reachable from only one tip
uk: вивести злиття, досяжні лише із однієї з верхівок

source: topologically sort, maintaining date order where possible
uk: топологічне впорядкування, зі збереженням порядку дат, якщо можливо

source: <n>[,<base>]
uk: <n>[,<база>]

source: show <n> most recent ref-log entries starting at base
uk: показати <n> останніх записів у журналі посилань, починаючи з бази

source: --reflog is incompatible with --all, --remotes, --independent or --merge-base
uk: --reflog несумісне з --all, --remotes, --independent та --merge-base

source: no branches given, and HEAD is not valid
uk: не вказані гілки та HEAD недійсний

source: --reflog option needs one branch name
uk: параметр --reflog потребує зазначення назви однієї гілки

source: only %d entry can be shown at one time.
uk: лише %d запис може бути показаний одночасно.

source: no such ref %s
uk: немає такого посилання %s

source: cannot handle more than %d rev.
uk: неможливо обробити понад %d редакції.

source: '%s' is not a valid ref.
uk: «%s» не є припустимим посилання на коміт.

source: cannot find commit %s (%s)
uk: неможливо знайти коміт %s (%s)

source: git show-ref [-q | --quiet] [--verify] [--head] [-d | --dereference] [-s | --hash[=<n>]] [--abbrev[=<n>]] [--tags] [--heads] [--] [<pattern>...]
uk: git show-ref [-q | --quiet] [--verify] [--head] [-d | --dereference] [-s | --hash[=<n>]] [--abbrev[=<n>]] [--tags] [--heads] [--] [<шаблон>…]

source: git show-ref --exclude-existing[=<pattern>]
uk: git show-ref --exclude-existing[=<шаблон>]

source: only show tags (can be combined with heads)
uk: вивести лише мітки (можна використовувати одночасно з --heads)

source: only show heads (can be combined with tags)
uk: вивести лише голови (можна використовувати одночасно з --tags)

source: stricter reference checking, requires exact ref path
uk: більш сувора перевірка посилань, потребує точного шляху посилання

source: show the HEAD reference, even if it would be filtered out
uk: вивести посилання HEAD, навіть якщо воно буде відфільтроване

source: dereference tags into object IDs
uk: розіменувати мітки в ідентифікатори об’єктів

source: only show SHA1 hash using <n> digits
uk: використовувати <n> цифр для виводу SHA-1

source: do not print results to stdout (useful with --verify)
uk: не друкувати результат на стандартний вивід (корисно з опцією «--verify»)

source: show refs from stdin that aren't in local repository
uk: вивести посилання із стандартного вводу, яких немає в локальному сховищі

source: skip and remove all lines starting with comment character
uk: пропустити та вилучити усі рядки, що починаються з символу коментаря

source: prepend comment character and space to each line
uk: додати перед кожним рядком символ коментаря та пробіл

source: Expecting a full ref name, got %s
uk: Очікувалась повна назва посилання, а отримано %s

source: submodule--helper print-default-remote takes no arguments
uk: submodule--helper print-default-remote не приймає аргументів

source: cannot strip one component off url '%s'
uk: неможливо обрізати один компонент url «%s»

source: alternative anchor for relative paths
uk: альтернативний символ для відносних шляхів

source: git submodule--helper list [--prefix=<path>] [<path>...]
uk: git submodule--helper list [--prefix=<шлях>] [<шлях>…]

source: No url found for submodule path '%s' in .gitmodules
uk: URL для підмодуля за шляхом «%s» не знайдений в .gitmodules

source: Recurse into nested submodules
uk: Проходити вглиб вкладених підмодулей

source: Failed to register url for submodule path '%s'
uk: Збій реєстрації url для шляху підмодуля«%s»

source: Submodule '%s' (%s) registered for path '%s'
uk: Підмодуль «%s» (%s) зареєстрований для шляху «%s»

source: warning: command update mode suggested for submodule '%s'
uk: увага: пропонований режим оновлення для підмодуля «%s»

source: Failed to register update mode for submodule path '%s'
uk: Невдала спроба реєтрації режиму оновлення для шляху підмодуля «%s»

source: Suppress output for initializing a submodule
uk: Не виводити інформацію про ініціалізацію підмодуля

source: git submodule--helper init [<path>]
uk: git submodule--helper init [<шлях>]

source: no submodule mapping found in .gitmodules for path '%s'
uk: не знайдено відповідність підмодулів в .gitmodules для шляху «%s»

source: could not resolve HEAD ref inside the submodule '%s'
uk: неможливо знайти посилання HEAD в середині підмодуля «%s»

source: failed to recurse into submodule '%s'
uk: не вдалося перейти вглиб підмодуля «%s»

source: Suppress submodule status output
uk: Не виводити стан підмодуля

source: Use commit stored in the index instead of the one stored in the submodule HEAD
uk: Використовувати коміт, що зберігається в індексі заміст коміта, що зберігається в HEAD підмодуля

source: recurse into nested submodules
uk: проходити вглиб вкладених підмодулей

source: git submodule status [--quiet] [--cached] [--recursive] [<path>...]
uk: git submodule status [--quiet] [--cached] [--recursive] [<шлях>…]

source: git submodule--helper name <path>
uk: git submodule--helper name <шлях>

source: Synchronizing submodule url for '%s'
uk: Синхронізація адрес підмодулей для «%s»

source: failed to register url for submodule path '%s'
uk: збій реєстрації url для шляху підмодуля«%s»

source: failed to get the default remote for submodule '%s'
uk: не вдалося отримати типове віддалене сховище для підмодуля «%s»

source: failed to update remote for submodule '%s'
uk: не вдалося оновити типове сховище для підмодуля «%s»

source: Suppress output of synchronizing submodule url
uk: Не виводити інформацію про синхронізацію адреси підмодуля

source: git submodule--helper sync [--quiet] [--recursive] [<path>]
uk: git submodule--helper sync [--quiet] [--recursive] [<шлях>]

source: Submodule work tree '%s' contains a .git directory (use 'rm -rf' if you really want to remove it including all of its history)
uk: Робочий каталог підмодуля «%s» містить каталог .git (якщо ви дійсно бажаєте вилучити його і всю його історію, то використайте команду «rm -rf»)

source: Submodule work tree '%s' contains local modifications; use '-f' to discard them
uk: Робочий каталог підмодуля «%s» містить локальні зміни; Використовуйте «-f», щоб відмовитися від них

source: Cleared directory '%s'
uk: Очищено каталог «%s»

source: Could not remove submodule work tree '%s'
uk: Неможливо вилучити робочий каталог підмодуля «%s»

source: could not create empty submodule directory %s
uk: неможливо створити порожній каталог підмодуля %s

source: Submodule '%s' (%s) unregistered for path '%s'
uk: Підмодуль «%s» (%s) знятий з реєстрації для шляху «%s»

source: Remove submodule working trees even if they contain local changes
uk: Вилучати робочі каталоги підмодуля, навіть якщо вони містять локальні зміни

source: Unregister all submodules
uk: Зняти з реєстрації усі підмодулі

source: git submodule deinit [--quiet] [-f | --force] [--all | [--] [<path>...]]
uk: git submodule deinit [--quiet] [-f | --force] [--all | [--] [<шлях>...]]

source: Use '--all' if you really want to deinitialize all submodules
uk: Використовуйте «--all», якщо ви дійсно бажаєте деініціалізувати всі підмодулі

source: submodule '%s' cannot add alternate: %s
uk: підмодулю «%s» не вдалося додати альтернативу: %s

source: Value '%s' for submodule.alternateErrorStrategy is not recognized
uk: Значення «%s» для параметра submodule.alternateErrorStrategy не розпізнано

source: Value '%s' for submodule.alternateLocation is not recognized
uk: Значення «%s» для параметра submodule.alternateLocation не розпізнано

source: where the new submodule will be cloned to
uk: куди повинен бути склонований новий підмодуль

source: name of the new submodule
uk: ім’я нового підмодулю

source: url where to clone the submodule from
uk: url звідки повинен був склонований новий підмодуль

source: depth for shallow clones
uk: глибина для часткового клону

source: force cloning progress
uk: примусово виводити поступ клонування

source: git submodule--helper clone [--prefix=<path>] [--quiet] [--reference <repository>] [--name <name>] [--depth <depth>] --url <url> --path <path>
uk: git submodule--helper clone [--prefix=<путь>] [--quiet] [--reference <сховище>] [--name <ім'я>] [--depth <глибина>] --url <url> --path <шлях>

source: clone of '%s' into submodule path '%s' failed
uk: не вдалося клонувати «%s» у підмодуль на шляху «%s»

source: could not get submodule directory for '%s'
uk: не вдалося отримати каталог для підмодулю «%s»

source: Submodule path '%s' not initialized
uk: Підмодуль за шляхом «%s» не ініціалізований

source: Maybe you want to use 'update --init'?
uk: Можливо ви бажали використовувати «update --init»?

source: Skipping unmerged submodule %s
uk: Пропуск незлитого підмодуля %s

source: Skipping submodule '%s'
uk: Пропуск підмодуля «%s»

source: Failed to clone '%s'. Retry scheduled
uk: Не вдалося склонувати «%s». Запланована повторна спроба

source: Failed to clone '%s' a second time, aborting
uk: Не вдалося склонувати «%s» з другої спроби, скасування

source: path into the working tree
uk: шлях в робочий каталог

source: path into the working tree, across nested submodule boundaries
uk: шлях в робочий каталог, в межах вкладеного підмодуля

source: rebase, merge, checkout or none
uk: rebase, merge, checkout або none

source: Create a shallow clone truncated to the specified number of revisions
uk: Створити частковий клон, обмежений зазначеною кількістю редакцій

source: parallel jobs
uk: паралельні задачі

source: whether the initial clone should follow the shallow recommendation
uk: чи має початковий процес клонування виконувати рекомендації про частковість

source: don't print cloning progress
uk: не виводити поступ клонування

source: git submodule--helper update_clone [--prefix=<path>] [<path>...]
uk: git submodule--helper update_clone [--prefix=<путь>] [<шлях>…]

source: bad value for update parameter
uk: погане значення для параметра update

source: Submodule (%s) branch configured to inherit branch from superproject, but the superproject is not on any branch
uk: Гілка підмодуля (%s) налаштована на успадкування гільки з батьківського проекту, але він не знаходиться на жодній з гілок

source: recurse into submodules
uk: рекурсивно по підмодулях

source: git submodule--helper embed-git-dir [<path>...]
uk: git submodule--helper embed-git-dir [<шлях>…]

source: %s doesn't support --super-prefix
uk: %s не підтримує параметр --super-prefix

source: '%s' is not a valid submodule--helper subcommand
uk: «%s» не є підкомандою submodule--helper

source: git symbolic-ref [<options>] <name> [<ref>]
uk: git symbolic-ref [<опції>] <ім’я> [<посилання>]

source: git symbolic-ref -d [-q] <name>
uk: git symbolic-ref -d [-q] <ім’я>

source: suppress error message for non-symbolic (detached) refs
uk: не виводити повідомлення про помилки для несимвольних (від’єднаних) посилань

source: delete symbolic ref
uk: вилучити символьні посилання

source: shorten ref output
uk: скорочений вивід посилань

source: reason
uk: причина

source: reason of the update
uk: причина оновлення

source: git tag [-a | -s | -u <key-id>] [-f] [-m <msg> | -F <file>] <tagname> [<head>]
uk: git tag [-a | -s | -u <ідентифікатор-ключа>] [-f] [-m <повідомлення> | -F <файл>] <ім’я-мітки> [<редакція>]

source: git tag -d <tagname>...
uk: git tag -d <ім’я-мітки>…

source: git tag -l [-n[<num>]] [--contains <commit>] [--no-contains <commit>] [--points-at <object>] [--format=<format>] [--[no-]merged [<commit>]] [<pattern>...]
uk: git tag -l [-n[<кількість>]] [--contains <коміт>] [--no-contains <коміт>] [--points-at <об'ект>] [--format=<формат>] [--[no-]merged [<коміт>]] [<шаблон>…]

source: git tag -v [--format=<format>] <tagname>...
uk: git tag -v [--format=<формат>] <ім'я-мітки>…

source: tag '%s' not found.
uk: мітка «%s» не знайдена.

source: Deleted tag '%s' (was %s)
uk: Мітка «%s» вилучена (була %s)

source: Write a message for tag: %s Lines starting with '%c' will be ignored.
uk: Уведіть повідомлення для мітки: %s Рядки, що починаються з «%c» будуть знехтувані.

source: Write a message for tag: %s Lines starting with '%c' will be kept; you may remove them yourself if you want to.
uk: Уведіть повідомлення для мітки: %s Рядки, що починаються з «%c» будуть залишені; Ви можете вилучити їх вручну, якщо волієте.

source: unable to sign the tag
uk: не вдалося підписати мітку

source: unable to write tag file
uk: не вдалося записати файл мітки

source: bad object type.
uk: неправильний тип об’єкту.

source: no tag message?
uk: немає опису мітки?

source: The tag message has been left in %s
uk: Повідомлення мітки було залишено в %s

source: list tag names
uk: перелік назв міток

source: print <n> lines of each tag message
uk: друкувати <n> рядків опису від кожної мітки

source: delete tags
uk: вилучити мітки

source: verify tags
uk: перевірити мітки

source: Tag creation options
uk: Налаштування створення мітки

source: annotated tag, needs a message
uk: для аннотованої мітки потрібне повідомлення

source: tag message
uk: повідомлення мітки

source: force edit of tag message
uk: примусово редагувати повідомлення мітки

source: annotated and GPG-signed tag
uk: аннотована та підписана за допомогою GPG мітка

source: use another key to sign the tag
uk: використовувати інший ключ для підписування мітки

source: replace the tag if exists
uk: заміна мітки, якщо вона існує

source: create a reflog
uk: створити журнал посилань

source: Tag listing options
uk: Налаштування виводу переліку міток

source: show tag list in columns
uk: показати перелік міток стовпчиками

source: print only tags that contain the commit
uk: виведення лише міток, які містять коміт

source: print only tags that don't contain the commit
uk: виведення лише міток, що не містять коміт

source: print only tags that are merged
uk: виведення лише злитих міток

source: print only tags that are not merged
uk: виведення лише незлитих міток

source: print only tags of the object
uk: вивід лише міток, певного об’єкту

source: --column and -n are incompatible
uk: --column та -n неможливо використовувати одночасно

source: -n option is only allowed in list mode
uk: опцію -n можливо використовувати лише в режимі списку

source: --contains option is only allowed in list mode
uk: опцію --contains можливо використовувати лише в режимі списку

source: --no-contains option is only allowed in list mode
uk: опцію --no-contains можливо використовувати лише в режимі списку

source: --points-at option is only allowed in list mode
uk: опцію --points-at можливо використовувати лише в режимі списку

source: --merged and --no-merged options are only allowed in list mode
uk: опції --merged та --no-merged можливо використовувати лише в режимі списку

source: only one -F or -m option is allowed.
uk: -F та -m неможливо використовувати одночасно.

source: too many params
uk: передано забагато параметрів

source: '%s' is not a valid tag name.
uk: «%s» не є припустимим іменем мітки.

source: tag '%s' already exists
uk: мітка «%s» вже існує

source: Updated tag '%s' (was %s)
uk: Мітка «%s» оновлена (була %s)

source: Unpacking objects
uk: Розпакування об’єктів

source: failed to create directory %s
uk: не вдалося створити каталог %s

source: failed to create file %s
uk: не вдалося створити файл %s

source: failed to delete file %s
uk: не вдалося вилучити файл %s

source: failed to delete directory %s
uk: не вдалося вилучити каталог %s

source: Testing mtime in '%s'
uk: Перевірка mtime в «%s»

source: directory stat info does not change after adding a new file
uk: інформація статистики каталогу не змінюється після додавання нового файлу

source: directory stat info does not change after adding a new directory
uk: інформація статистики каталогу не змінюється після додавання нового каталогу

source: directory stat info changes after updating a file
uk: інформація статистики каталогу змінюється після додавання нового файлу
