Repository: PlagaMedicum/Ubuntu-Translation-Demo
Catalog: rosetta-eoan/*/LC_MESSAGES/git.po
Languages: uk

source: Padding space on right border
uk: Відстань відступу праворуч

source: Padding space between columns
uk: Відстань відступу між колонками

source: --command must be the first argument
uk: параметр --command має бути першим

source: git commit [<options>] [--] <pathspec>...
uk: git commit [<опції>] [--] <специфікація-шляху>…

source: git status [<options>] [--] <pathspec>...
uk: git status [<опції>] [--] <специфікація-шляху>…

source: You asked to amend the most recent commit, but doing so would make it empty. You can repeat your command with --allow-empty, or you can remove the commit entirely with "git reset HEAD^".
uk: Ви попрохали виправити останній коміт, але таким чином ви створите порожній коміт. Ви можете повторити цю команду з опцією --allow-empty або ви можете вилучити коміт геть за допомогою команди «git reset HEAD^».

source: The previous cherry-pick is now empty, possibly due to conflict resolution. If you wish to commit it anyway, use: git commit --allow-empty
uk: Попереднє висмикуванняо тепер порожнє, можливо після вирішення конфліктів. Якщо ви все одно бажаєте зробити порожній коміт, використовуйте: git commit --allow-empty

source: Otherwise, please use 'git reset'
uk: У іншому випадку, використовуйте «git reset»

source: If you wish to skip this commit, use: git reset Then "git cherry-pick --continue" will resume cherry-picking the remaining commits.
uk: Якщо Ви бажаєте пропустити цей коміт, використовуйте команду: git reset Після цього «git cherry-pick --continue» продовжить висмикування комітів, що залишилися.

source: failed to unpack HEAD tree object
uk: збій розпакування об’єкту дерева HEAD

source: unable to create temporary index
uk: не вдається створити тимчасовий індекс

source: interactive add failed
uk: збій інтерактивного додавання

source: unable to update temporary index
uk: не вдалося оновити тимчасовий індекс

source: Failed to update main cache tree
uk: Збій при оновленні основного кешу дерева

source: unable to write new_index file
uk: не вдалося записати файл new_index

source: cannot do a partial commit during a merge.
uk: неможливо створити частковий коміт під час злиття.

source: cannot do a partial commit during a cherry-pick.
uk: неможливо створити частковий коміт під час висмикування.

source: cannot read the index
uk: неможливо прочитати індекс

source: unable to write temporary index file
uk: неможливо записати тимчасовий індексний файл

source: commit '%s' lacks author header
uk: в коміті «%s» відсутній автор у заголовку

source: commit '%s' has malformed author line
uk: в коміті «%s» автор у невірному форматі

source: malformed --author parameter
uk: параметр --author у невірному форматі

source: unable to select a comment character that is not used in the current commit message
uk: неможливо вибрати символ коментаря, який не використовується у поточному повідомленні коміту

source: could not lookup commit %s
uk: не вдалося запитати коміт %s

source: (reading log message from standard input)
uk: (читання файлу журналу із стандартного вводу)

source: could not read log from standard input
uk: не вдалося прочитати файл журналу із стандартного вводу

source: could not read log file '%s'
uk: не вдалося прочитати файл журналу «%s»

source: could not read SQUASH_MSG
uk: не вдалося прочитати SQUASH_MSG

source: could not read MERGE_MSG
uk: не вдалося прочитати MERGE_MSG

source: could not write commit template
uk: не вдалося записати шаблон опису коміту

source: It looks like you may be committing a merge. If this is not correct, please remove the file %s and try again.
uk: Схоже, що Ви намагаєтеся створити коміт злиття. Якщо це помилка, будь ласка вилучіть файл %s та спробуйте знову.

source: It looks like you may be committing a cherry-pick. If this is not correct, please remove the file %s and try again.
uk: Схоже, що Ви намагаєтеся створити коміт висмикування. Якщо це помилка, будь ласка вилучіть файл %s та спробуйте знову.

source: Please enter the commit message for your changes. Lines starting with '%c' will be ignored, and an empty message aborts the commit.
uk: Будь ласка, уведіть повідомлення коміту для ваших змін. Рядки, що починаються з «%c» будуть знехтувані, а порожнє повідомлення скасовує процес коміту.

source: Please enter the commit message for your changes. Lines starting with '%c' will be kept; you may remove them yourself if you want to. An empty message aborts the commit.
uk: Будь ласка, уведіть повідомлення коміту для ваших змін. Рядки, що починаються з «%c» будуть залишені; ви можете вилучити їх вручну, якщо волієте. Порожнє повідомлення скасовує процес коміту.

source: %sAuthor: %.*s <%.*s>
uk: %sАвтор: %.*s <%.*s>

source: %sDate: %s
uk: %sДата: %s

source: %sCommitter: %.*s <%.*s>
uk: %sКомітер: %.*s <%.*s>

source: Cannot read index
uk: Не вдається прочитати індекс

source: Error building trees
uk: Помилка при побудові дерев

source: Please supply the message using either -m or -F option.
uk: Будь ласка, вкажіть повідомлення, при вказуванні опцій -m або -F.

source: --author '%s' is not 'Name <email>' and matches no existing author
uk: --author «%s» не у форматі «Ім’я <пошта>» й не збігається з існуючим автором

source: Invalid ignored mode '%s'
uk: Неприпустимий режим показу ігнорованих файлів «%s»

source: Invalid untracked files mode '%s'
uk: Неправильний режим невідстежуваних файлів «%s»

source: --long and -z are incompatible
uk: --long та -z неможливо використовувати одночасно

source: Using both --reset-author and --author does not make sense
uk: Використовувати --reset-author та --author одночасно не має сенсу

source: You have nothing to amend.
uk: Нічого виправляти.

source: You are in the middle of a merge -- cannot amend.
uk: Ви у процесі злиття — наразі виправлення неможливе.

source: You are in the middle of a cherry-pick -- cannot amend.
uk: Ви у процесі висмикування — наразі виправлення неможливе.

source: Options --squash and --fixup cannot be used together
uk: Опції --squash та --fixup неможливо використовувати разом

source: Only one of -c/-C/-F/--fixup can be used.
uk: Дозволено використовувати лише одну з опцій -c/-C/-F/--fixup.

source: Option -m cannot be combined with -c/-C/-F.
uk: Параметр -m не може бути скомбінований з -c/-C/-F.

source: --reset-author can be used only with -C, -c or --amend.
uk: --reset-author можливо використовувати лише з -C, -c або --amend.

source: Only one of --include/--only/--all/--interactive/--patch can be used.
uk: Дозволено використовувати лише одну з опцій --include/--only/--all/--interactive/--patch.

source: No paths with --include/--only does not make sense.
uk: Зазначення шляхів каталогів з опціями --include/--only не має сенсу.

source: Invalid cleanup mode %s
uk: Неправильне значення режиму очистки %s

source: Paths with -a does not make sense.
uk: З опцією -a зазначення шляху не має сенсу.

source: show status concisely
uk: коротко показати стан

source: show branch information
uk: показати відомості про гілку

source: show stash information
uk: показати відомості про приховування

source: compute full ahead/behind values
uk: обчислити повні значення попереду/позаду

source: version
uk: версія

source: machine-readable output
uk: машиночитний вивід

source: show status in long format (default)
uk: показати стан у довгому форматі (типово)

source: terminate entries with NUL
uk: завершувати записи НУЛЬОВИМ байтом NUL

source: mode
uk: режим

source: show untracked files, optional modes: all, normal, no. (Default: all)
uk: показати невідстежувані файли, опційні режими: all (усі), normal (як зазвичай), no (немає). (Типово: all)

source: show ignored files, optional modes: traditional, matching, no. (Default: traditional)
uk: показувати ігноровані файли, необов'язкові режими: traditional (традиційний), matching (тільки збіги), no (не показувати). (Типове значення: traditional)

source: when
uk: коли

source: ignore changes to submodules, optional when: all, dirty, untracked. (Default: all)
uk: нехтувати зміни у підмодулях, опційно коли: all (завжди), dirty (змінені), untracked (невідстежувані). (Типово: all)

source: list untracked files in columns
uk: показати невідстежувані файли по стовпчикам

source: Unsupported combination of ignored and untracked-files arguments
uk: Непідтримувана комбінація аргументів відображення ігнорованих і невідслідковуваних файлів

source: suppress summary after successful commit
uk: не виводити зведення після успішного коміту

source: show diff in commit message template
uk: додати перелік змін до шаблону повідомлення коміту

source: Commit message options
uk: Опції повідомлення коміту

source: read message from file
uk: прочитати повідомлення із файлу

source: author
uk: автор

source: override author for commit
uk: підмінити автора коміту

source: date
uk: дата

source: override date for commit
uk: підмінити дату коміту

source: message
uk: повідомлення

source: commit message
uk: повідомлення коміту

source: commit
uk: коміт

source: reuse and edit message from specified commit
uk: використати й відредагувати повідомлення від вказаного коміту

source: reuse message from specified commit
uk: використовувати повторно повідомлення вказаного коміту

source: use autosquash formatted message to fixup specified commit
uk: використовувати форматоване повідомлення автоущільнення для виправлення вказаного коміту

source: use autosquash formatted message to squash specified commit
uk: використовувати форматоване повідомлення автоущільнення для ущільнення вказаного коміту

source: the commit is authored by me now (used with -C/-c/--amend)
uk: коміт тепер за моїм авторством (з використанням -C/-c/--amend)

source: add Signed-off-by:
uk: додати Signed-off-by:

source: use specified template file
uk: використовувати вказаний файл шаблону

source: force edit of commit
uk: примусово редагувати коміт

source: default
uk: типово

source: how to strip spaces and #comments from message
uk: як вилучати пробіли і #коментарі з повідомлення коміту

source: include status in commit message template
uk: включити статус файлів у шаблон повідомлення коміту

source: GPG sign commit
uk: підписати коміт за допомогою GPG

source: Commit contents options
uk: Опції вмісту коміту

source: commit all changed files
uk: закомітити усі змінені файли

source: add specified files to index for commit
uk: додати вказані файли у індекс для коміту

source: interactively add files
uk: інтерактивне додавання файлів

source: interactively add changes
uk: інтерактивне додавання змін

source: commit only specified files
uk: закомітити лише вказані файли

source: bypass pre-commit and commit-msg hooks
uk: пропустити перехоплювач pre-commit та commit-msg hooks

source: show what would be committed
uk: показати, що буде закомічене

source: amend previous commit
uk: виправити попередній коміт

source: bypass post-rewrite hook
uk: пропустити перехоплювач після-перезапису

source: ok to record an empty change
uk: дозволити запис порожнього коміту

source: ok to record a change with an empty message
uk: дозволити запис змін з порожнім повідомленням

source: Corrupt MERGE_HEAD file (%s)
uk: Пошкоджено файл MERGE_HEAD (%s

source: could not read MERGE_MODE
uk: не вдалося прочитати MERGE_MODE

source: could not read commit message: %s
uk: не вдалося відкрити повідомлення коміту: %s

source: Aborting commit due to empty commit message.
uk: Скасування коміту через порожнє повідомлення коміту.

source: Aborting commit; you did not edit the message.
uk: Скасування коміту; ви не змінили повідомлення.

source: dir
uk: каталог

source: git config [<options>]
uk: git config [<опції>]

source: Config file location
uk: Розташування файла налаштувань

source: use global config file
uk: використовувати загальний файл налаштувань

source: use system config file
uk: використовувати загальносистемний файл налаштувань

source: use repository config file
uk: використовувати файл налаштувань сховища

source: use given config file
uk: використовувати вказаний файл налаштувань

source: blob-id
uk: ідент-двійк-об’єкту

source: read config from given blob object
uk: прочитати налаштування із вказаного двійкового об’єкту

source: Action
uk: Дія

source: get value: name [value-regex]
uk: отримати значення: ім’я [шаблон-значень]

source: get all values: key [value-regex]
uk: отримати усі значення: ключ [шаблон-значень]

source: get values for regexp: name-regex [value-regex]
uk: отримати значення по шаблону: шаблон-імен [шаблон-значень]

source: get value specific for the URL: section[.var] URL
uk: отримати значення, специфічне для URL: розділ[.змінна] URL

source: replace all matching variables: name value [value_regex]
uk: замінити усі відповідні змінні: ім’я значення [шаблон-значень]

source: add a new variable: name value
uk: додати нову змінну: ім’я значення

source: remove a variable: name [value-regex]
uk: вилучити змінну: ім’я [шаблон-значень]

source: remove all matches: name [value-regex]
uk: вилучити усі, що збігаються: ім’я [шаблон-значень]

source: rename section: old-name new-name
uk: перейменувати розділ: старе-ім’я нове-ім’я

source: remove a section: name
uk: вилучити розділ: ім’я

source: list all
uk: показати увесь список

source: open an editor
uk: відкрити редактор

source: find the color configured: slot [default]
uk: знайти налаштований колір: розділ [типово]

source: find the color setting: slot [stdout-is-tty]
uk: перевірити, чи існує налаштований колір: розділ [stdout-є-tty]

source: Type
uk: Тип

source: value is "true" or "false"
uk: значення дорівнює «true» (істина) або «false» (хиба)

source: value is decimal number
uk: значення є десятковим числом

source: value is --bool or --int
uk: значення має тип --bool або --int

source: value is a path (file or directory name)
uk: значення є шляхом (ім’я файлу або каталогу)

source: value is an expiry date
uk: значення являє собою дату закінчення терміну дії

source: Other
uk: Інше

source: terminate values with NUL byte
uk: завершувати значення НУЛЬОВИМ байтом

source: show variable names only
uk: показувати лише імена змінних

source: respect include directives on lookup
uk: враховувати директиви include (включення файлів) при запиті

source: show origin of config (file, standard input, blob, command line)
uk: показати джерело конфігурації (файл, стандартне введення, двійковий об'єкт, командний рядок)

source: unable to parse default color value
uk: не вдалося розібрати значення типового кольору

source: # This is Git's per-user configuration file. [user] # Please adapt and uncomment the following lines: # name = %s # email = %s
uk: # Це файл конфігурації користувача Git. [user] # Будь ласка, адаптуйте і розкоментуйте такі рядки: # user = %s # email = %s

source: --local can only be used inside a git repository
uk: --local можливо використовувати лише всередині git-сховища

source: cannot create configuration file %s
uk: не вдалося створити файл конфігурації %s

source: cannot overwrite multiple values with a single value Use a regexp, --add or --replace-all to change %s.
uk: неможливо перезаписати декілька значень одним Використовуйте регулярні вирази, параметри --add або --replace-all, щоб змінити %s.

source: print sizes in human readable format
uk: вивід розмірів у зручному для читання людиною вигляді

source: git describe [<options>] [<commit-ish>...]
uk: git describe [<опції>] [<вказівник-коміту>…]

source: git describe [<options>] --dirty
uk: git describe [<опції>] --dirty

source: head
uk: вказівник на гілку

source: lightweight
uk: легковагий

source: annotated
uk: анотований

source: annotated tag %s not available
uk: аннотована мітка %s недоступна

source: annotated tag %s has no embedded name
uk: аннотована мітка %s не містить вбудованої назви

source: tag '%s' is really '%s' here
uk: мітка «%s» вже тут «%s»

source: no tag exactly matches '%s'
uk: немає міток, що відповідають точно «%s»

source: No exact match on refs or tags, searching to describe
uk: Немає точних збігів за посиланнями чи тегами, шукаємо опис

source: finished search at %s
uk: пошук завершено за %s

source: No annotated tags can describe '%s'. However, there were unannotated tags: try --tags.
uk: Немає анотованих міток, які можуть дати опис «%s». Але є неанотовані мітки: спробуйте додати параметр --tags.

source: No tags can describe '%s'. Try --always, or create some tags.
uk: Немає міток, які можуть дати опис «%s…. Спробуйте додати параметр --always або створити які-небудь мітки.

source: traversed %lu commits
uk: відвідано %lu комітів

source: more than %i tags found; listed %i most recent gave up search at %s
uk: більше %i міток знайдено; показано останні %i зупинено пошук після %s

source: describe %s
uk: надати опис %s

source: Not a valid object name %s
uk: Не є коректною назвою об’єкта: %s

source: %s is neither a commit nor blob
uk: %s не є комітом чи двійковим об'єктом

source: find the tag that comes after the commit
uk: пошук мітки, яка йде після коміту

source: debug search strategy on stderr
uk: вивід зневаджувальної інформації стратегії пошуку на стандартний вивід

source: use any ref
uk: використовувати будь-яке посилання

source: use any tag, even unannotated
uk: використовувати будь-яку мітку, навіть неанотовану

source: always use long format
uk: завжди використовувати довгий формат виводу

source: only follow first parent
uk: слідувати лише за першим батьком

source: only output exact matches
uk: виводити лише точні збіги

source: consider <n> most recent tags (default: 10)
uk: розглядати останні <n> міток (типово: 10)

source: only consider tags matching <pattern>
uk: розлядати лише мітки по <шаблону>

source: do not consider tags matching <pattern>
uk: не враховувати мітки, що відповідают <шаблону>

source: show abbreviated commit object as fallback
uk: якщо не знайдено, показати скорочений номер ревізії коміту

source: mark
uk: позначка

source: append <mark> on dirty working tree (default: "-dirty")
uk: додати <позначку> при зміненому робочому каталозі (типово: «-dirty»)

source: append <mark> on broken working tree (default: "-broken")
uk: додати <позначку> на пошкоджене робоче дерево (типово: «-broken»)

source: --long is incompatible with --abbrev=0
uk: --long несумісно з --abbrev=0

source: No names found, cannot describe anything.
uk: Імена не знайдені, не можу нічого описати.

source: --dirty is incompatible with commit-ishes
uk: --dirty несумісно з зазначенням вказівників комітів

source: --broken is incompatible with commit-ishes
uk: --broken несумісне із зазначенням вказівників комітів

source: '%s': not a regular file or symlink
uk: «%s»: не є звичайним файлом або символічним посиланням

source: invalid option: %s
uk: некоректний параметр: %s

source: Not a git repository
uk: Не є сховищем git

source: invalid object '%s' given.
uk: переданий неправильний об’єкт «%s».

source: more than two blobs given: '%s'
uk: передано більше двох двійкових об’єктів: «%s»

source: unhandled object '%s' given.
uk: переданий неопрацьований об’єкт «%s».

source: git difftool [<options>] [<commit> [<commit>]] [--] [<path>...]
uk: git difftool [<опції>] [<коміт> [<коміт>]] [--] [<шлях>…]

source: failed: %d
uk: збій: %d

source: could not read symlink %s
uk: неможливо прочитати символьне посилання %s

source: could not read symlink file %s
uk: неможливо прочитати файл символьного посилання %s

source: could not read object %s for symlink %s
uk: неможливо прочитати об'єкт %s для символьного посилання %s

source: combined diff formats('-c' and '--cc') are not supported in directory diff mode('-d' and '--dir-diff').
uk: комбіновані формати різниць («-c» и «--cc») не підтримуються в режимі порівняння каталогів («-d» и «--dir-diff»).

source: both files modified: '%s' and '%s'.
uk: обидва файли змінені: «%s» та «%s».

source: working tree file has been left.
uk: робочий каталог залишений.

source: temporary files exist in '%s'.
uk: тимчасові файли вже знаходяться в «%s».

source: you may want to cleanup or recover these.
uk: можливо ви бажаєте очистити чи відновити їх.

source: use `diff.guitool` instead of `diff.tool`
uk: використовувати «diff.guitool» замість «diff.tool»

source: perform a full-directory diff
uk: виконати пофайлове порівняння всього каталогу

source: do not prompt before launching a diff tool
uk: не питати перед запуском засобу порівняння

source: use symlinks in dir-diff mode
uk: використовувати символьні посилання в режимі порівняння каталогу

source: use the specified diff tool
uk: використовувати вказаний засіб порівняння

source: print a list of diff tools that may be used with `--tool`
uk: вивести список засобів, які можна використовувати з параметром «--tool»

source: make 'git-difftool' exit when an invoked diff tool returns a non - zero exit code
uk: виходити з «git-difftool», якщо викликаний засіб порівняння повернув ненульовий код завершення

source: specify a custom command for viewing diffs
uk: вкажіть власну команду для перегляду різниць

source: no <tool> given for --tool=<tool>
uk: не передано <інструмент> для --tool=<інструмент>

source: no <cmd> given for --extcmd=<cmd>
uk: не передана <команда> для --extcmd=<команда>

source: git fast-export [rev-list-opts]
uk: git fast-export [опції-rev-list]

source: show progress after <n> objects
uk: показати поступ після <n> об’єктів

source: select handling of signed tags
uk: вибір опрацювання підписаних міток

source: select handling of tags that tag filtered objects
uk: вибір опрацювання міток, якими помічені відфільтровані об’єкти

source: Dump marks to this file
uk: Записати позначки у цей файл

source: Import marks from this file
uk: Імпортувати позначки з цього файлу

source: Fake a tagger when tags lack one
uk: Підробити автора мітки, якщо у мітки він відсутній

source: Output full tree for each commit
uk: Вивести повне дерево для кожного коміту

source: Use the done feature to terminate the stream
uk: Використовувати помітку завершення у кінці потоку

source: Skip output of blob data
uk: Не виводити дані двійкових об'єктів

source: refspec
uk: специфікація посилання

source: Apply refspec to exported refs
uk: Застосувати специфікацію посилання до експортованих посилань

source: anonymize output
uk: зробити вивід анонімним

source: git fetch [<options>] [<repository> [<refspec>...]]
uk: git fetch [<опції>] [<сховище> [<специфікація-посилання>…]]

source: git fetch [<options>] <group>
uk: git fetch [<параметри>] <група>

source: git fetch --multiple [<options>] [(<repository> | <group>)...]
uk: git fetch --multiple [<опції>] [(<сховище> | <група>)…]

source: git fetch --all [<options>]
uk: git fetch --all [<параметри>]

source: fetch from all remotes
uk: здобути зміни з усіх зовнішніх віддалених сховищ

source: append to .git/FETCH_HEAD instead of overwriting
uk: дописати до .git/FETCH_HEAD замість перезапису

source: path to upload pack on remote end
uk: шлях до проґрами запакування паки на машині з віддаленим сховищем

source: fetch from multiple remotes
uk: здобути зміни з декількох віддалених сховищ

source: fetch all tags and associated objects
uk: здобути усі мітки й пов’язані об’єкти

source: do not fetch all tags (--no-tags)
uk: не здобувати усі мітки (--no-tags)

source: number of submodules fetched in parallel
uk: кількість підмодулей, що будуть здобуті паралельно

source: prune remote-tracking branches no longer on remote
uk: почистити відстежувані зовнішні гілки, яких вже немає на віддаленому сховищі

source: prune local tags no longer on remote and clobber changed tags
uk: почистити локальні мітки, яких вже немає на змінені з clobber мітки

source: on-demand
uk: за вимогою

source: control recursive fetching of submodules
uk: керування рекурсивним здобуванням підмодулів

source: keep downloaded pack
uk: зберегти отриманий пакунок

source: allow updating of HEAD ref
uk: дозволити оновлення посилання HEAD

source: deepen history of shallow clone
uk: глибока історія часткового клону
