Repository: PlagaMedicum/Ubuntu-Translation-Demo
Catalog: rosetta-eoan/*/LC_MESSAGES/git.po
Languages: uk

source: First, rewinding head to replay your work on top of it...
uk: Спочатку перемотуємо вказівник поточного коміту, щоб застосувати Ваші зміни поверх нього…

source: Fast-forwarded $branch_name to $onto_name.
uk: Перемотана вперед $branch_name до $onto_name.

source: git stash clear with parameters is unimplemented
uk: git stash очистка з параметрами не реалізована

source: You do not have the initial commit yet
uk: В Вас ще немає початкового коміту

source: Cannot save the current index state
uk: Не вдалося зберегти поточний стан індексу

source: Cannot save the untracked files
uk: Неможливо зберегти невідслідковувані файли

source: Cannot save the current worktree state
uk: Не вдалося зберегти поточний стан робочого каталогу

source: No changes selected
uk: Змін не обрано

source: Cannot remove temporary index (can't happen)
uk: Не вдалося вилучити тимчасовий індекс (не має траплятися)

source: Cannot record working tree state
uk: Не вдалося записати стан робочого каталогу

source: Cannot update $ref_stash with $w_commit
uk: Не вдалося оновити $ref_stash за допомогою $w_commit

source: error: unknown option for 'stash push': $option
uk: помилка: невідомий параметр для «stash push»: $option

source: Can't use --patch and --include-untracked or --all at the same time
uk: Неможливо використовувати --patch та --include-untracked або --all одночасно

source: No local changes to save
uk: Немає локальних змін для збереження

source: Cannot initialize stash
uk: Не вдалося ініціалізувати сховані зміни

source: Cannot save the current status
uk: Не вдалося зберегти поточний статус

source: Saved working directory and index state $stash_msg
uk: Робочий каталог та індекс стану збережені $stash_msg

source: Cannot remove worktree changes
uk: Не вдалося вилучити зміни робочого каталогу

source: unknown option: $opt
uk: невідома опція: $opt

source: No stash entries found.
uk: Не знайдені приховані зміни

source: Too many revisions specified: $REV
uk: Зазначено забагато редакцій: $REV

source: $reference is not a valid reference
uk: $reference не є дійсним посиланням

source: '$args' is not a stash-like commit
uk: «$args» не схоже на коміт із схованими змінами

source: '$args' is not a stash reference
uk: «$args» не є посиланням на сховані зміни

source: unable to refresh index
uk: не вдалося оновити індекс

source: Cannot apply a stash in the middle of a merge
uk: Неможна застосувати сховані зміни під час виконання злиття

source: Conflicts in index. Try without --index.
uk: Конфлікти в індексі. Спробуйте без --index.

source: Could not save index tree
uk: Не вдалося зберегти дерево індексу

source: Could not restore untracked files from stash entry
uk: Неможливо відновити невідслідковувані файли зі схованих змін

source: Cannot unstage modified files
uk: Неможливо прибрати із індексу змінені файли

source: Index was not unstashed.
uk: Індекс не був достатий із схованих змін.

source: The stash entry is kept in case you need it again.
uk: Сховані зміни збережені на той випадок, якщо вони знову будуть потрібні.

source: Dropped ${REV} ($s)
uk: Відкинуто ${REV} ($s)

source: ${REV}: Could not drop stash entry
uk: ${REV}: Не вдалося відкинути запис із схованих змін

source: No branch name specified
uk: Не вказано ім’я гілки

source: (To restore them type "git stash apply")
uk: (Щоб відновити їх, наберіть «git stash apply»)

source: Relative path can only be used from the toplevel of the working tree
uk: Відносний шлях можна використовувати лише знаходячись на верхівці робочого каталогу

source: repo URL: '$repo' must be absolute or begin with ./|../
uk: URL сховища: «$repo» має бути абсолютною або починатися з ./|../

source: '$sm_path' already exists in the index
uk: «$sm_path» вже міститься в індексі

source: '$sm_path' already exists in the index and is not a submodule
uk: «$sm_path» вже міститься в індексі і не є підмодулем

source: The following path is ignored by one of your .gitignore files: $sm_path Use -f if you really want to add it.
uk: Наступні шляхи нехтуються одним з Ваших файлів .gitignore: $sm_path Використовуйте опцію -f, якщо Ви справді бажаєте його додати.

source: Adding existing repo at '$sm_path' to the index
uk: Додаю наявне сховище із «$sm_path» в індекс

source: '$sm_path' already exists and is not a valid git repo
uk: «$sm_path» вже існує й не є дійсним сховищем git

source: A git directory for '$sm_name' is found locally with remote(s):
uk: Каталог git для «$sm_name» знайдений локально на віддалених сховищах:

source: If you want to reuse this local git directory instead of cloning again from $realrepo use the '--force' option. If the local git directory is not the correct repo or you are unsure what this means choose another name with the '--name' option.
uk: Якщо ви бажаєте повторно використати локальний каталог git замість повторного клонування з $realrepo то використовуйте параметр «--force». Якщо ж локальний каталог git не є належним сховищем або якщо ви не розумієте, що це означає тоді вкажіть іншу назву для підмодуля за допомогою параметра «--name».

source: Reactivating local git directory for submodule '$sm_name'.
uk: Відновлення локального каталогу git для підмодулю «$sm_name».

source: Unable to checkout submodule '$sm_path'
uk: Не вдалося перейти на стан у підмодулю «$sm_path»

source: Failed to add submodule '$sm_path'
uk: Збій додавання підмодуля «$sm_path»

source: Failed to register submodule '$sm_path'
uk: Не вдалося зареєструвати підмодуль «$sm_path»

source: Unable to find current revision in submodule path '$displaypath'
uk: Не вдалося знайти поточну редакцію для підмодуля за шляхом «$displaypath»

source: Unable to fetch in submodule path '$sm_path'
uk: Не вдалося виконати видобування для підмодуля за шляхом «$sm_path»

source: Unable to find current ${remote_name}/${branch} revision in submodule path '$sm_path'
uk: Не вдалося знайти поточну редакцію ${remote_name}/${branch} для подмодуля за шляхом «$sm_path»

source: Unable to fetch in submodule path '$displaypath'
uk: Не вдалося виконати видобування змін для підмодуля за шляхом «$displaypath»

source: Fetched in submodule path '$displaypath', but it did not contain $sha1. Direct fetching of that commit failed.
uk: Видобуті зміни за шляхом підмодуля «$displaypath», але вони не містять $sha1. Невдале пряме видобування змін коміту.

source: Unable to checkout '$sha1' in submodule path '$displaypath'
uk: Не вдалося виконати перехід на стан «$sha1» для підмодулю за шляхом «$displaypath»

source: Submodule path '$displaypath': checked out '$sha1'
uk: Підмодуль за шляхом «$displaypath»: забрано стан «$sha1»

source: Unable to rebase '$sha1' in submodule path '$displaypath'
uk: Не вдалося перебазувати «$sha1» для підмодуля за шляхом «$displaypath»

source: Submodule path '$displaypath': rebased into '$sha1'
uk: Підмодуль за шляхом «$displaypath»: перебазований над «$sha1»

source: Unable to merge '$sha1' in submodule path '$displaypath'
uk: Не вдалося виконати злиття з «$sha1» для підмодулю за шляхом «$displaypath»

source: Submodule path '$displaypath': merged in '$sha1'
uk: Підмодуль за шляхом «$displaypath»: злито з «$sha1»

source: Execution of '$command $sha1' failed in submodule path '$displaypath'
uk: Збій виконання «$command $sha1» для подмодуля за шляхом «$displaypath»

source: Submodule path '$displaypath': '$command $sha1'
uk: Подмодуль за шляхом «$displaypath»: «$command $sha1»

source: Failed to recurse into submodule path '$displaypath'
uk: Не вдалося виконати рекурсивно для підмодуля за шляхом «$displaypath»

source: The --cached option cannot be used with the --files option
uk: Опцію --cached неможливо використовувати одночасно з опцією --files

source: unexpected mode $mod_dst
uk: невідомий режим $mod_dst

source: Warn: $display_name doesn't contain commit $sha1_src
uk: Попередження: $display_name не містить коміт $sha1_src

source: Warn: $display_name doesn't contain commit $sha1_dst
uk: Попередження: $display_name не містить коміт $sha1_dst

source: Warn: $display_name doesn't contain commits $sha1_src and $sha1_dst
uk: Попередження: $display_name не містить коміти $sha1_src та $sha1_dst

source: See git-${cmd}(1) for details.
uk: Додаткові відомості див. git-${cmd}(1).

source: Rebasing ($new_count/$total)
uk: Перебазування ($new_count/$total)

source: You can amend the commit now, with git commit --amend $gpg_sign_opt_quoted Once you are satisfied with your changes, run git rebase --continue
uk: Тепер ви можете виправити коміт за допомогою git commit --amend $gpg_sign_opt_quoted Щойно ви будете задоволені результатом, виконайте git rebase --continue

source: $sha1: not a commit that can be picked
uk: $sha1: не є комітом, який можливо взяти

source: Invalid commit name: $sha1
uk: Неприпустима назва коміта: $sha1

source: Cannot write current commit's replacement sha1
uk: Неможливо записати заміну sha1 поточного коміта

source: Fast-forward to $sha1
uk: Перемотування вперед до $sha1

source: Cannot fast-forward to $sha1
uk: Неможливо перемотати вперед до $sha1

source: Cannot move HEAD to $first_parent
uk: Неможливо переместить HEAD на $first_parent

source: Refusing to squash a merge: $sha1
uk: Неможливо зчавити злиття: $sha1

source: Error redoing merge $sha1
uk: Помилка повторення злиття $sha1

source: Could not pick $sha1
uk: Неможливо взяти $sha1

source: This is the commit message #${n}:
uk: Це повідомлення коміту номер #${n}:

source: The commit message #${n} will be skipped:
uk: Повідомлення коміту номер #${n} буде пропущене:

source: This is a combination of $count commit.
uk: Це об'єднання $count коміта

source: Cannot write $fixup_msg
uk: Неможливо записати $fixup_msg

source: This is a combination of 2 commits.
uk: Це об'єднання двох комітів.

source: Could not apply $sha1... $rest
uk: Не вдалося застосувати $sha1… $rest

source: Could not amend commit after successfully picking $sha1... $rest This is most likely due to an empty commit message, or the pre-commit hook failed. If the pre-commit hook failed, you may need to resolve the issue before you are able to reword the commit.
uk: Не вдалося виправити коміт після успішного переходу на $sha1… $rest Це швидше за все сталося внаслідок порожнього повідомлення коміту або збою гака перед комітом. Якщо ж це сталося через збій гака перед комітом, то ви маєте виправити помилку перед зміною коміта.

source: Stopped at $sha1_abbrev... $rest
uk: Зупинено на $sha1_abbrev… $rest

source: Cannot '$squash_style' without a previous commit
uk: Неможливо виконати «$squash_style» без зазначення попереднього коміту

source: Executing: $rest
uk: Виконання: $rest

source: Execution failed: $rest
uk: Не вдалося виконати: $rest

source: and made changes to the index and/or the working tree
uk: і були зроблені зміни в індексі та/або робочому каталозі

source: You can fix the problem, and then run git rebase --continue
uk: Ви можете виправити помилку, а потім виконати git rebase --continue

source: Execution succeeded: $rest but left changes to the index and/or the working tree Commit or stash your changes, and then run git rebase --continue
uk: Успішне виконання: $rest але залишились зміни в індексі та/або робочому каталозі Зробіть коміт або сховайте ваші зміни, а потім виконайте git rebase --continue

source: Unknown command: $command $sha1 $rest
uk: Невідома команда: $command $sha1 $rest

source: Please fix this using 'git rebase --edit-todo'.
uk: Прохання виправити це за допомогою «git rebase --edit-todo».

source: Successfully rebased and updated $head_name.
uk: Успішно перебазовано та оновлено $head_name.

source: Could not remove CHERRY_PICK_HEAD
uk: Неможливо вилучити CHERRY_PICK_HEAD

source: You have staged changes in your working tree. If these changes are meant to be squashed into the previous commit, run: git commit --amend $gpg_sign_opt_quoted If they are meant to go into a new commit, run: git commit $gpg_sign_opt_quoted In both cases, once you're done, continue with: git rebase --continue
uk: Ви маєте споряджені зміни в робочому каталозі. Якщо ці зміни мають бути зчавлені з попереднім комітом, то виконайте: git commit --amend $gpg_sign_opt_quoted Якщо ж вони мають піти в інший коміт, то виконайте: git commit $gpg_sign_opt_quoted В будь-якому разі, пі сля того, як все зроблено, продовжіть перебазування виконавши: git rebase --continue

source: Error trying to find the author identity to amend commit
uk: Помилка про спробі пошуку автора для виправлення коміту.

source: You have uncommitted changes in your working tree. Please commit them first and then run 'git rebase --continue' again.
uk: Ви маєте незакомічені зміни в робочому каталозі. Створіть з них коміт, потім виконайте «git rebase --continue» знову.

source: Could not commit staged changes.
uk: Неможливо закомітити споряджені зміни.

source: Could not execute editor
uk: Неможливо запустити редактор

source: Could not checkout $switch_to
uk: Неможливо перейти на версію $switch_to

source: No HEAD?
uk: Немає вказівника HEAD?

source: Could not create temporary $state_dir
uk: Неможливо створити тимчасовий каталог $state_dir

source: Could not mark as interactive
uk: Неможливо позначити як інтерактивний

source: Rebase $shortrevisions onto $shortonto ($todocount command)
uk: Перебазування $shortrevisions над $shortonto ($todocount команда)

source: Could not init rewritten commits
uk: Неможливо ініціалізувати перезаписані коміти

source: usage: $dashless $USAGE
uk: використання: $dashless $USAGE

source: Cannot chdir to $cdup, the toplevel of the working tree
uk: Неможливо виконати chdir в $cdup, верхівку робочого каталога

source: fatal: $program_name cannot be used without a working tree.
uk: критична помилка: $program_name неможливо використовувати не маючи робочого каталогу

source: Cannot rebase: You have unstaged changes.
uk: Неможливо перебазувати: У вас є неспоряджені зміни.

source: Cannot rewrite branches: You have unstaged changes.
uk: Неможливо перезаписати гілки: У вас є неспоряджені зміни.

source: Cannot pull with rebase: You have unstaged changes.
uk: Неможливо стягнути зміни з перебазуванням: У вас є неспоряджені зміни.

source: Cannot $action: You have unstaged changes.
uk: Неможливо виконати $action: У вас є неспоряджені зміни.

source: Cannot rebase: Your index contains uncommitted changes.
uk: Неможливо перебазувати: У вас є незакомічені зміни.

source: Cannot pull with rebase: Your index contains uncommitted changes.
uk: Неможливо стягнути зміни з перебазуванням: У вашому індексі є незакомічені зміни.

source: Cannot $action: Your index contains uncommitted changes.
uk: Неможливо виконати $action: У вашому індексі є незакомічені зміни.

source: Additionally, your index contains uncommitted changes.
uk: До того-ж, у Вашому індексі є незакоммічені зміни.

source: You need to run this command from the toplevel of the working tree.
uk: Вам слід виконувати цю команду знаходячись на верхівці робочого каталогу.

source: Unable to determine absolute path of git directory
uk: Неможливо визначити абсолютний шлях до каталогу git

source: staged
uk: споряджено

source: unstaged
uk: неспоряджено

source: binary
uk: двійковий

source: nothing
uk: нічого

source: unchanged
uk: без змін

source: added %d path
uk: доданий %d шлях

source: updated %d path
uk: оновлений %d шлях

source: reverted %d path
uk: повернуто зміни %d шляху

source: touched %d path
uk: зачеплено %d шлях

source: Update
uk: Оновити

source: Revert
uk: Повернути

source: note: %s is untracked now.
uk: примітка: %s теперь невідслідковуваний.

source: Add untracked
uk: Додати невідслідковуваний

source: No untracked files.
uk: Немає невідслідковуваних файлів.

source: If the patch applies cleanly, the edited hunk will immediately be marked for staging.
uk: Якщо латка застосовується без помилок, то змінений блок буде одразу позначений для спорядження.

source: If the patch applies cleanly, the edited hunk will immediately be marked for stashing.
uk: Якщо латка застосовується без помилок, то змінений блок буде одразу позначений для приховування.

source: If the patch applies cleanly, the edited hunk will immediately be marked for unstaging.
uk: Якщо латка застосовується без помилок, то змінений блок буде одразу позначений для прибирання зі спорядження.

source: If the patch applies cleanly, the edited hunk will immediately be marked for applying.
uk: Якщо латка застосовується без помилок, то змінений блок буде одразу позначений для застосування.

source: If the patch applies cleanly, the edited hunk will immediately be marked for discarding.
uk: Якщо латка застосовується без помилок, то змінений блок буде одразу позначений для скасування змін.

source: failed to open hunk edit file for writing: %s
uk: не вдалося відкрити файл редагування блоку змін для запису: %s

source: Manual hunk edit mode -- see bottom for a quick guide.
uk: Ручний режим редагування блоку змін — див. нижче коротке керівництво.

source: --- To remove '%s' lines, make them ' ' lines (context). To remove '%s' lines, delete them. Lines starting with %s will be removed.
uk: --- Щоб вилучити «%s» рядки, зробіть їх ' ' рядками (контекст). Щоб вилучити «%s» рядки, видаліть їх. Рядки, що починаються з %s будут вилучені.

source: If it does not apply cleanly, you will be given an opportunity to edit again. If all lines of the hunk are removed, then the edit is aborted and the hunk is left unchanged.
uk: Якщо латка застосовується без помилок, то вам буде надана можливість змінити її знову. Якщо всі рядки блоку змін вилучені, то редагування буде перерване і блок залишиться без змін.

source: failed to open hunk edit file for reading: %s
uk: не вдалося відкрити файл редагування блоку змін для читання: %s

source: Your edited hunk does not apply. Edit again (saying "no" discards!) [y/n]?
uk: Змінений вами блок неможливо застосувати. Редагувати знову (відповідь «n» означає «не» зупиняти!) [y/n]?

source: y - stage this hunk n - do not stage this hunk q - quit; do not stage this hunk or any of the remaining ones a - stage this hunk and all later hunks in the file d - do not stage this hunk or any of the later hunks in the file
uk: y - спорядити цей блок змін n - не споряджати цей блок змін q - вихід; не споряджати цей і наступні блоки змін a - спорядити цей і всі наступні блоки змін у файлі d - не споряджати цей і наступні блоки змін у файлі

source: y - stash this hunk n - do not stash this hunk q - quit; do not stash this hunk or any of the remaining ones a - stash this hunk and all later hunks in the file d - do not stash this hunk or any of the later hunks in the file
uk: y - сховати зміни цього блоку q - вихід; не ховати зміни цього і наступних блоків a - сховати цей і всі наступні блоки змін у файлі d - не ховати цей і наступні блоки змін у файлі

source: y - unstage this hunk n - do not unstage this hunk q - quit; do not unstage this hunk or any of the remaining ones a - unstage this hunk and all later hunks in the file d - do not unstage this hunk or any of the later hunks in the file
uk: y - скасувати спорядження цього блоку змін n - не скасовувати спорядження цього блоку змін q - вихід; не скасовувати спорядження цього і наступних блоків змін a - скасувати спорядження цього і всіх наступних блоків змін у файлі d - не скасовувати спорядження цього або будь-яких наступних блоків змін у файлі

source: y - apply this hunk to index n - do not apply this hunk to index q - quit; do not apply this hunk or any of the remaining ones a - apply this hunk and all later hunks in the file d - do not apply this hunk or any of the later hunks in the file
uk: y - застосувати цей блок змін до індексу n - не застосовувати цей блок змін до індексу q - вихід; не не застосовувати цей і наступні блоки змін a - застосувати цей і всі наступні блоки змін у файлі d - не застосовувати цей і всі наступні блоки змін у файлі

source: y - discard this hunk from worktree n - do not discard this hunk from worktree q - quit; do not discard this hunk or any of the remaining ones a - discard this hunk and all later hunks in the file d - do not discard this hunk or any of the later hunks in the file
uk: y - скасувати зміни цього блоку в робочому каталозі n - не скасовувати зміни цього блоку в робочому каталозі q - вихід; не скасовувати зміни цього блоку і всіх наступних a - скасувати зміни цього і всіх наступних блоків змін у файлі d - не скасовувати зміни цього і всіх наступних блоків змін у файлі

source: y - discard this hunk from index and worktree n - do not discard this hunk from index and worktree q - quit; do not discard this hunk or any of the remaining ones a - discard this hunk and all later hunks in the file d - do not discard this hunk or any of the later hunks in the file
uk: y - скасувати зміни цього блоку в індексі і робочому каталозі n - не скасовувати зміни цього блоку в індексі і робочому каталозі q - вихід; не скасовувати зміни цього блоку і всіх наступних a - скасувати зміни цього і всіх наступних блоків змін у файлі d - не скасовувати зміни цього і всіх наступних блоків змін у файлі

source: y - apply this hunk to index and worktree n - do not apply this hunk to index and worktree q - quit; do not apply this hunk or any of the remaining ones a - apply this hunk and all later hunks in the file d - do not apply this hunk or any of the later hunks in the file
uk: y - застосувати зміни цього блоку до індексу та робочого каталогу n - не застосувати зміни цього блоку до індексу та робочого каталогу q - вихід; не застосовувати зміни цього і всіх наступних блоків a - застосувати зміни цього і всіх наступних блоків змін у файлі d - не застосовувати зміни цього і всіх наступних блоків змін у файлі

source: g - select a hunk to go to / - search for a hunk matching the given regex j - leave this hunk undecided, see next undecided hunk J - leave this hunk undecided, see next hunk k - leave this hunk undecided, see previous undecided hunk K - leave this hunk undecided, see previous hunk s - split the current hunk into smaller hunks e - manually edit the current hunk ? - print help
uk: g - вибрати блок змін, на котрий потрібно перейти / - пошук блоку змін, що відповідає регулярному виразу j - не приймати рішення по цьому блоку, перейти до наступного невирішеного блоку J - не приймати рішення по цьому блоку, перейти до наступного блоку змін k - не приймати рішення по цьому блоку, перейти до попереднього невирішеного блоку K - не приймати рішення по цьому блоку, перейти до попереднього блоку змін s - розбити поточний блок змін на блоки меншого розміру e - вручну відредагувати поточний блок змін ? - вивести довідку

source: The selected hunks do not apply to the index!
uk: Вибрані блоки змін не застосовуються до індексу!

source: Apply them to the worktree anyway?
uk: Все одно застосувати їх до робочого каталогу?

source: Nothing was applied.
uk: Нічого не застосовано.

source: ignoring unmerged: %s
uk: ігнорую незлите: %s

source: Only binary files changed.
uk: Лише зміни двійкових файлів.

source: No changes.
uk: Зміни відсутні.

source: Patch update
uk: Оновлення латки

source: Stage mode change [y,n,q,a,d%s,?]?
uk: Спорядити зміну режиму доступу [y,n,q,a,d%s,?]?

source: Stage deletion [y,n,q,a,d%s,?]?
uk: Спорядити видалення [y,n,q,a,d%s,?]?

source: Stage this hunk [y,n,q,a,d%s,?]?
uk: Спорядити цей блок змін [y,n,q,a,d%s,?]?

source: Stash mode change [y,n,q,a,d%s,?]?
uk: Сховати зміну режиму доступу [y,n,q,a,d%s,?]?

source: Stash deletion [y,n,q,a,d%s,?]?
uk: Сховати видалення [y,n,q,a,d%s,?]?

source: Stash this hunk [y,n,q,a,d%s,?]?
uk: Сховати цей блок змін [y,n,q,a,d%s,?]?

source: Unstage mode change [y,n,q,a,d%s,?]?
uk: Скасувати спорядження зміни режиму доступу [y,n,q,a,d%s,?]?

source: Unstage deletion [y,n,q,a,d%s,?]?
uk: Скасувати спорядження видалення [y,n,q,a,d%s,?]?

source: Unstage this hunk [y,n,q,a,d%s,?]?
uk: Скасувати спорядження цього блоку змін [y,n,q,a,d%s,?]?
