Repository: PlagaMedicum/Ubuntu-Translation-Demo
Catalog: rosetta-eoan/*/LC_MESSAGES/git.po
Languages: uk

source: %s: '%s' is outside repository
uk: %s: «%s» поза сховищем

source: '%s' (mnemonic: '%c')
uk: «%s» (мнемоніка: «%c»)

source: %s: pathspec magic not supported by this command: %s
uk: %s: магічні слова у специфікації шляху не підтримуються командою: %s

source: pathspec '%s' is beyond a symbolic link
uk: специфікація шляху «%s» знаходиться за символічним посиланням

source: unable to parse --pretty format
uk: не вдалося розібрати формат для --pretty

source: could not parse commit '%s'
uk: неможливо розібрати коміт «%s»

source: index.version set, but the value is invalid. Using version %i
uk: index.version вказаний, але значення недійсне. Використовую версію %i

source: GIT_INDEX_VERSION set, but the value is invalid. Using version %i
uk: GIT_INDEX_VERSION вказаний, але значення недійсне. Використовую версію %i

source: index file corrupt
uk: індексний файл пошкоджено

source: could not close '%s'
uk: не вдалося закрити «%s»

source: could not stat '%s'
uk: не вдалося виконати stat для «%s»

source: unable to open git dir: %s
uk: неможливо відкрити каталог git: %s

source: unable to unlink: %s
uk: неможливо від'єднати: %s

source: Do not remove any line. Use 'drop' explicitly to remove a commit.
uk: Не вилучайте рядки. Використовуйте «drop», щоб явно вилучити коміт.

source: If you remove a line here THAT COMMIT WILL BE LOST.
uk: Якщо ви вилучите рядок тут, то ВКАЗАНИЙ КОМІТ БУДЕ ВТРАЧЕНИЙ.

source: You are editing the todo file of an ongoing interactive rebase. To continue rebase after editing, run: git rebase --continue
uk: Ви наразі редагуєте файл зі списком справ для інтерактивного перебазування. Щоб продовжити перебазування після редагування файлу виконайте: git rebase --continue

source: However, if you remove everything, the rebase will be aborted.
uk: Однак, якщо ви вилучите все, то процес перебазування буде перерваний.

source: Note that empty commits are commented out
uk: Зверніть увагу, що порожні коміти закоментовані

source: could not read '%s'.
uk: неможливо прочитати «%s».

source: ignoring broken ref %s
uk: ігнорування пошкоджене посилання %s

source: could not open '%s' for writing: %s
uk: не вдалося відкрити «%s» для запису: %s

source: could not write to '%s'
uk: неможливо записати в «%s»

source: could not open '%s' for writing
uk: неможливо відкрити «%s» для запису

source: ref updates forbidden inside quarantine environment
uk: оновлення посилань заборонено в ізольованому оточенні

source: could not remove reference %s
uk: не вдалося вилучити посилання %s

source: could not delete reference %s: %s
uk: не вдалося вилучити посилання %s: %s

source: could not delete references: %s
uk: не вдалося вилучити посилання: %s

source: gone
uk: зник

source: ahead %d
uk: попереду %d

source: behind %d
uk: позаду %d

source: ahead %d, behind %d
uk: попереду %d, позаду %d

source: expected format: %%(color:<color>)
uk: очікуваний формат: %%(color:<color>)

source: unrecognized color: %%(color:%s)
uk: нерозпізнаний колір: %%(color:%s)

source: Integer value expected refname:lstrip=%s
uk: Очікується ціле значення refname:lstrip=%s

source: Integer value expected refname:rstrip=%s
uk: Очікується ціле значення refname:rstrip=%s

source: unrecognized %%(%s) argument: %s
uk: нерозпізнаний аргумент %%(%s): %s

source: %%(body) does not take arguments
uk: параметр %%(body) не приймає аргументи

source: %%(subject) does not take arguments
uk: параметр %%(subject) не приймає аргументи

source: unknown %%(trailers) argument: %s
uk: невідомий аргумент для %%(trailers): %s

source: positive value expected contents:lines=%s
uk: позитивне значення очікує вміст:lines=%s

source: unrecognized %%(contents) argument: %s
uk: нерозпізнаний аргумент %%(contents): %s

source: positive value expected objectname:short=%s
uk: очікується позитивне значення objectname:short=%s

source: unrecognized %%(objectname) argument: %s
uk: нерозпізнаний аргумент %%(objectname): %s

source: expected format: %%(align:<width>,<position>)
uk: очікуваний формат: %%(align:<width>,<position>)

source: unrecognized position:%s
uk: нерозпізнана позиція:%s

source: unrecognized width:%s
uk: нерозпізнана ширина:%s

source: unrecognized %%(align) argument: %s
uk: нерозпізнаний аргумент %%(align): %s

source: positive width expected with the %%(align) atom
uk: очікується позитивна ширина із зазначенням складової виразу %%(align)

source: unrecognized %%(if) argument: %s
uk: нерозпізнаний аргумент %%(if): %s

source: malformed field name: %.*s
uk: спотворена назва поля: %.*s

source: unknown field name: %.*s
uk: невідома назва поля: %.*s

source: format: %%(if) atom used without a %%(then) atom
uk: формат: складова виразу %%(if) використана без складової %%(then)

source: format: %%(then) atom used without an %%(if) atom
uk: формат: складова виразу %%(then) використана без складової %%(if)

source: format: %%(then) atom used more than once
uk: формат: складова виразу %%(then) використана понад один раз

source: format: %%(then) atom used after %%(else)
uk: формат: складова виразу %%(then) використана після %%(else)

source: format: %%(else) atom used without an %%(if) atom
uk: формат: складова виразу %%(else) використана без складової %%(if)

source: format: %%(else) atom used without a %%(then) atom
uk: формат: складова виразу %%(else) використана без складової %%(then)

source: format: %%(else) atom used more than once
uk: формат: складова виразу %%(else) використана понад один раз

source: format: %%(end) atom used without corresponding atom
uk: формат: складова виразу %%(end) використана без відповідної складової

source: malformed format string %s
uk: спотворений рядок формату %s

source: (no branch, rebasing %s)
uk: (немає гілки, переміщення %s)

source: (no branch, bisect started on %s)
uk: (немає гілки, двійковий пошук почато на %s)

source: (HEAD detached at %s)
uk: (HEAD відокремлений на %s)

source: (HEAD detached from %s)
uk: (HEAD відокремлений починаючи з %s)

source: (no branch)
uk: (немає гілки)

source: missing object %s for %s
uk: відсутній об'єкт %s для %s

source: parse_object_buffer failed on %s for %s
uk: збій при виконанні parse_object_buffer на %s для %s

source: malformed object at '%s'
uk: Спотворений об’єкт «%s»

source: ignoring ref with broken name %s
uk: ігнорування посилання з пошкодженим іменем %s

source: format: %%(end) atom missing
uk: format: пропущена складова виразу %%(end)

source: malformed object name %s
uk: спотворена назва об’єкту %s

source: Cannot fetch both %s and %s to %s
uk: Неможна здобути зміни одночасно з %s та %s до %s

source: %s usually tracks %s, not %s
uk: %s зазвичай відстежує %s, а не %s

source: %s tracks both %s and %s
uk: %s відстежує одночасно %s та %s

source: Internal error
uk: Внутрішня помилка

source: HEAD does not point to a branch
uk: HEAD не вказує на гілку

source: no such branch: '%s'
uk: немає такої гілки: «%s»

source: no upstream configured for branch '%s'
uk: upstream не налаштований для гілки «%s»

source: upstream branch '%s' not stored as a remote-tracking branch
uk: гілка upstream «%s» не збережена як віддалено-відстежувана гілка

source: push destination '%s' on remote '%s' has no local tracking branch
uk: призначення для надсилання змін «%s» на віддаленому сервері «%s» не має локальної відстежуваної гілки

source: branch '%s' has no remote for pushing
uk: гілка «%s» не має віддаленого сервера для надсилання змін

source: push refspecs for '%s' do not include '%s'
uk: специфікації шляху для надсилання змін «%s» не включають у себе «%s»

source: push has no destination (push.default is 'nothing')
uk: надсилання змін не має точки призначення (push.default виставлений в «nothing»)

source: cannot resolve 'simple' push to a single destination
uk: не вдалося виконати «simple» надсилання змін у єдину точку призначення

source: Your branch is based on '%s', but the upstream is gone.
uk: Ваша гілка базується на «%s», але upstream зник.

source: (use "git branch --unset-upstream" to fixup)
uk: (для виправлення запустіть «git branch --unset-upstream»)

source: Your branch is up to date with '%s'.
uk: Ваша гілка актуалізована з «%s».

source: Your branch and '%s' refer to different commits.
uk: Ваша гілка та «%s» посилається на різні коміти.

source: (use "%s" for details)
uk: (використовуйте «%s» для подробиць)

source: Your branch is ahead of '%s' by %d commit.
uk: Ваша гілка випереджає «%s» на %d коміт.

source: (use "git push" to publish your local commits)
uk: (щоб опублікувати ваші локальні коміти використовуйте «git push»)

source: Your branch is behind '%s' by %d commit, and can be fast-forwarded.
uk: Ваша гілка відстає від «%s» на %d коміт й може бути перемотана вперед.

source: (use "git pull" to update your local branch)
uk: (використовуйте «git pull», щоб оновити Вашу локальну гілку)

source: Your branch and '%s' have diverged, and have %d and %d different commit each, respectively.
uk: Ваша гілка і «%s» розійшлися й тепер мають %d й %d різний коміт у кожній відповідно.

source: (use "git pull" to merge the remote branch into yours)
uk: (використовуйте «git pull», щоб злити зовнішню гілку у вашу)

source: could not create directory '%s'
uk: неможливо створити каталог «%s»

source: your current branch appears to be broken
uk: схоже, ваша поточна гілка пошкоджена

source: your current branch '%s' does not have any commits yet
uk: ваша поточна гілка «%s» ще не містить жодного коміту

source: --first-parent is incompatible with --bisect
uk: --first-parent неможливо використовувати одночасно з --bisect

source: open /dev/null failed
uk: збій відкриття /dev/null

source: The '%s' hook was ignored because it's not set as executable. You can disable this warning with `git config advice.ignoredHook false`.
uk: Гак «%s» був проігнорований, оскільки він не заданий як виконуваний. Ви можете вимкнути це попередження виконавши «git config advice.ignoredHook false».

source: unexpected flush packet while reading remote unpack status
uk: неочікуваний пакунок

source: unable to parse remote unpack status: %s
uk: неможливо розібрати стан зовнішньої розпаковки: %s

source: remote unpack failed: %s
uk: збій зовнішньої розпаковки %s

source: failed to sign the push certificate
uk: збій підписання сертифікату надсилання змін

source: the receiving end does not support --signed push
uk: приймаюча сторона не підтримує надсилання змін з опцією --signed

source: not sending a push certificate since the receiving end does not support --signed push
uk: не відправляємо сертифікат для надсилання змін, оскільки приймаюча сторона не підтримує відправку з опцією --signed

source: the receiving end does not support --atomic push
uk: приймаюча сторона не підтримує надсилання змін з опцією --atomic

source: the receiving end does not support push options
uk: приймаюча сторона не підтримує надсилання змін з опціями

source: invalid commit message cleanup mode '%s'
uk: неприпустиме повідомлення коміту для режиму очитки «%s»

source: revert
uk: вивернути

source: cherry-pick
uk: висмикнути

source: after resolving the conflicts, mark the corrected paths with 'git add <paths>' or 'git rm <paths>'
uk: після вирішення конфліктів позначте коректні шляхи за допомогою «git add <шляхи>» або «git rm <шляхи>»

source: after resolving the conflicts, mark the corrected paths with 'git add <paths>' or 'git rm <paths>' and commit the result with 'git commit'
uk: після вирішення конфліктів позначте коректні шляхи за допомогою «git add <шляхи>» або «git rm <шляхи>» і підтвердіть зміни за допомогою «git commit»

source: could not lock '%s'
uk: неможливо заблокувати «%s»

source: could not write eol to '%s'
uk: неможливо записати eol в «%s»

source: failed to finalize '%s'
uk: не вдалося фіналізувати «%s»

source: could not read '%s'
uk: неможливо прочитати «%s»

source: your local changes would be overwritten by %s.
uk: ваші локальні зміни будуть перезаписані %s.

source: commit your changes or stash them to proceed.
uk: для продовження створіть коміт з ваших змін або сховайте їх за допомогою stash

source: %s: fast-forward
uk: %s: перемотування

source: %s: Unable to write new index file
uk: %s: Неможливо записати новий індексний файл

source: unable to update cache tree
uk: неможливо оновити дерево кешу

source: could not resolve HEAD commit
uk: не вдалося розпізнати коміт HEAD

source: could not open '%s' for reading
uk: неможливо відкрити '%s' для читання

source: you have staged changes in your working tree If these changes are meant to be squashed into the previous commit, run: git commit --amend %s If they are meant to go into a new commit, run: git commit %s In both cases, once you're done, continue with: git rebase --continue
uk: у вас є споряджені зміни в робочому каталозі. Якщо ці зміни мають бути об'єднані з попереднім комітом, то виконайте: git commit --amend %s Якщо вони мають бути поміщені в коміт, то виконайте: git commit %s В будь якому випадку, після того як закінчите, продовжити перебазування можна виконавши: git rebase --continue

source: 'prepare-commit-msg' hook failed
uk: гак «prepare-commit-msg» завершився невдачею

source: Your name and email address were configured automatically based on your username and hostname. Please check that they are accurate. You can suppress this message by setting them explicitly. Run the following command and follow the instructions in your editor to edit your configuration file: git config --global --edit After doing this, you may fix the identity used for this commit with: git commit --amend --reset-author
uk: Ваше ім’я або електронна пошта налаштовані автоматично на підставі Вашого імені користувача та імені машини. Будь ласка, перевірте, що вони визначені правильно. Ви можете відімкнути це сповіщення встановивши їх напряму. Запустіть таку команду й дотримуйтеся інструкцій Вашого текстового редактора, для редагування Вашого файлу конфігурації: git config --global --edit Після цього, змінити авторство цього коміту можна буде за допомогою команди: git commit --amend --reset-author

source: Your name and email address were configured automatically based on your username and hostname. Please check that they are accurate. You can suppress this message by setting them explicitly: git config --global user.name "Your Name" git config --global user.email you@example.com After doing this, you may fix the identity used for this commit with: git commit --amend --reset-author
uk: Ваше ім’я або електронна пошта налаштовані автоматично на підставі Вашого імені користувача й імені машини. Будь ласка, перевірте, що вони визначені правильно. Ви можете відімкнути це сповіщення встановивши їх напряму: git config --global user.name "Ваше Ім’я" git config --global user.email you@example.com Після цього, змінити авторство цього коміту можна буде за допомогою команди: git commit --amend --reset-author

source: couldn't look up newly created commit
uk: неможливо запитати новостворений коміт

source: could not parse newly created commit
uk: неможливо розібрати новостворений коміт

source: unable to resolve HEAD after creating commit
uk: неможливо знайти HEAD після створення коміту

source: detached HEAD
uk: відокремлений HEAD

source: (root-commit)
uk: (кореневий коміт)

source: could not parse HEAD
uk: неможливо розібрати HEAD

source: HEAD %s is not a commit!
uk: HEAD %s не є комітом!

source: could not parse HEAD commit
uk: не вдалося розібрати HEAD коміт

source: unable to parse commit author
uk: неможливо розібрати автора коміту

source: git write-tree failed to write a tree
uk: git write-tree не вдалося записати дерево

source: unable to read commit message from '%s'
uk: неможливо прочитати повідомлення коміту від «%s»

source: failed to write commit object
uk: збій запису об’єкту коміту

source: could not parse commit %s
uk: неможливо розібрати коміт %s

source: could not parse parent commit %s
uk: не вдалося розібрати батьківський коміт %s

source: unknown command: %d
uk: невідома команда: %d

source: This is a combination of %d commits.
uk: Це комбінація %d комітів.

source: need a HEAD to fixup
uk: потрібен HEAD для виправлення

source: could not read HEAD
uk: не вдалося прочитати HEAD

source: could not read HEAD's commit message
uk: не вдалося прочитати повідомлення коміта поточного HEAD

source: cannot write '%s'
uk: не вдалося записати «%s»

source: This is the 1st commit message:
uk: Це 1-ше повідомлення коміта:

source: could not read commit message of %s
uk: неможливо прочитати повідомлення коміта для %s

source: This is the commit message #%d:
uk: Це повідомлення коміта номер %d:

source: The commit message #%d will be skipped:
uk: Повідомлення коміта номер %d буде пропущено:

source: your index file is unmerged.
uk: ваш індексний файл незлитий.

source: commit %s is a merge but no -m option was given.
uk: коміт %s — це коміт злиття, але опція -m не вказана.

source: commit %s does not have parent %d
uk: у коміта %s немає батька %d

source: mainline was specified but commit %s is not a merge.
uk: основна гілка вказана, але коміт %s не є злиттям

source: cannot get commit message for %s
uk: неможливо отримати повідомлення коміта для %s

source: %s: cannot parse parent commit %s
uk: %s: неможливо розібрати батьківський коміт %s

source: could not rename '%s' to '%s'
uk: неможливо перейменувати «%s» в «%s»

source: could not revert %s... %s
uk: неможливо вивернути %s... %s

source: could not apply %s... %s
uk: неможливо застосувати %s... %s

source: git %s: failed to read the index
uk: git %s: не вдалося прочитати індекс

source: git %s: failed to refresh the index
uk: git %s: не вдалося оновити індекс

source: %s does not accept arguments: '%s'
uk: параметр %s не приймає аргументи «%s»

source: missing arguments for %s
uk: відсутні аргументи для %s

source: invalid line %d: %.*s
uk: неправильний рядок %d: %.*s

source: cannot '%s' without a previous commit
uk: неможливо виконати «%s» без зазначення попереднього коміта

source: please fix this using 'git rebase --edit-todo'.
uk: будь ласка, виправте це за допомогою «git rebase --edit-todo».

source: unusable instruction sheet: '%s'
uk: незручна для використання карта з вказівками: «%s»

source: no commits parsed.
uk: коміти не розібрані.

source: cannot cherry-pick during a revert.
uk: неможливо висмикнути коміт під час вивертання.

source: cannot revert during a cherry-pick.
uk: неможливо вивернути коміт під час висмикування.

source: invalid value for %s: %s
uk: неприпустиме значення %s: %s

source: malformed options sheet: '%s'
uk: спотворенаа картка з опціями: «%s»

source: empty commit set passed
uk: переданий порожній набір комітів

source: a cherry-pick or revert is already in progress
uk: висмикування або вивертання коміту вже виконується

source: try "git cherry-pick (--continue | --quit | --abort)"
uk: спробуйте «git cherry-pick (--continue | --quit | --abort)»

source: could not create sequencer directory '%s'
uk: неможливо створити каталог для вказівника слідування комітів «%s»

source: could not lock HEAD
uk: неможливо заблокувати HEAD

source: no cherry-pick or revert in progress
uk: висмикування або вивертання не виконується

source: cannot resolve HEAD
uk: неможливо вирішити HEAD

source: cannot abort from a branch yet to be born
uk: неможливо скасувати зміни з гілки, яка ще не створена

source: cannot open '%s'
uk: неможливо відкрити «%s»

source: cannot read '%s': %s
uk: неможливо прочитати «%s»: %s

source: unexpected end of file
uk: несподіваний кінець файлу

source: stored pre-cherry-pick HEAD file '%s' is corrupt
uk: збережений файл з HEAD перед висмикуванням «%s» пошкоджений

source: You seem to have moved HEAD. Not rewinding, check your HEAD!
uk: Схоже ви перемістили HEAD. Перемотування не виконується, перевірте свій вказівник HEAD!

source: could not update %s
uk: неможливо оновити %s

source: cannot read HEAD
uk: неможливо прочитати HEAD

source: could not copy '%s' to '%s'
uk: неможливо скопіювати «%s» в «%s»

source: could not read index
uk: неможливо прочитати індекс

source: execution failed: %s %sYou can fix the problem, and then run git rebase --continue
uk: помилка виконання: %s %sВи можете виправити помилку, а потім запустити git rebase --continue

source: and made changes to the index and/or the working tree
uk: і були зроблені зміни в індексі та/або в робочому каталозі

source: execution succeeded: %s but left changes to the index and/or the working tree Commit or stash your changes, and then run git rebase --continue
uk: успішне виконання: %s але залишились зміни в індексі та/або робочому каталозі Зробіть коміт або сховайте ваші зміни, а потім виконайте git rebase --continue

source: Applied autostash.
uk: Застосовані автоприховані зміни.

source: cannot store %s
uk: неможливо зберегти %s

source: Applying autostash resulted in conflicts. Your changes are safe in the stash. You can run "git stash pop" or "git stash drop" at any time.
uk: Застосування автоматичного ховання викликало конфлікти. Ваші зміни сховані та у безпеці. Ви можете виконати «git stash pop» або «git stash drop» будь-якої миті.

source: could not detach HEAD
uk: не вдалося відокремити HEAD

source: Stopped at %s... %.*s
uk: Зупинено на %s … %.*s

source: unknown command %d
uk: невідома команда %d

source: could not read orig-head
uk: неможливо прочитати orig-head

source: could not read 'onto'
uk: неможливо прочитати «onto»

source: could not update HEAD to %s
uk: неможливо оновити HEAD на %s

source: cannot rebase: You have unstaged changes.
uk: неможливо виконати перебазування: У вас є неспоряджені зміни.

source: cannot amend non-existing commit
uk: неможливо виправити неіснуючий коміт

source: invalid file: '%s'
uk: неприпустимий файл: «%s»

source: invalid contents: '%s'
uk: неприпустимий вміст: «%s»

source: You have uncommitted changes in your working tree. Please, commit them first and then run 'git rebase --continue' again.
uk: Ви маєте незакомічені зміни в робочому каталозі. Спочатку створіть коміт, а потім знову виконайте «git rebase --continue».

source: could not remove CHERRY_PICK_HEAD
uk: неможливо вилучити CHERRY_PICK_HEAD

source: could not commit staged changes.
uk: не вдалося закомітити споряджені зміни.

source: %s: can't cherry-pick a %s
uk: %s: не вдалося висмикнути %s

source: %s: bad revision
uk: %s: погана редакція

source: can't revert as initial commit
uk: неможливо вивернути початковий коміт

source: make_script: unhandled options
uk: make_script: необроблені опції

source: make_script: error preparing revisions
uk: make_script: помилка підготовки редакцій

source: unusable todo list: '%s'
uk: непридатний для використання список завдань: «%s»

source: unrecognized setting %s for option rebase.missingCommitsCheck. Ignoring.
uk: невизнане налаштування %s для опції rebase.missingCommitsCheck. Ігноруємо.

source: Warning: some commits may have been dropped accidentally. Dropped commits (newer to older):
uk: Увага: певні коміти були випадково відкинуті. Відкинуті коміти (від нових до старих):

source: To avoid this message, use "drop" to explicitly remove a commit. Use 'git config rebase.missingCommitsCheck' to change the level of warnings. The possible behaviours are: ignore, warn, error.
uk: Для уникнення цього повідомлення використовуйте «drop» щоб безпосередньо вилучити коміт. Використовуйте параметр «git config rebase.missingCommitsCheck» для зміни рівня попереджень. Можливі значення: ignore, warn, error.

source: You can fix this with 'git rebase --edit-todo' and then run 'git rebase --continue'. Or you can abort the rebase with 'git rebase --abort'.
uk: Ви можете виправити це за допомогою «git rebase --edit-todo», а потім виконати «git rebase --continue». Також ви можете перервати процес перебазування виконавши «git rebase --abort»

source: the script was already rearranged.
uk: сценарій був вже перебудований

source: '%s' is outside repository
uk: «%s» за межами сховища
