Repository: PlagaMedicum/Ubuntu-Translation-Demo
Catalog: rosetta-eoan/*/LC_MESSAGES/git.po
Languages: uk

source: only use refs matching <pattern>
uk: використовувати лише посилання, що відповідають <шаблону>

source: ignore refs matching <pattern>
uk: ігнорувати посилання, що відповідають <шаблону>

source: list all commits reachable from all refs
uk: вивести перелік усіх комітів, досяжних з усіх посилань

source: read from stdin
uk: читати з стандартного введення

source: allow to print `undefined` names (default)
uk: дозволити вивід «undefined», якщо не знайдено (типово)

source: dereference tags in the input (internal use)
uk: розйменовувати уведені мітки (для внутрішнього використання)

source: git notes [--ref <notes-ref>] [list [<object>]]
uk: git notes [--ref <посилання-на-нотатку>] [list [<об’єкт>]]

source: git notes [--ref <notes-ref>] add [-f] [--allow-empty] [-m <msg> | -F <file> | (-c | -C) <object>] [<object>]
uk: git notes [--ref <посилання-на-нотатку>] add [-f] [--allow-empty] [-m <повідомлення> | -F <файл> | (-c | -C) <об’єкт>] [<об’єкт>]

source: git notes [--ref <notes-ref>] copy [-f] <from-object> <to-object>
uk: git notes [--ref <посилання-на-нотатку>] copy [-f] <із-об’єкту> <в-об’єкт>

source: git notes [--ref <notes-ref>] append [--allow-empty] [-m <msg> | -F <file> | (-c | -C) <object>] [<object>]
uk: git notes [--ref <посилання-на-нотатку>] append [--allow-empty] [-m <повідомлення> | -F <файл> | (-c | -C) <об’єкт>] [<об’єкт>]

source: git notes [--ref <notes-ref>] edit [--allow-empty] [<object>]
uk: git notes [--ref <посилання-на-нотатку>] edit [--allow-empty] [<об’єкт>]

source: git notes [--ref <notes-ref>] show [<object>]
uk: git notes [--ref <посилання-на-нотатку>] show [<об’єкт>]

source: git notes [--ref <notes-ref>] merge [-v | -q] [-s <strategy>] <notes-ref>
uk: git notes [--ref <посилання-на-нотатку>] merge [-v | -q] [-s <стратегія>] <посилання-на-нотатку>

source: git notes [--ref <notes-ref>] remove [<object>...]
uk: git notes [--ref <посилання-на-нотатку>] remove [<об’єкт>…]

source: git notes [--ref <notes-ref>] prune [-n] [-v]
uk: git notes [--ref <посилання-на-нотатку>] prune [-n] [-v]

source: git notes [--ref <notes-ref>] get-ref
uk: git notes [--ref <посилання-на-нотатку>] get-ref

source: git notes [list [<object>]]
uk: git notes [list [<об’єкт>]]

source: git notes add [<options>] [<object>]
uk: git notes add [<опції>] [<об’єкт>]

source: git notes copy [<options>] <from-object> <to-object>
uk: git notes copy [<опції>] <із-об’єкту> <в-об’єкт>

source: git notes copy --stdin [<from-object> <to-object>]...
uk: git notes copy --stdin [<із-об’єкту> <в-об’єкт>]…

source: git notes append [<options>] [<object>]
uk: git notes append [<опції>] [<об’єкт>]

source: git notes edit [<object>]
uk: git notes edit [<об’єкт>]

source: git notes show [<object>]
uk: git notes show [<об’єкт>]

source: git notes merge [<options>] <notes-ref>
uk: git notes merge [<опції>] <посилання-на-нотатку>

source: git notes merge --commit [<options>]
uk: git notes merge --commit [<опції>]

source: git notes merge --abort [<options>]
uk: git notes merge --abort [<опції>]

source: git notes remove [<object>]
uk: git notes remove [<опції>]

source: git notes prune [<options>]
uk: git notes prune [<опції>]

source: Write/edit the notes for the following object:
uk: Записати/змінити нотатки для наступного об'єкта:

source: unable to start 'show' for object '%s'
uk: не вдалося запустити «show» для об’єкту «%s»

source: could not read 'show' output
uk: не вдалося прочитати вивід «show»

source: failed to finish 'show' for object '%s'
uk: не вдалося завершити «show» для об’єкту «%s»

source: please supply the note contents using either -m or -F option
uk: будь ласка, вкажіть вміст нотатки, використовуючи опцію -m або -F

source: unable to write note object
uk: не вдалося записати об’єкт нотатки

source: the note contents have been left in %s
uk: вміст нотатки залишився в %s

source: could not open or read '%s'
uk: не вдалося відкрити або прочитати «%s»

source: failed to resolve '%s' as a valid ref.
uk: не вдалося вирішити «%s» як посилання.

source: failed to read object '%s'.
uk: не вдалося прочитати об'єкт «%s».

source: cannot read note data from non-blob object '%s'.
uk: неможливо прочитати дані нотатки з недвійкового об'єкта «%s».

source: malformed input line: '%s'.
uk: спотворений рядок введення: «%s».

source: failed to copy notes from '%s' to '%s'
uk: не вдалося скопіювати нотатку з «%s» в «%s»

source: refusing to %s notes in %s (outside of refs/notes/)
uk: відмова в перезапису %s нотаток в %s (за межами refs/notes/)

source: too many parameters
uk: забагато параметрів

source: no note found for object %s.
uk: не знайдена нотатка для об'єкта %s.

source: note contents as a string
uk: текстовий вміст нотатки

source: note contents in a file
uk: вміст нотатки у файлі

source: reuse and edit specified note object
uk: використовувати і відредагувати вказаний об’єкт нотатки

source: reuse specified note object
uk: використовувати вказаний об’єкт нотатки

source: allow storing empty note
uk: дозволити збереження порожньої нотатки

source: replace existing notes
uk: замінити існуючі нотатки

source: Cannot add notes. Found existing notes for object %s. Use '-f' to overwrite existing notes
uk: Не вдалося додати нотатку. Знайдена існуюча нотатка у об’єкту %s. Використовуйте параметр «-f» для перезапису існуючих нотаток.

source: Overwriting existing notes for object %s
uk: Перезапис існуючих нотаток у об’єкту %s

source: Removing note for object %s
uk: Вилучення нотатки у об’єкту %s

source: read objects from stdin
uk: прочитати об’єкти із стандартного вводу

source: load rewriting config for <command> (implies --stdin)
uk: завантажити налаштування перезапису для команди <команда> (включає у себе --stdin)

source: too few parameters
uk: замало параметрів

source: Cannot copy notes. Found existing notes for object %s. Use '-f' to overwrite existing notes
uk: Не вдалося скопіювати нотатку. Знайдена існуюча нотатка у об’єкту %s. Використовуйте параметр «-f» для перезапису існуючих нотаток.

source: missing notes on source object %s. Cannot copy.
uk: немає нотаток у вихідного об'єкта %s. Неможливо скопіювати.

source: The -m/-F/-c/-C options have been deprecated for the 'edit' subcommand. Please use 'git notes add -f -m/-F/-c/-C' instead.
uk: Опції -m/-F/-c/-C для підкоманди «edit» застаріли. Використовуйте замість них «git notes add -f -m/-F/-c/-C».

source: failed to delete ref NOTES_MERGE_PARTIAL
uk: не вдалося вилучити посилання NOTES_MERGE_PARTIAL

source: failed to delete ref NOTES_MERGE_REF
uk: не вдалося вилучити посилання NOTES_MERGE_REF

source: failed to remove 'git notes merge' worktree
uk: не вдалося вилучити робочий каталог «git notes merge»

source: failed to read ref NOTES_MERGE_PARTIAL
uk: не вдалося прочитати посилання NOTES_MERGE_PARTIAL

source: could not find commit from NOTES_MERGE_PARTIAL.
uk: неможливо знайти коміт з NOTES_MERGE_PARTIAL.

source: could not parse commit from NOTES_MERGE_PARTIAL.
uk: неможливо розібрати коміт з NOTES_MERGE_PARTIAL.

source: failed to resolve NOTES_MERGE_REF
uk: неможливо вирішити NOTES_MERGE_REF

source: failed to finalize notes merge
uk: не вдалося завершити злиття нотаток

source: unknown notes merge strategy %s
uk: невідома стратегія злиття нотаток %s

source: General options
uk: Загальні параметри

source: Merge options
uk: Параметри злиття

source: resolve notes conflicts using the given strategy (manual/ours/theirs/union/cat_sort_uniq)
uk: вирішити конфлікти нотаток за допомогою вказаної стратегії (manual/ours/theirs/union/cat_sort_uniq)

source: Committing unmerged notes
uk: Коміт незлитих нотаток

source: finalize notes merge by committing unmerged notes
uk: завершити злиття нотаток комітом незлитих нотаток

source: Aborting notes merge resolution
uk: Переривання вирішення злиття нотаток

source: abort notes merge
uk: перервати злиття нотаток

source: cannot mix --commit, --abort or -s/--strategy
uk: неможливо використовувати одночасно --commit, --abort або -s/--strategy

source: must specify a notes ref to merge
uk: необхідно зазначити посилання нотатки для злиття

source: unknown -s/--strategy: %s
uk: невідомий параметр для -s/--strategy: %s

source: a notes merge into %s is already in-progress at %s
uk: злиття нотаток в %s вже виконується на %s

source: failed to store link to current notes ref (%s)
uk: не вдалося зберегти адресу поточного посилання на нотатку (%s)

source: Automatic notes merge failed. Fix conflicts in %s and commit the result with 'git notes merge --commit', or abort the merge with 'git notes merge --abort'.
uk: Не вдалося автоматично злити нотатки. Виправте конфлікти в %s та створіть коміт результатів із «git notes merge --commit», або перервіть процес злиття з «git notes merge --abort».

source: Object %s has no note
uk: У об’єкту %s немає нотатки

source: attempt to remove non-existent note is not an error
uk: спроба вилучення неіснуючої нотатки не є помилкою

source: read object names from the standard input
uk: прочитати імена об’єктів із стандартного вводу

source: do not remove, show only
uk: не вилучати, лише показати перелік

source: report pruned notes
uk: повідомити про почищені примітки

source: notes-ref
uk: посилання-на-нотатку

source: use notes from <notes-ref>
uk: використовувати нотатку із <посилання-на-нотатку>

source: unknown subcommand: %s
uk: невідома підкоманда: %s

source: git pack-objects --stdout [<options>...] [< <ref-list> | < <object-list>]
uk: git pack-objects --stdout [<опції>…] [< <перелік-посилань> | < <перелік-об’єктів>]

source: git pack-objects [<options>...] <base-name> [< <ref-list> | < <object-list>]
uk: git pack-objects [<опції>…] <ім’я-бази> [< <перелік-посилань> | < <перелік-об’єктів>]

source: disabling bitmap writing, packs are split due to pack.packSizeLimit
uk: вимкнення запису бітових мап,оскільки картки були розбиті на частини через pack.packSizeLimit

source: Writing objects
uk: Запис об’єктів

source: failed to stat %s
uk: не вдалося виконати stat %s

source: disabling bitmap writing, as some objects are not being packed
uk: вимкнення запису бітових мап, оскільки деякі об’єкти не були запаковані

source: Counting objects
uk: Підрахунок об’єктів

source: Compressing objects
uk: Стиснення об’єктів

source: invalid value for --missing
uk: неприпустиме значення для --missing

source: unsupported index version %s
uk: непідтримувана версія індексу %s

source: bad index version '%s'
uk: погана версія індексу «%s»

source: do not show progress meter
uk: не виводити поступ виконання

source: show progress meter
uk: показати поступ виконання

source: show progress meter during object writing phase
uk: показати поступ виконання під час запису об’єктів

source: similar to --all-progress when progress meter is shown
uk: схоже на --all-progress при увімкненому поступі виконання

source: write the pack index file in the specified idx format version
uk: записати файл індексу паки у вказаній версії формату

source: maximum size of each output pack file
uk: максимальний розмір кожного вихідного файлу паки

source: ignore borrowed objects from alternate object store
uk: нехтувати чужі об’єкти, взяті із альтернативного сховища об’єктів

source: ignore packed objects
uk: нехтувати запаковані об’єкти

source: limit pack window by objects
uk: обмежити вікно паки за кількістю об’єктів

source: limit pack window by memory in addition to object limit
uk: додатково до кількости об’єктів обмежити вікно паки по пам’яті

source: maximum length of delta chain allowed in the resulting pack
uk: максимальна дозволена довжина ланцюжка дельт у результуючій паці

source: reuse existing deltas
uk: використовувати повторно існуючі дельти

source: reuse existing objects
uk: використовувати повторно існуючі об’єкти

source: use OFS_DELTA objects
uk: використовувати об’єкти OFS_DELTA

source: use threads when searching for best delta matches
uk: використовувати багатопотоковість при пошуку кращих збігів дельт

source: do not create an empty pack output
uk: не створювати порожні вихідні паки

source: read revision arguments from standard input
uk: прочитати аргументи редакцій із стандартного вводу

source: limit the objects to those that are not yet packed
uk: обмежитися об’єктами, які ще не запаковані

source: include objects reachable from any reference
uk: включити об’єкти, які досяжні за будь-яким посиланням

source: include objects referred by reflog entries
uk: включити об’єкти, на які посилаються записи журналу посилань

source: include objects referred to by the index
uk: включити об’єкти, на які посилається індекс

source: output pack to stdout
uk: вивести паку на стандартний вивід

source: include tag objects that refer to objects to be packed
uk: включити об’єкти міток, які посилаються на об’єкти, що запаковуються

source: keep unreachable objects
uk: зберігати посилання на недоступні об’єкти

source: pack loose unreachable objects
uk: пакувати недосяжні об'єкти

source: unpack unreachable objects newer than <time>
uk: розпакувати недоступні об’єкти, які новіші, ніж <час>

source: create thin packs
uk: створювати тонкі паки

source: create packs suitable for shallow fetches
uk: створювати паки, що підходять для часткових витягів

source: ignore packs that have companion .keep file
uk: нехтувати паки, поряд з якими лежить .keep файл

source: pack compression level
uk: рівень стиснення паки

source: do not hide commits by grafts
uk: не приховувати коміти зрощеннями

source: use a bitmap index if available to speed up counting objects
uk: за можливости використовувати індекс у бітових мапах для пришвидшення підрахунку об’єктів

source: write a bitmap index together with the pack index
uk: запис індексу у бітових мапах разом з індексом паки

source: handling for missing objects
uk: обробка відсутніх об'єктів

source: do not pack objects in promisor packfiles
uk: не пакувати об'єкти у паках promisor

source: git pack-refs [<options>]
uk: git pack-refs [<опції>]

source: pack everything
uk: пакувати усе

source: prune loose refs (default)
uk: почистити слабкі посилання (типово)

source: Removing duplicate objects
uk: Вилучення об’єктів, що дублюються

source: git prune [-n] [-v] [--progress] [--expire <time>] [--] [<head>...]
uk: git prune [-n] [-v] [--progress] [--expire <час>] [--] [<гілка>...]

source: report pruned objects
uk: вивести перелік вилучених об’єктів

source: expire objects older than <time>
uk: вилучити об’єкти старіші ніж <дата-закінчення>

source: limit traversal to objects outside promisor packfiles
uk: обмежити прохід об'єктів за межами паків promisor

source: cannot prune in a precious-objects repo
uk: неможливо почистити невикористовувані об’єкти у precious-objects сховищі

source: Invalid value for %s: %s
uk: Неправильне значення для %s: %s

source: git pull [<options>] [<repository> [<refspec>...]]
uk: git pull [<опції>] [<сховище> [<специфікація-посилання>…]]

source: control for recursive fetching of submodules
uk: керування рекурсивним видобуванням підмодулей

source: Options related to merging
uk: Опції, пов’язані зі злиттям

source: incorporate changes by rebasing rather than merging
uk: забрати зміни за допомогою перебазування, а не злиття

source: allow fast-forward
uk: дозволити перемотування вперед

source: automatically stash/stash pop before and after rebase
uk: автоматично виконати stash/stash pop до і після перебазування

source: Options related to fetching
uk: Опції, пов’язані з видобуванням

source: force overwrite of local branch
uk: примусовий перезапис локальної гілки

source: number of submodules pulled in parallel
uk: кількість підмодулей, які не будуть стягнуті паралельно

source: Invalid value for pull.ff: %s
uk: Неправильне значення для pull.ff: %s

source: There is no candidate for rebasing against among the refs that you just fetched.
uk: Немає претендентів для перебазування серед посилань, які Ви щойно здобули.

source: There are no candidates for merging among the refs that you just fetched.
uk: Немає претендентів для злиття серед посилань, які Ви щойно здобули.

source: Generally this means that you provided a wildcard refspec which had no matches on the remote end.
uk: Зазвичай це означає, що Ви передали специфікацію посилання за допомогою шаблону й цей шаблон не збігається з жодним із посилань на віддаленому сховищі.

source: You asked to pull from the remote '%s', but did not specify a branch. Because this is not the default configured remote for your current branch, you must specify a branch on the command line.
uk: Ви попрохали стягнути зміни із віддаленого сховища «%s», але не вказали гілку. Оскільки це не типове сховище для вашої поточної гілки, необхідно вказати гілку у командному рядку.

source: You are not currently on a branch.
uk: Наразі Ви на жодній з гілок.

source: Please specify which branch you want to rebase against.
uk: Будь ласка, вкажіть на яку гілку ви бажаєте перебазувати зміни.

source: Please specify which branch you want to merge with.
uk: Будь ласка, вкажіть з якою гілкою Ви бажаєте злити зміни.

source: See git-pull(1) for details.
uk: Для додаткової інформації дивіться git-pull(1).

source: <remote>
uk: <віддалене-сховище>

source: <branch>
uk: <гілка>

source: There is no tracking information for the current branch.
uk: В поточній гілці немає даних про відстежування.

source: If you wish to set tracking information for this branch you can do so with:
uk: Якщо ви бажаєте задати дані про відстеження для цієї гілки, виконайте:

source: Your configuration specifies to merge with the ref '%s' from the remote, but no such ref was fetched.
uk: Ваша конфігурація вказує, що потрібно злити зміни з посиланням «%s» із віддаленого сховища, але таке посилання не було отримано.

source: ignoring --verify-signatures for rebase
uk: ігнорування --verify-signatures при перебазуванні

source: --[no-]autostash option is only valid with --rebase.
uk: --[no-]autostash можливо використовувати лише з --rebase.

source: Updating an unborn branch with changes added to the index.
uk: Оновлення ще не початої гілки із змінами, доданими до індексу.

source: pull with rebase
uk: стягнути з перебазуванням

source: please commit or stash them.
uk: створіть коміт або приховайте їх.

source: fetch updated the current branch head. fast-forwarding your working tree from commit %s.
uk: здобування змін оновило голову вашої поточної гілки. перемотування вашого робочого каталогу з коміту %s.

source: Cannot fast-forward your working tree. After making sure that you saved anything precious from $ git diff %s output, run $ git reset --hard to recover.
uk: Не вдалося перемотати вперед зміни у Вашому робочому каталозі. Після того, як Ви переконаєтеся, що Ви зберегли усе необхідне з виводу $ git diff %s , запустіть $ git reset --hard для відновлення початкового стану.

source: Cannot merge multiple branches into empty head.
uk: Неможна злити декілька гілок у порожній вказівник на комміт.

source: Cannot rebase onto multiple branches.
uk: Неможливо перебазувати над декількома гілками.

source: cannot rebase with locally recorded submodule modifications
uk: неможливо перебазувати із записаними локальними змінами в підмодулях

source: git push [<options>] [<repository> [<refspec>...]]
uk: git push [<параметри>] [<сховище> [<специфікація посилань>...]]

source: tag shorthand without <tag>
uk: вказано скорочення tag, але не вказана сама <мітка>

source: --delete only accepts plain target ref names
uk: опція --delete приймає лише прості цільові імена посилань

source: To choose either option permanently, see push.default in 'git help config'.
uk: Щоб вибрати будь-яку з опцій на постійній основі, дивіться push.default в «git help config».

source: You are not currently on a branch. To push the history leading to the current (detached HEAD) state now, use git push %s HEAD:<name-of-remote-branch>
uk: Наразі Ви не знаходитеся на жодній з гілок. Щоб надіслати історію, що веде до поточного (відокремлений HEAD) стану, використовуйте git push %s HEAD:<ім’я-зовнішньої-гілки>

source: The current branch %s has no upstream branch. To push the current branch and set the remote as upstream, use git push --set-upstream %s %s
uk: Поточна гілка %s не має гілки upstream. Щоб надіслати поточну гілку й встановити зовнішню гілку як гілку upstream, використовуйте git push --set-upstream %s %s

source: The current branch %s has multiple upstream branches, refusing to push.
uk: Ваша поточна гілка %s має декілька гілок upstream, відмова у надсиланні змін.

source: You are pushing to remote '%s', which is not the upstream of your current branch '%s', without telling me what to push to update which remote branch.
uk: Наразі Ви надсилаєте зміни у віддалене сховище «%s», яке не є upstream для вашої поточної гілки «%s», без зазначення того, які зміни надсилати та у яку віддалену гілку.

source: You didn't specify any refspecs to push, and push.default is "nothing".
uk: Ви не зазначили специфікацію посилання для надсилання, а push.default вказаний як «nothing».

source: Updates were rejected because the tip of your current branch is behind its remote counterpart. Integrate the remote changes (e.g. 'git pull ...') before pushing again. See the 'Note about fast-forwards' in 'git push --help' for details.
uk: Оновлення були відхилені, оскільки верхівка Вашої поточної гілки позаду її зовнішньої частини. Заберіть та злийте зовнішні зміни (наприклад, за допомогою «git pull …») перед повторною спробою надсилання змін. Для додаткової інформації дивіться «Note about fast-forwards» в «git push --help».

source: Updates were rejected because a pushed branch tip is behind its remote counterpart. Check out this branch and integrate the remote changes (e.g. 'git pull ...') before pushing again. See the 'Note about fast-forwards' in 'git push --help' for details.
uk: Оновлення були відхилені, оскільки верхівка гілки, що відправляється позаду її зовнішньої частини. Перемикніться на гілку й заберіть зовнішні зміни (наприклад, за допомогою «git pull …») перед повторною спробою надсилання змін. Для додаткової інформації дивіться «Note about fast-forwards» в «git push --help».

source: Updates were rejected because the remote contains work that you do not have locally. This is usually caused by another repository pushing to the same ref. You may want to first integrate the remote changes (e.g., 'git pull ...') before pushing again. See the 'Note about fast-forwards' in 'git push --help' for details.
uk: Оновлення були відхилені, оскільки віддалене сховище містить зміни, яких немає у локальному сховищі. Зазвичай, це пов’язано з тим, що хтось вже надіслав зміни у те ж місце. Перед повторним надсиланням змін, вам слід спочатку інтегрувати віддалені зміни собі (тобто виконати «git pull …»). Для додаткової інформації дивіться «Note about fast-forwards» в «git push --help».

source: Updates were rejected because the tag already exists in the remote.
uk: Оновлення були відхилені, оскільки мітка вже існує у віддаленому сховищі.

source: You cannot update a remote ref that points at a non-commit object, or update a remote ref to make it point at a non-commit object, without using the '--force' option.
uk: Ви не можете оновити зовнішнє посилання, яке вказує на об’єкт, що не є комітом або оновити зовнішнє посилання так, щоб воно вказувало на об’єкт, що не є комітом, без зазначення опції «--force».

source: Pushing to %s
uk: Надсилання в %s

source: failed to push some refs to '%s'
uk: не вдалося надіслати деякі посилання в «%s»

source: bad repository '%s'
uk: погане сховище «%s»
