Repository: PlagaMedicum/Ubuntu-Translation-Demo
Catalog: rosetta-eoan/*/LC_MESSAGES/git.po
Languages: uk

source: directory stat info changes after adding a file inside subdirectory
uk: інформація статистики каталогу змінюється після додавання нового файлу всередині підкаталогу

source: directory stat info does not change after deleting a file
uk: інформація статистики каталогу не змінюється після вилучення файлу

source: directory stat info does not change after deleting a directory
uk: інформація статистики каталогу не змінюється після вилучення каталогу

source: git update-index [<options>] [--] [<file>...]
uk: git update-index [<опції>] [--] [<файл>…]

source: continue refresh even when index needs update
uk: продовжити оновлення, навіть якщо індекс потребує оновлення

source: refresh: ignore submodules
uk: оновлення: нехтувати підмодулі

source: do not ignore new files
uk: не нехтувати нові файли

source: let files replace directories and vice-versa
uk: дозволити файлам замінювати каталоги та навпаки

source: notice files missing from worktree
uk: помічати файли, що відсутні у робочому каталозі

source: refresh even if index contains unmerged entries
uk: оновити, навіть якщо в індексі є не злиті записи

source: refresh stat information
uk: оновити інформацію про статус файлів

source: like --refresh, but ignore assume-unchanged setting
uk: як --refresh, але нехтувати налаштування assume-unchanged

source: <mode>,<object>,<path>
uk: <режим доступу>,<об’єкт>,<шлях>

source: add the specified entry to the index
uk: додати вказаний запис в індекс

source: mark files as "not changing"
uk: позначити файли як "не змінені"

source: clear assumed-unchanged bit
uk: прибрати помітку assumed-unchanged

source: mark files as "index-only"
uk: позначити файли як "лише в індексі"

source: clear skip-worktree bit
uk: прибрати помітку skip-worktree

source: add to index only; do not add content to object database
uk: лише додати в індекс; не додавати вміст у базу даних об’єктів

source: remove named paths even if present in worktree
uk: вилучити вказані шляхи, навіть якщо вони існують у робочому каталозі

source: with --stdin: input lines are terminated by null bytes
uk: з опцією --stdin: рядки на вводі відокремлюються НУЛЬОВИМ байтом

source: read list of paths to be updated from standard input
uk: прочитати перелік оновлюваних шляхів із стандартного вводу

source: add entries from standard input to the index
uk: додати записи із стандатрного вводу в індекс

source: repopulate stages #2 and #3 for the listed paths
uk: заново заповнити індекс #2 і #3 для вказаних шляхів

source: only update entries that differ from HEAD
uk: оновити лише записи, які відрізняються від HEAD

source: ignore files missing from worktree
uk: нехтувати файли, що відсутні у робочому каталозі

source: report actions to standard output
uk: вивести виконувані дії на стандартний вивід

source: (for porcelains) forget saved unresolved conflicts
uk: (для машинного опрацювання) забути збережені невирішені конфлікти

source: write index in this format
uk: записати індекс у вказаному форматі

source: enable or disable split index
uk: дозволити або заборонити роздільний індекс

source: enable/disable untracked cache
uk: увімкнути/відімкнути кеш невідстежуваних файлів

source: test if the filesystem supports untracked cache
uk: перевірити, що файлова система підтримує кеш невідслідковуваних файлів

source: enable untracked cache without testing the filesystem
uk: увімкнути кеш невідстежуваних файлів без перевірки файлової системи

source: write out the index even if is not flagged as changed
uk: записати індекс, навіть якщо він не позначений як змінений

source: enable or disable file system monitor
uk: увімкнути або вимкнути моніторинг файлової системи

source: mark files as fsmonitor valid
uk: позначити файли як чинні в моніторі файлової системи

source: clear fsmonitor valid bit
uk: зняти позначку чинності в моніторі файлової системи

source: core.splitIndex is set to false; remove or change it, if you really want to enable split index
uk: параметр core.splitIndex встановлений в false; вилучіть або змініть його, якщо ви справді бажаєте увімкнути розділений індекс

source: core.splitIndex is set to true; remove or change it, if you really want to disable split index
uk: параметр core.splitIndex встановлений в true; вилучіть або змініть його, якщо ви справді бажаєте вимкнути розділений індекс

source: core.untrackedCache is set to true; remove or change it, if you really want to disable the untracked cache
uk: параметр core.untrackedCache встановлений в true; вилучіть або змініть його, якщо ви справді бажаєте вимкнути кеш невідслідковуваних файлов

source: Untracked cache disabled
uk: Кеш невідслідковуваних файлів вимкнено

source: core.untrackedCache is set to false; remove or change it, if you really want to enable the untracked cache
uk: параметр core.untrackedCache встановлений в false; вилучіть або змініть його, якщо ви справді бажаєте увімкнути кеш невідслідковуваних файлов

source: Untracked cache enabled for '%s'
uk: Кеш невідслідковуваних файлів увімкнено для «%s»

source: core.fsmonitor is unset; set it if you really want to enable fsmonitor
uk: параметр core.fsmonitor не встановлено; встановіть його, якщо ви дійсно бажаєте увімкнути моніторинг файлової системи

source: fsmonitor enabled
uk: моніторинг файлової системи увімкнено

source: core.fsmonitor is set; remove it if you really want to disable fsmonitor
uk: параметр core.fsmonitor встановлено; вилучіть його, якщо ви дійсно бажаєте вимкнути моніторинг файлової системи

source: fsmonitor disabled
uk: моніторинг файлової системи вимкнений

source: git update-ref [<options>] -d <refname> [<old-val>]
uk: git update-ref [<опції>] -d <ім’я-посилання> [<старе-значення>]

source: git update-ref [<options>] <refname> <new-val> [<old-val>]
uk: git update-ref [<опції>] <ім’я-посилання> <нове-значення> [<старе-значення>]

source: git update-ref [<options>] --stdin [-z]
uk: git update-ref [<опції>] --stdin [-z]

source: delete the reference
uk: вилучити посилання

source: update <refname> not the one it points to
uk: оновити <ім’я-посилання> а не те, на що воно вказує

source: stdin has NUL-terminated arguments
uk: ввід відокремлений НУЛЬОВИМИ символами

source: read updates from stdin
uk: прочитати оновлення із стандартного вводу

source: update the info files from scratch
uk: оновити інформацію про сервери з нуля

source: git upload-pack [<options>] <dir>
uk: git upload-pack [<опції>] <кат>

source: exit immediately after initial ref advertisement
uk: виходити одразу після початкового оголошення списку посилань

source: do not try <directory>/.git/ if <directory> is no Git directory
uk: не перевіряти <каталог>/.git/ якщо <каталог> не є каталогом Git

source: interrupt transfer after <n> seconds of inactivity
uk: перервати передавання після <n> секунд неактивності

source: git verify-commit [-v | --verbose] <commit>...
uk: git verify-commit [-v | --verbose] <коміт>…

source: print commit contents
uk: вивести вміст коміту

source: print raw gpg status output
uk: виводити сирий вивід стану від gpg

source: git verify-pack [-v | --verbose] [-s | --stat-only] <pack>...
uk: git verify-pack [-v | --verbose] [-s | --stat-only] <пака>…

source: verbose
uk: докладність

source: show statistics only
uk: показати лише статистичні дані

source: git verify-tag [-v | --verbose] [--format=<format>] <tag>...
uk: git verify-tag [-v | --verbose] [--format=<формат>] <мітка>…

source: print tag contents
uk: вивести вміст мітки

source: git worktree add [<options>] <path> [<commit-ish>]
uk: git worktree add [<опці]>] <шлях> [ <вказівник-коміту>]

source: git worktree list [<options>]
uk: git worktree list [<опції>]

source: git worktree lock [<options>] <path>
uk: git worktree lock [<опції>] <шлях>

source: git worktree move <worktree> <new-path>
uk: git worktree move <робочий каталог> <новий-шлях>

source: git worktree prune [<options>]
uk: git worktree prune [<опції>]

source: git worktree remove [<options>] <worktree>
uk: git worktree remove [<опції>] <робочий каталог>

source: git worktree unlock <path>
uk: git worktree unlock <шлях>

source: failed to delete '%s'
uk: не вдалося видалити «%s»

source: Removing worktrees/%s: not a valid directory
uk: Вилучення робочих каталогів/%s: не є каталогом

source: Removing worktrees/%s: gitdir file does not exist
uk: Вилучення робочих каталогів/%s: файл gitdir не існує

source: Removing worktrees/%s: unable to read gitdir file (%s)
uk: Вилучення робочих каталогів/%s: не вдалося прочитати файл gitdir (%s)

source: Removing worktrees/%s: short read (expected %<PRIuMAX> bytes, read %<PRIuMAX>)
uk: Вилучення робочого каталогу/%s: прочитано мало даних (очкувалось %<PRIuMAX> Б, прочитано %<PRIuMAX>)

source: Removing worktrees/%s: invalid gitdir file
uk: Вилучення робочих каталогів/%s: недійсний файл gitdir

source: Removing worktrees/%s: gitdir file points to non-existent location
uk: Вилучення робочих каталогів/%s: gitdir вказує на неіснуюче розташування

source: report pruned working trees
uk: вивести список очищених робочих каталогів

source: expire working trees older than <time>
uk: вилучити робочі каталоги, старіші <дата>

source: '%s' already exists
uk: «%s» вже існує

source: could not create directory of '%s'
uk: не вдалося створити каталог «%s»

source: checkout <branch> even if already checked out in other worktree
uk: перейти на <гілка> навіть якщо вона вже активна в іншому робочому каталозі

source: create a new branch
uk: створити нову гілку

source: create or reset a branch
uk: створити або перейти на гілку

source: populate the new working tree
uk: наповнити новий робочий каталог

source: keep the new working tree locked
uk: тримати робочий каталог заблокованим

source: set up tracking mode (see git-branch(1))
uk: налаштувати режим відслідковування гілки (див git-branch(1))

source: try to match the new branch name with a remote-tracking branch
uk: спробувати знайти відповідність імені нової гілки з іменем віддалено-відстежуваної гілкки

source: -b, -B, and --detach are mutually exclusive
uk: -b, -B та --detach неможливо використовувати одночасно

source: --[no-]track can only be used if a new branch is created
uk: --[no-]track можливо використовувати лише створюється нова гілка

source: reason for locking
uk: причина блокування

source: '%s' is not a working tree
uk: «%s» не є робочим каталогом

source: The main working tree cannot be locked or unlocked
uk: Головний робочий каталог не може бути заблокований чи розблокований

source: '%s' is already locked, reason: %s
uk: «%s» вже заблокований, причина: %s

source: '%s' is already locked
uk: «%s» вже заблокований

source: '%s' is not locked
uk: «%s» не заблокований

source: working trees containing submodules cannot be moved or removed
uk: робочі каталоги, що містять підмодулі не можуть бути переміщені чи вилучені

source: '%s' is a main working tree
uk: «%s» не є основним робочим каталогом

source: could not figure out destination name from '%s'
uk: неможливо визначити назву місця призначення з «%s»

source: target '%s' already exists
uk: призначення «%s» вже існує

source: validation failed, cannot move working tree: %s
uk: перевірка завершилася невдачею, неможливо перемістити робочий каталог: %s

source: failed to move '%s' to '%s'
uk: неможливо перемістити «%s» до «%s»

source: failed to run 'git status' on '%s'
uk: не вдалося виконати «git status» на «%s»

source: '%s' is dirty, use --force to delete it
uk: «%s» змінений, для видалення використовуйте --force

source: failed to run 'git status' on '%s', code %d
uk: не вдалося виконати «git status» на «%s», код %d

source: validation failed, cannot remove working tree: %s
uk: перевірка завершилася невдачею, неможливо вилучити робочий каталог: %s

source: git write-tree [--missing-ok] [--prefix=<prefix>/]
uk: git write-tree [--missing-ok] [--prefix=<префікс>/]

source: <prefix>/
uk: <префікс>/

source: write tree object for a subdirectory <prefix>
uk: вивести об’єкт дерева для підкаталогу з <префікс>

source: only useful for debugging
uk: стане в нагоді лише для зневадження

source: The permissions on your socket directory are too loose; other users may be able to read your cached credentials. Consider running: chmod 0700 %s
uk: Права доступу до вашого каталогу надто вільні; інші користувачі можуть читати ваші закешовані реєстраційні дані. Поміркуйте про виконання: chmod 0700 %s

source: print debugging messages to stderr
uk: виведення зневаджувальних повідомлень на stderr

source: 'git help -a' and 'git help -g' list available subcommands and some concept guides. See 'git help <command>' or 'git help <concept>' to read about a specific subcommand or concept.
uk: «git help -а» і «git help -g» виводить перелік доступних подкоманд та деякі керівництва по темам. Запустіть «git help <команда>» або «git help <термін>», щоб прочитати про конкретні підкоманду або тему.

source: no directory given for --git-dir
uk: жодного каталогу не передано для --git-dir

source: no namespace given for --namespace
uk: жодного простору імен не передано для --namespace

source: no directory given for --work-tree
uk: жодного каталогу не передано для --work-tree

source: no prefix given for --super-prefix
uk: жодного префіксу не передано для --super-prefix

source: -c expects a configuration string
uk: -c очікує на конфігураційний рядок

source: no directory given for -C
uk: жодного каталогу не передано для -C

source: unknown option: %s
uk: невідомий параметр «%s»

source: expansion of alias '%s' failed; '%s' is not a git command
uk: розширення синоніму «%s» завершилося невдачею; «%s» не є командою git

source: failed to run command '%s': %s
uk: не вдалося виконати команду «%s»: %s

source: negative value for http.postbuffer; defaulting to %d
uk: від'ємне значення http.postbuffer; використовую типове %d

source: Delegation control is not supported with cURL < 7.22.0
uk: Делегування повноважень не підтримується з cURL < 7.22.0

source: Public key pinning not supported with cURL < 7.44.0
uk: Public key pinning не підтримується з cURL < 7.44.0

source: unable to update url base from redirection: asked for: %s redirect: %s
uk: не вдалося оновити базовий url з переспрямування: запитано: %s переспрямовано: %s

source: redirecting to %s
uk: переспрямування на %s

source: args
uk: аргументи

source: object filtering
uk: фільтрування об'єктів

source: expiry-date
uk: дата-закінчення

source: no-op (backward compatibility)
uk: нічого не робить (залишено для зворотньої сумісності)

source: be more verbose
uk: режим з докладним виводом

source: be more quiet
uk: тихий режим

source: use <n> digits to display SHA-1s
uk: використовувати <n> цифр для виводу SHA-1

source: Add file contents to the index
uk: Додаваня вмісту файлу в індекс

source: Use binary search to find the commit that introduced a bug
uk: Використовувати двійковий пошук коміту, яка вносить помилку

source: List, create, or delete branches
uk: Вивід переліку, створення або вилучення гілок

source: Switch branches or restore working tree files
uk: Перемикання гілок або відновлення файлів у робочому каталозі

source: Clone a repository into a new directory
uk: Клонування сховища в новий каталог

source: Record changes to the repository
uk: Запис змін у сховищі

source: Show changes between commits, commit and working tree, etc
uk: Вивід різниці між комітами, комітом та робочим каталогом й тощо.

source: Download objects and refs from another repository
uk: Завантаження об’єктів і посилань з іншого сховища

source: Print lines matching a pattern
uk: Вивід рядків, що відповідають шаблону

source: Create an empty Git repository or reinitialize an existing one
uk: Створення порожнього сховища Git або реініціалізація існуючого

source: Show commit logs
uk: Вивід історії комітів

source: Join two or more development histories together
uk: Об’єднання однієї або декількох історій розробки разом

source: Move or rename a file, a directory, or a symlink
uk: Переміщення або перейменування файлу, каталогу або символьного посилання

source: Fetch from and integrate with another repository or a local branch
uk: Здобування змін та об’єднання з іншим сховищем або локальною гілкою

source: Update remote refs along with associated objects
uk: Оновлення зовнішніх посилань і пов’язаних об’єктів

source: Reapply commits on top of another base tip
uk: Повторно застосувати коміти над верхівкою іншої гілки

source: Reset current HEAD to the specified state
uk: Скидання поточного стану HEAD на вказаний стан

source: Remove files from the working tree and from the index
uk: Вилучення файлів із робочого каталогу та індексу

source: Show various types of objects
uk: Вивід різних типів об’єктів

source: Show the working tree status
uk: Вивід стану робочого каталогу

source: Create, list, delete or verify a tag object signed with GPG
uk: Створення, вивід переліку, вилучення або перевірка мітки, підписаної за допомогою GPG

source: Defining attributes per path
uk: Визначення атрибутів для шляхів файлів або каталогів

source: Specifies intentionally untracked files to ignore
uk: Вказування навмисно нехтуваних файлів

source: Defining submodule properties
uk: Визначення властивостей підмодулів

source: Specifying revisions and ranges for Git
uk: Вказування редакцій та діяпазонів для Git

source: An overview of recommended workflows with Git
uk: Огляд рекомендованих послідовностей виконуваних дій з Git

source: update the index with reused conflict resolution if possible
uk: оновити індекс за допомогою перевикористання вирішення конфлікту, якщо можливо

source: You need to start by "git bisect start"
uk: Вам потрібно почати за допомогою «git bisect start»

source: Do you want me to do it for you [Y/n]?
uk: Ви впевнені, що бажаєте, щоб я зробив це [Y - так/n - ні]?

source: unrecognised option: '$arg'
uk: нерозпізнана опція: «$arg»

source: '$arg' does not appear to be a valid revision
uk: «$arg» не схоже на дійсну редакцію

source: Bad HEAD - I need a HEAD
uk: Поганий вказівник HEAD — Необхідний вказівник HEAD

source: Checking out '$start_head' failed. Try 'git bisect reset <valid-branch>'.
uk: Збій переходу на «$start_head». Спробуйте виконати «git bisect reset <існуюча-гілка>».

source: won't bisect on cg-seek'ed tree
uk: неможливо виконати двійковий пошук на дереві після cg-seek

source: Bad HEAD - strange symbolic ref
uk: Поганий вказівник HEAD — дивне символьне посилання

source: Bad bisect_write argument: $state
uk: Поганий аргумент bisect_write: $state

source: Bad rev input: $arg
uk: Поганий ввід номера редакції: $arg

source: Bad rev input: $bisected_head
uk: Поганий ввід номера редакції: $bisected_head

source: Bad rev input: $rev
uk: Поганий ввід номера редакції: $rev

source: 'git bisect $TERM_BAD' can take only one argument.
uk: «git bisect $TERM_BAD» може приймати лише один аргумент.

source: Warning: bisecting only with a $TERM_BAD commit.
uk: Попередження: спроба двійкового пошуку з зазначенням лише $TERM_BAD коміту.

source: Are you sure [Y/n]?
uk: Ви впевнені [Y - так/n - ні]?

source: You need to give me at least one $bad_syn and one $good_syn revision. (You can use "git bisect $bad_syn" and "git bisect $good_syn" for that.)
uk: Вам потрібно передати мені як мінімум одну $bad_syn й одну $good_syn редакцію. (Для цього Ви можете використовувати команди «git bisect $bad_syn» й «git bisect $good_syn».)

source: You need to start by "git bisect start". You then need to give me at least one $good_syn and one $bad_syn revision. (You can use "git bisect $bad_syn" and "git bisect $good_syn" for that.)
uk: Для початку потрібно запустити «git bisect start». Після цього, Вам потрібно передати мені як мінімум одну $good_syn й одну $bad_syn редакцію. (Для цього Ви можете використовувати команди «git bisect $good_syn» й «git bisect $good_syn».)

source: We are not bisecting.
uk: Наразі Ви не у процесі бінарного пошуку.

source: '$invalid' is not a valid commit
uk: «$invalid» не є дійсним комітом

source: Could not check out original HEAD '$branch'. Try 'git bisect reset <commit>'.
uk: Не вдалося перейти на оригінальну гілку HEAD «$branch». Спробуйте запустити «git bisect reset <коміт>».

source: No logfile given
uk: Жодного файлу журналу не передано

source: cannot read $file for replaying
uk: неможливо прочитати $file для повтору змін

source: ?? what are you talking about?
uk: ?? Ви про що?

source: bisect run failed: no command provided.
uk: не вдалося виконати двійковий пошук: не передана команда.

source: running $command
uk: запускаю $command

source: bisect run failed: exit code $res from '$command' is < 0 or >= 128
uk: не вдалося виконати двійковий пошук: код завершення $res від «$command» виявився < 0 або >= 128

source: bisect run cannot continue any more
uk: bisect run більше не може продовжувати

source: bisect run failed: 'bisect_state $state' exited with error code $res
uk: не вдалося виконати двійковий пошук: «bisect_state $state» завершився з кодом помилки $res

source: bisect run success
uk: двійковий пошук виконаний успішно

source: Invalid command: you're currently in a $TERM_BAD/$TERM_GOOD bisect.
uk: Неприпустима команда: Ви зараз знаходитеся на $TERM_BAD/$TERM_GOOD двійковому пошуку.

source: no terms defined
uk: визначення не задані

source: invalid argument $arg for 'git bisect terms'. Supported options are: --term-good|--term-old and --term-bad|--term-new.
uk: неприпустимий аргумент $arg для «git bisect terms». Підтримувані параметри: --term-good|--term-old і --term-bad|--term-new.

source: Error: Your local changes to the following files would be overwritten by merge
uk: Помилка: Ваші локальні зміни в таких файлах будуть перезаписані при злитті

source: Automated merge did not work.
uk: Не вдалося автоматично злити зміни.

source: Should not be doing an octopus.
uk: Можливо octopus не підходить.

source: Unable to find common commit with $pretty_name
uk: Неможливо знайти спільний коміт з $pretty_name

source: Already up to date with $pretty_name
uk: Вже оновлено у відповідності з $pretty_name

source: Fast-forwarding to: $pretty_name
uk: Перемотування вперед до: $pretty_name

source: Trying simple merge with $pretty_name
uk: Спроба простого злиття з $pretty_name

source: Simple merge did not work, trying automatic merge.
uk: Просте злиття не спрацювало, спроба автоматичного злиття

source: Could not move back to $head_name
uk: Не вдалося перейти назад на $head_name

source: It seems that there is already a $state_dir_base directory, and I wonder if you are in the middle of another rebase. If that is the case, please try $cmd_live_rebase If that is not the case, please $cmd_clear_stale_rebase and run me again. I am stopping in case you still have something valuable there.
uk: Схоже, каталог $state_dir_base вже існує й я припускаю, що Ви у процесі іншого перебазування. Якщо це так, спробуйте $cmd_live_rebase Якщо ні $cmd_clear_stale_rebase та запустіть мене знову. Я зупиняюся, щоб Ви не втратили щось важливе.

source: invalid upstream '$upstream_name'
uk: неприпустимий upstream «$upstream_name»

source: $onto_name: there are more than one merge bases
uk: $onto_name: є більше однієї бази злиття

source: $onto_name: there is no merge base
uk: $onto_name: немає бази злиття

source: Does not point to a valid commit: $onto_name
uk: Не вказує на дійсний коміт: $onto_name

source: fatal: no such branch/commit '$branch_name'
uk: критична помилка: немає такої гілки/коміта «$branch_name»

source: Created autostash: $stash_abbrev
uk: Зміни автоматично сховані: $stash_abbrev

source: Current branch $branch_name is up to date.
uk: Поточна гілка $branch_name вже актуальна.

source: Current branch $branch_name is up to date, rebase forced.
uk: Поточна гілка $branch_name вже а актуальному стані, примусове перебазування.

source: Changes from $mb to $onto:
uk: Зміни від $mb до $onto:
