Repository: PlagaMedicum/Ubuntu-Translation-Demo
Catalog: rosetta-eoan/*/LC_MESSAGES/git.po
Languages: uk

source: unrecognized argument: %s
uk: невідомий аргумент: %s

source: Refusing to create empty bundle.
uk: Відхилення створення порожнього пакунку.

source: cannot create '%s'
uk: не вдалося створити «%s»

source: index-pack died
uk: критична помилка index-pack

source: invalid color value: %.*s
uk: неприпустиме значення кольору: %.*s

source: could not parse %s
uk: не вдалося обробити %s

source: %s %s is not a commit!
uk: %s %s не є комітом!

source: Commit %s has an untrusted GPG signature, allegedly by %s.
uk: Коміт %s містить недовірений GPG підпис, нібито від %s.

source: Commit %s has a bad GPG signature allegedly by %s.
uk: Коміт %s містить поганий GPG підпис, нібито від %s.

source: Commit %s does not have a GPG signature.
uk: Коміт %s не містить GPG підпис.

source: Commit %s has a good GPG signature by %s
uk: Коміт %s містить дійсний GPG підпис, від %s.

source: Warning: commit message did not conform to UTF-8. You may want to amend it after fixing the message, or set the config variable i18n.commitencoding to the encoding your project uses.
uk: Попередження: повідомлення коміту не відповідає UTF-8. Можливо ви хочете змінити коміт після виправлення його повідомлення чи налаштувати параметр i18n.commitencoding і вказати кодування повідомлень, які використовують ваш проект.

source: memory exhausted
uk: пам’ять вичерпано

source: relative config include conditionals must come from files
uk: відносні умовні включення конфігурації повинні виходити з файлів

source: invalid key: %s
uk: неприпустимий ключ: %s

source: bad config line %d in blob %s
uk: неправильний рядок конфігурації %d в двійковому об'єкті %s

source: bad config line %d in file %s
uk: неправильний рядок конфігурації %d в файлі %s

source: bad config line %d in standard input
uk: неправильний рядок конфігурації %d в стандартному введенні

source: bad config line %d in submodule-blob %s
uk: неправильний рядок конфігурації %d в двійковому об'єкті підмодуля %s

source: bad config line %d in command line %s
uk: неправильний рядок конфігурації %d в командному рядку %s

source: bad config line %d in %s
uk: неправильний рядок конфігурації %d в %s

source: out of range
uk: поза діапазоном

source: invalid unit
uk: неприпустима одиниця

source: bad numeric config value '%s' for '%s': %s
uk: неправильне числове конфігураційне значення «%s» для «%s»: %s

source: bad numeric config value '%s' for '%s' in blob %s: %s
uk: неправильне числове конфігураційне значення «%s» для «%s» в двійковому об'єкті %s: %s

source: bad numeric config value '%s' for '%s' in file %s: %s
uk: неправильне числове конфігураційне значення «%s» для «%s» в файлі %s: %s

source: bad numeric config value '%s' for '%s' in standard input: %s
uk: неправильне числове конфігураційне значення «%s» для «%s» на стандартному введенні: %s

source: bad numeric config value '%s' for '%s' in submodule-blob %s: %s
uk: неправильне числове конфігураційне значення «%s» для «%s» в двійковому об'єкті підмодуля %s: %s

source: bad numeric config value '%s' for '%s' in command line %s: %s
uk: неправильне числове конфігураційне значення «%s» для «%s» в командному рядку %s: %s

source: bad numeric config value '%s' for '%s' in %s: %s
uk: неправильне числове конфігураційне значення «%s» для «%s» в %s: %s

source: failed to expand user dir in: '%s'
uk: збій розгортання шляху каталогу користувача: «%s»

source: '%s' for '%s' is not a valid timestamp
uk: «%s» для «%s» не є припустимою міткою дати/часу

source: bad zlib compression level %d
uk: неправильний рівень стиснення zlib %d

source: invalid mode for object creation: %s
uk: неприпустимий режим створення об’єкту: %s

source: bad pack compression level %d
uk: неправильний рівень стиснення пакету %d

source: unable to parse command-line config
uk: не вдалося розібрати конфігурацію з командного рядка

source: unknown error occurred while reading the configuration files
uk: при читанні файлів конфігурації виникла невідома помилка

source: Invalid %s: '%s'
uk: Неприпустимий %s: «%s»

source: unknown core.untrackedCache value '%s'; using 'keep' default value
uk: невідоме значення «%s» для core.untrackedCache; використовую типове значення «keep»

source: splitIndex.maxPercentChange value '%d' should be between 0 and 100
uk: значення «%d» для splitIndex.maxPercentChange має бути від 0 до 100

source: unable to parse '%s' from command-line config
uk: не вдалося розібрати «%s» у конфігурації з командного рядка

source: bad config variable '%s' in file '%s' at line %d
uk: неправильна змінна конфігурації «%s» у файлі «%s» на рядку %d

source: %s has multiple values
uk: %s має декілька значень

source: fstat on %s failed
uk: збій при виконанні fstat на файлі %s

source: could not set '%s' to '%s'
uk: неможливо встановити «%s» в «%s»

source: could not unset '%s'
uk: неможливо скинути значення для «%s»

source: Could not read from remote repository. Please make sure you have the correct access rights and the repository exists.
uk: Неможливо прочитати з зовнішнього сховища. Впевніться, що ви маєте необхідні права доступу і сховище існує.

source: remote error: %s
uk: помилка віддаленого сховища: %s

source: Checking connectivity
uk: Перевірка з’єднання

source: Could not run 'git rev-list'
uk: Не вдається запустити «git rev-list»

source: failed write to rev-list
uk: збій запису в rev-list

source: failed to close rev-list's stdin
uk: збій закриття стандартного введення у rev-list

source: LF would be replaced by CRLF in %s
uk: LF буде замінено на CRLF в %s

source: in the future
uk: у майбутньому

source: %<PRIuMAX> second ago
uk: %<PRIuMAX> секунда тому

source: %<PRIuMAX> minute ago
uk: %<PRIuMAX> хвилина тому

source: %<PRIuMAX> hour ago
uk: %<PRIuMAX> годину тому

source: %<PRIuMAX> day ago
uk: %<PRIuMAX> день тому

source: %<PRIuMAX> week ago
uk: %<PRIuMAX> тиждень тому

source: %<PRIuMAX> month ago
uk: %<PRIuMAX> рік тому

source: %<PRIuMAX> year
uk: %<PRIuMAX> рік

source: %s, %<PRIuMAX> month ago
uk: %s, %<PRIuMAX> місяць тому

source: %<PRIuMAX> year ago
uk: %<PRIuMAX> рік тому

source: failed to read orderfile '%s'
uk: збій читання orderfile «%s»

source: Performing inexact rename detection
uk: Виконується неточне визначення перейменування

source: option '%s' requires a value
uk: параметр «%s» потребує значення

source: Failed to parse dirstat cut-off percentage '%s'
uk: Збій розбору величини зрізу(cut-off) у dirstat «%s»

source: Unknown dirstat parameter '%s'
uk: Невідомий параметр dirstat: «%s»

source: Unknown value for 'diff.submodule' config variable: '%s'
uk: Невідоме значення для змінної «diff.submodule»: «%s»

source: Found errors in 'diff.dirstat' config variable: %s
uk: Знайдено помилки в конфігураційній змінній 'diff.dirstat': %s

source: external diff died, stopping at %s
uk: критична помилка при зовнішньому порівнянні, зупинка на %s

source: --name-only, --name-status, --check and -s are mutually exclusive
uk: --name-only, --name-status, --check та -s неможливо використовувати одночасно

source: -G, -S and --find-object are mutually exclusive
uk: -G, -S та --find-object неможливо використовувати одночасно

source: --follow requires exactly one pathspec
uk: --follow потребує рівно однієї специфікації шляху

source: Failed to parse --dirstat/-X option parameter: %s
uk: Не вдалося розібрати параметр опції --dirstat/-X: %s

source: Failed to parse --submodule option parameter: '%s'
uk: Не вдалося розібрати параметр опції --submodule: «%s»

source: inexact rename detection was skipped due to too many files.
uk: неточне визначення перейменування було пропущено через занадто велику кількість файлів.

source: only found copies from modified paths due to too many files.
uk: знайдені тільки копії зі змінених шляхів через занадто велику кількість файлів.

source: you may want to set your %s variable to at least %d and retry the command.
uk: можливо ви захочете встановити змінну %s щонайменше в значення %d і повторити виклик команди.

source: could not open directory '%s'
uk: неможливо відкрити каталог «%s»

source: failed to get kernel name and information
uk: не вдалося отримати ім’я ядра та інформацію

source: could not create directories for %s
uk: неможливо створити каталоги для %s

source: could not migrate git directory from '%s' to '%s'
uk: неможливо перемістити каталог git з «%s» до «%s»

source: hint: Waiting for your editor to close the file...%c
uk: підказка: Очікування, поки ви закриєте редактор з файлом…%c

source: Filtering content
uk: Фільтрування вмісту

source: could not stat file '%s'
uk: неможливо виконати stat для файлу «%s»

source: Remote with no URL
uk: Віддалений без URL

source: git fetch-pack: expected shallow list
uk: git fetch-pack: очікується передача списку для отримання частини

source: git fetch-pack: expected ACK/NAK, got a flush packet
uk: git fetch-pack: очікувалось ACK/NAK, отримано пакет скидання

source: git fetch-pack: expected ACK/NAK, got '%s'
uk: git fetch-pack: очікується ACK/NAK, а отримано «%s»

source: --stateless-rpc requires multi_ack_detailed
uk: --stateless-rpc вимагає multi_ack_detailed

source: invalid shallow line: %s
uk: неприпустимий рядок часткового отримання: %s

source: invalid unshallow line: %s
uk: неприпустимий рядок повного отримання: %s

source: object not found: %s
uk: об'єкт не знайдено: %s

source: error in object: %s
uk: помилка в об'єкті: %s

source: no shallow found: %s
uk: часткове отримання не знайдено: %s

source: expected shallow/unshallow, got %s
uk: очікувалось shallow/unshallow, а отримано %s

source: got %s %d %s
uk: отримано %s %d %s

source: invalid commit %s
uk: неприпустимий коміт %s

source: giving up
uk: зупиняю подальші спроби

source: done
uk: виконано

source: got %s (%d) %s
uk: отримано %s (%d) %s

source: Marking %s as complete
uk: Позначаю %s як завершене

source: already have %s (%s)
uk: вже є %s (%s)

source: fetch-pack: unable to fork off sideband demultiplexer
uk: fetch-pack: не вдалося запустити програму розбору даних

source: protocol error: bad pack header
uk: помилка протоколу: неправильний заголовок потоку

source: fetch-pack: unable to fork off %s
uk: fetch-pack: не вдалося запустити програму %s

source: %s failed
uk: %s не вдалося

source: error in sideband demultiplexer
uk: сталася помилка в програмі розбору даних

source: Server does not support shallow clients
uk: Сервер не підтримує клієнтів з частковим клонуванням

source: Server supports multi_ack_detailed
uk: Сервер підтримує multi_ack_detailed

source: Server supports no-done
uk: Сервер підтримує no-done

source: Server supports multi_ack
uk: Сервер підтримує multi_ack

source: Server supports side-band-64k
uk: Сервер підтримує side-band-64k

source: Server supports side-band
uk: Сервер підтримує side-band

source: Server supports allow-tip-sha1-in-want
uk: Сервер підтримує allow-tip-sha1-in-want

source: Server supports allow-reachable-sha1-in-want
uk: Сервер підтримує allow-reachable-sha1-in-want

source: Server supports ofs-delta
uk: Сервер підтримує ofs-delta

source: Server supports filter
uk: Сервер підтримує фільтр

source: Server version is %.*s
uk: Версія сервера %.*s

source: Server does not support --shallow-since
uk: Сервер не підтримує --shallow-since

source: Server does not support --shallow-exclude
uk: Сервер не підтримує --shallow-exclude

source: Server does not support --deepen
uk: Сервер не підтримує --deepen

source: no common commits
uk: немає спільних комітів

source: git fetch-pack: fetch failed.
uk: git fetch-pack: помилка при отриманні даних.

source: no matching remote head
uk: немає відповідного віддаленого вказівника на гільку

source: remote did not send all necessary objects
uk: зовнішнє сховище надіслало не усі необхідні об'єкти

source: no such remote ref %s
uk: немає такого зовнішнього посилання %s

source: Server does not allow request for unadvertised object %s
uk: Сервер не підтримує запит для неоголошеного об'єкту %s

source: gpg failed to sign the data
uk: gpg не вдалося підписати дані

source: could not create temporary file
uk: неможливо створити тимчасовий файл

source: failed writing detached signature to '%s'
uk: збій запису від'єднаного підпису в «%s»

source: ignore invalid color '%.*s' in log.graphColors
uk: ігнорую неприпустимий колір «%.*s» в log.graphColors

source: '%s': unable to read %s
uk: «%s»: неможливо прочитати %s

source: failed to stat '%s'
uk: помилка отримання атрибутів «%s»

source: '%s': short read
uk: «%s»: замало прочитаних даних

source: start a working area (see also: git help tutorial)
uk: створити робочу область (дивіться також: git help tutorial)

source: work on the current change (see also: git help everyday)
uk: робота з поточними змінами (дивіться також: git help everyday)

source: examine the history and state (see also: git help revisions)
uk: перегляд історії та поточного стану (дивіться також: git help revisions)

source: grow, mark and tweak your common history
uk: вирощування, позначення та налаштування Вашої спільної історії

source: collaborate (see also: git help workflows)
uk: сумісна робота (дивіться також: git help workflows)

source: available git commands in '%s'
uk: доступні git-команди в «%s»

source: git commands available from elsewhere on your $PATH
uk: git-команди доступні скрізь в вашому $PATH

source: These are common Git commands used in various situations:
uk: Стандартні команди Git, що використовуються у різних ситуаціях:

source: '%s' appears to be a git command, but we were not able to execute it. Maybe git-%s is broken?
uk: «%s» схожа на команду git, але ми не змогли виконати її. Можливо, git-%s пошкоджений?

source: Uh oh. Your system reports no Git commands at all.
uk: Йой-йой. Ваша система повідомляє про відсутність Git-команд взагалі.

source: WARNING: You called a Git command named '%s', which does not exist.
uk: УВАГА: Ви запустили неіснуючу команду Git «%s».

source: Continuing under the assumption that you meant '%s'.
uk: Продовжуємо, припускаючи, що ви мали на увазі «%s».

source: Continuing in %0.1f seconds, assuming that you meant '%s'.
uk: Продовжимо через %0.1f сек, припускаючи, що ви мали на увазі «%s».

source: git: '%s' is not a git command. See 'git --help'.
uk: git: «%s» не є командою git. Дивіться «git --help».

source: The most similar command is
uk: Найбільш схожа команда:

source: git version [<options>]
uk: git version [<параметри>]

source: Did you mean this?
uk: Ви це мали на увазі ?

source: *** Please tell me who you are. Run git config --global user.email "you@example.com" git config --global user.name "Your Name" to set your account's default identity. Omit --global to set the identity only in this repository.
uk: *** Будь ласка, скажіть нам хто ви є. Запустіть git config --global user.email "you@example.com" git config --global user.name "Ваше ім'я" для зазначення типових ідентифікаційних даних облікового запису. Пропустіть параметр --global для вказівки даних тільки для цього сховища.

source: no email was given and auto-detection is disabled
uk: адреса електронної пошти не зазначена і автовизначення вимкнено

source: unable to auto-detect email address (got '%s')
uk: не вдалося виконати автовизначення адреси електронної пошти (отримано «%s»)

source: no name was given and auto-detection is disabled
uk: ім'я не зазначено і автовизначення вимкнено

source: unable to auto-detect name (got '%s')
uk: не вдалося виконати автовизначення імені (отримано «%s»)

source: empty ident name (for <%s>) not allowed
uk: порожнє ім'я ідентифікатора (для <%s>) не дозволене

source: name consists only of disallowed characters: %s
uk: ім'я складається лише з недозволених символів: %s

source: invalid date format: %s
uk: неправильний формат дати: %s

source: multiple filter-specs cannot be combined
uk: кілька filter-specs не може бути скомбіновано

source: cannot change partial clone promisor remote
uk: неможливо змінити частковий клон promisor remote

source: Unable to create '%s.lock': %s. Another git process seems to be running in this repository, e.g. an editor opened by 'git commit'. Please make sure all processes are terminated then try again. If it still fails, a git process may have crashed in this repository earlier: remove the file manually to continue.
uk: Не вдалося створити «%s.lock»: %s. Схоже, що в цьому сховищі запущений інший процес git, наприклад, командою «git commit» відкрито редактор. Будь ласка, впевніться, що були завершені всі процеси і потім спробуйте ще раз. Якщо помилка повторюється, то можливо раніше git в цьому сховищі зазнав збою: для продовження видаліть файл вручну.

source: Unable to create '%s.lock': %s
uk: Неможливо створити «%s.lock»: %s

source: failed to read the cache
uk: збій читання кешу

source: unable to write new index file
uk: не вдається записати новий індексний файл

source: (bad commit)
uk: (невірний коміт)

source: error building trees
uk: помилка побудови дерев

source: failed to create path '%s'%s
uk: не вдалося створити шлях «%s»%s

source: Removing %s to make room for subdirectory
uk: Вилучення %s, щоб звільнити місце для підкаталогу

source: : perhaps a D/F conflict?
uk: : можливо конфлікт каталогів/файлів?

source: refusing to lose untracked file at '%s'
uk: неможливо відімкнути невідстежуваний файл «%s»

source: cannot read object %s '%s'
uk: не вдається прочитати об’єкт %s «%s»

source: blob expected for %s '%s'
uk: очікується двійковий об’єкт для %s «%s»

source: failed to open '%s': %s
uk: не вдалося відкрити «%s»: %s

source: failed to symlink '%s': %s
uk: не вдалося створити символічне посилання «%s»: %s

source: do not know what to do with %06o %s '%s'
uk: не знаю, що робити з %06o %s «%s»

source: Failed to execute internal merge
uk: Не вдалося виконати внутрішнє злиття

source: Unable to add %s to database
uk: Не вдається додати %s в базу даних

source: Auto-merging %s
uk: Автоматичне злиття %s

source: CONFLICT (%s/delete): %s deleted in %s and %s in %s. Version %s of %s left in tree.
uk: КОНФЛІКТ (%s/delete): %s вилучено в %s і %s в %s. Версія %s з %s тих, що залишилися в дереві.

source: CONFLICT (%s/delete): %s deleted in %s and %s to %s in %s. Version %s of %s left in tree.
uk: КОНФЛИКТ (%s/видалення): %s видалено в %s і від %s до %s в %s. Версія %s з %s залишена в дереві.

source: CONFLICT (%s/delete): %s deleted in %s and %s in %s. Version %s of %s left in tree at %s.
uk: КОНФЛІКТ (%s/видалення): %s видалено в %s і %s в %s. Версія %s з %s залишена в дереві на %s.

source: CONFLICT (%s/delete): %s deleted in %s and %s to %s in %s. Version %s of %s left in tree at %s.
uk: КОНФЛИКТ (%s/видалення): %s видалено в %s і від %s до %s в %s. Версія %s з %s залишена в дереві на %s.

source: rename
uk: перейменувати

source: renamed
uk: перейменовано

source: %s is a directory in %s adding as %s instead
uk: %s є каталогом в %s, доданій замість %s

source: CONFLICT (rename/rename): Rename "%s"->"%s" in branch "%s" rename "%s"->"%s" in "%s"%s
uk: КОНФЛИКТ (перейменування/перейменування): Перейменування «%s»→«%s» в гілці «%s» і перейменування «%s»→«%s» в гілці «%s»%s

source: (left unresolved)
uk: (залишилося невирішеним)

source: CONFLICT (rename/rename): Rename %s->%s in %s. Rename %s->%s in %s
uk: КОНФЛІКТ (перейменування/перейменування): Перейменування «%s»→«%s» в гілці %s. Перейменування «%s»→«%s» в гілці %s.

source: Renaming %s to %s and %s to %s instead
uk: Перейменовую %s на %s і %s на %s замість цього

source: CONFLICT (rename/add): Rename %s->%s in %s. %s added in %s
uk: КОНФЛИКТ (перейменування/додавання): Перейменування «%s»→«%s» в гілці «%s» і додавання «%s» в гілці «%s»

source: Adding merged %s
uk: Додавання злитого %s

source: Adding as %s instead
uk: Додавання %s замість

source: cannot read object %s
uk: неможливо прочитати об’єкт %s

source: object %s is not a blob
uk: об’єкт %s не є двійковим об'єктом

source: modify
uk: змінити

source: modified
uk: змінено

source: content
uk: вміст

source: add/add
uk: додавання/додавання

source: Skipped %s (merged same as existing)
uk: Пропущені %s (злиті однакові зміни як існуючі)

source: submodule
uk: субмодуль

source: CONFLICT (%s): Merge conflict in %s
uk: КОНФЛІКТ (%s): Конфлікт злиття в %s

source: Removing %s
uk: Вилучення %s

source: file/directory
uk: файл/каталог

source: directory/file
uk: каталог/файл

source: CONFLICT (%s): There is a directory with name %s in %s. Adding %s as %s
uk: КОНФЛІКТ (%s): Каталог з іменем %s існує в %s. Додавання %s як %s

source: Adding %s
uk: Додавання %s

source: Already up to date!
uk: Вже актуальне!

source: merging of trees %s and %s failed
uk: злиття дерев %s і %s не вдалося

source: Merging:
uk: Злиття:

source: found %u common ancestor:
uk: знайдено %u спільний пращур:

source: merge returned no commit
uk: злиття не повертає коміт

source: Could not parse object '%s'
uk: Неможливо розібрати об’єкт «%s»

source: Unable to write index.
uk: Неможливо записати індекс.

source: You have not concluded your previous notes merge (%s exists). Please, use 'git notes merge --commit' or 'git notes merge --abort' to commit/abort the previous merge before you start a new notes merge.
uk: Ви не закінчили попереднє злиття приміток (%s існує). Запустіть «git notes merge --commit» чи «git notes merge --abort» для створення коміту чи скасування попереднього злиття і запуску нового злиття приміток.

source: You have not concluded your notes merge (%s exists).
uk: Ви не закінчили попереднє злиття приміток (%s існує).

source: Cannot commit uninitialized/unreferenced notes tree
uk: Неможна закомітити неініціалізоване або таке, що не має посилань, дерево приміток

source: Bad notes.rewriteMode value: '%s'
uk: Неправильне значення notes.rewriteMode: «%s»

source: Refusing to rewrite notes in %s (outside of refs/notes/)
uk: Відмова у перезаписі приміток в %s (за межами refs/notes/)

source: Bad %s value: '%s'
uk: Невірне значення змінної %s: «%s»

source: unable to parse object: %s
uk: не вдалося розібрати об’єкт: %s

source: offset before end of packfile (broken .idx?)
uk: зсув до кінця файлу пакета (можливо, пошкоджений файл .idx?)

source: offset before start of pack index for %s (corrupt index?)
uk: зсув до початку індексу паки для %s (пошкоджений індекс?)

source: offset beyond end of pack index for %s (truncated index?)
uk: зсув до початку індексу паки для %s (зрізаний індекс?)

source: usage: %s
uk: використання: %s

source: or: %s
uk: або: %s

source: -NUM
uk: -КІЛЬКІСТЬ

source: malformed object name '%s'
uk: Пошкоджене ім’я об’єкту «%s»

source: Could not make %s writable by group
uk: Не вдалося надати доступ до %s на запис

source: Escape character '\' not allowed as last character in attr value
uk: Екранований символ «\» недозволений як останній символ для значення attr

source: Only one 'attr:' specification is allowed.
uk: Дозволений лише один специфікатор «attr:».

source: attr spec must not be empty
uk: специфікатор attr не має бути порожній

source: invalid attribute name %s
uk: неприпустима назва атрибуту %s

source: global 'glob' and 'noglob' pathspec settings are incompatible
uk: глобальні опції специфікації шляху «glob» і «noglob» неможливо використовувати одночасно

source: global 'literal' pathspec setting is incompatible with all other global pathspec settings
uk: глобальна опція специфікації щляху «literal» не сумісна з іншими глобальними специфікаторами доступу

source: invalid parameter for pathspec magic 'prefix'
uk: неправильний параметр для магічного слова «prefix» у специфікації шляху

source: Invalid pathspec magic '%.*s' in '%s'
uk: неправильне магічне слово «%.*s» у специфікації шляху «%s»

source: Missing ')' at the end of pathspec magic in '%s'
uk: Пропущено «)» у кінці магічного слова специфікації шляху «%s»

source: Unimplemented pathspec magic '%c' in '%s'
uk: Нереалізоване магічне слово «%c» специфікації шляху «%s»

source: %s: 'literal' and 'glob' are incompatible
uk: %s: «literal» і «glob» несумісні
