Repository: PlagaMedicum/Ubuntu-Translation-Demo
Catalog: rosetta-eoan/*/LC_MESSAGES/ibus-pinyin.po
Languages: uk

source: Pinyin input method
uk: Спосіб введення для стандарту піньїнь китайської мови

source: Pinyin (debug)
uk: Піньїнь (діагностика)

source: Pinyin input method (debug)
uk: Спосіб введення піньїнь (діагностика)

source: Bopomofo (debug)
uk: Бопомофо (діагностика)

source: Bopomofo input method (debug)
uk: Спосіб введення бопомофо (діагностика)

source: Chinese
uk: Китайська

source: Full/Half width
uk: Повна/половинна ширина

source: Full/Half width punctuation
uk: Знаки пунктуації повної/половинної ширини

source: Simplfied/Traditional Chinese
uk: Спрощені/традиційні єрогліфи

source: Preferences
uk: Параметри

source: <big><b>IBus Pinyin %s</b></big>
uk: <big><b>IBus Піньїнь %s</b></big>

source: Language:
uk: Мова:

source: Half/full width:
uk: Повна/половинна ширина:

source: Punctuations:
uk: Пунктуація:

source: English
uk: Англійська

source: Full
uk: Повна

source: Half
uk: Половинна

source: Chinese:
uk: Китайська:

source: Simplified
uk: спрощена

source: Traditional
uk: традиційна

source: <b>Initial state</b>
uk: <b>Початковий стан</b>

source: Orientation of candidates:
uk: Орієнтація кандидатів

source: Number of candidates:
uk: Число кандидатів

source: General
uk: Загальні

source: Full pinyin
uk: Повний піньїнь

source: Double pinyin
uk: Подвійний піньїнь

source: Show raw input of Double Pinyin
uk: Показувати необроблене введення для подвійного піньїну

source: Incomplete pinyin
uk: Неповний піньїнь

source: <b>Pinyin mode</b>
uk: <b>Режим піньїнь </b>

source: [Shift] select candidate
uk: Використовувати [Shift] для вибору кандидатів

source: [-] [=] flip page
uk: Використовувати клавіші [-] [=] для перемикання сторінок

source: [,] [.] flip page
uk: Використовувати клавіші [,] [.] для перемикання сторінок

source: Auto commit
uk: Автоматично підтверджувати фразу

source: <b>Input Custom</b>
uk: <b>Введення власних</b>

source: Enable correct pinyin
uk: Увімкнути правильний піньїнь

source: <b>Correct pinyin</b>
uk: <b>Правильний піньїнь</b>

source: Pinyin mode
uk: Режим піньїнь

source: Incomplete Bopomofo
uk: Неповний Бопомофо

source: Keyboard Mapping:
uk: Клавіатурний відповідник:

source: <b>Bopomofo mode</b>
uk: <b>Режим бопомофо</b>

source: Selection Keys:
uk: Клавіші вибору:

source: Enable Guidekey for Candidates Selection
uk: Увімкнути довідку для вибору кандидатів

source: Enable Auxiliary Select Keys F1 .. F10
uk: Увімкнуті допоміжні клавіші вибору F1 .. F10

source: Enable Auxiliary Select Keys Numbers on Keypad
uk: Увімкнути допоміжні клавіші цифрової клавіатури

source: <b>Selection mode</b>
uk: <b>Вибір режиму</b>

source: Feature of Enter key:
uk: Функція клавіші Enter:

source: Commit first candidate
uk: Підтверджувати першого кандидата

source: Commit original text
uk: Підтверджувати оригінальний текст

source: <b>Other</b>
uk: <b>Інше</b>

source: Bopomofo mode
uk: Режим бопомофо

source: Enable fuzzy syllable
uk: Увімкнути нечіткий склад

source: Fuzzy syllable
uk: Нечіткий склад

source: Use custom phrases
uk: Використовувати власні фрази

source: Edit custom phrases
uk: Редагувати власні фрази

source: <b>Dictionary option</b>
uk: <b>Параметри словника</b>

source: Dictionary
uk: Словник

source: Pinyin input method for IBus
uk: Спосіб введення піньїнів для IBus

source: <small>Copyright (c) 2009-2010 Peng Huang</small>
uk: <small>Авторське право (c) 2009-2010 Peng Huang</small>

source: <small> <b>Authors:</b> Peng Huang BYVoid Peng Wu <b>Contributors:</b> koterpilla, Zerng07 </small>
uk: <small> <b>Автори:</b> Peng Huang BYVoid Peng Wu <b>Співавтори:</b> koterpilla, Zerng07 </small>

source: About
uk: Про програму

source: Standard
uk: Стандартний

source: Eten
uk: Етен

source: Horizontal
uk: Горизонтально

source: Vertical
uk: Вертикально
