Repository: PlagaMedicum/Ubuntu-Translation-Demo
Catalog: rosetta-eoan/*/LC_MESSAGES/indicator-printers.po
Languages: be

source: Printers
be: Друкаркі

source: Paused
be: Прыпынена

source: You have %d job queued to print on this printer.
be: У вас %d заданне ў чарзе на друк.

source: Printing Problem
be: Перашкоды пры друкаванні

source: _Settings…
be: _Налады…

source: The printer “%s” is low on paper.
be: У друкарцы „%s“ мала паперы.

source: The printer “%s” is out of paper.
be: У друкарцы „%s“ няма паперы.

source: The printer “%s” is low on toner.
be: У друкарцы „%s“ мала тонару.

source: The printer “%s” is out of toner.
be: У друкарцы „%s“ скончыўся тонар.

source: A cover is open on the printer “%s”.
be: Накрыўка друкаркі „%s“ адчыненая.

source: A door is open on the printer “%s”.
be: Адчынена накрыўка друкаркі „%s“.

source: The printer “%s” can’t be used, because required software is missing.
be: Адсутнічае патрэбны драйвер для друкаркі „%s“.

source: The printer “%s” is currently off-line.
be: У гэты момант друкарка „%s“ недаступная.
