Repository: PlagaMedicum/Ubuntu-Translation-Demo
Catalog: rosetta-eoan/*/LC_MESSAGES/indicator-session.po
Languages: be

source: Are you sure you want to close all programs and log out?
be: Ці Вы ўпэўненыя, што хочаце закрыць усе праграмы і выйсці?

source: Some software updates won't be applied until the computer next restarts.
be: Некаторыя абнаўленні праграмнага забеспячэння не будуць прымяняцца, пакуль кампутар наступным запуску.

source: Log Out
be: Выйсці з сесіі

source: Cancel
be: Скасаваць

source: Restart
be: Перастартаваць

source: Are you sure you want to close all programs and restart the computer?
be: Вы сапраўды жадаеце зачыніць усе праграмы і перастартаваць кампʼютар?

source: Shut Down
be: Вымкнуць

source: Are you sure you want to close all programs and shut down the computer?
be: Вы сапраўды жадаеце зачыніць усе праграмы і вымкнуць кампʼютар?

source: System, %s
be: Сістэма, %s

source: System
be: Сістэмнае паведамленне

source: Guest
be: Госць

source: About This Computer
be: Пра гэты кампʼютар

source: System Settings…
be: Сістэмныя налады...

source: Online Accounts…
be: Сеціўныя рахункі...

source: Start Screen Saver
be: Стартаваць захавальнік экрану

source: Switch Account…
be: Змяніць конт...

source: Switch Account
be: Змяніць конт

source: Lock/Switch Account…
be: Заблакаваць/змяніць крастальніка...

source: Lock/Switch Account
be: Заблакаваць\змяніць конт

source: Lock
be: Заблакаваць

source: Guest Session
be: Гасцявая сесія

source: Log Out…
be: Выйсці з сэсіі...

source: Suspend
be: Прыпыніць

source: Hibernate
be: Гібернацыя

source: Restart…
be: Перастартаваць...

source: Shut Down…
be: Вымкнуць...
