Repository: PlagaMedicum/Ubuntu-Translation-Demo
Catalog: rosetta-eoan/*/LC_MESSAGES/JabberBot.po
Languages: uk

source: Here's the page "%(pagename)s" that you've requested: %(data)s
uk: Тут представлена запитана вами сторінка "%(pagename)s": %(data)s

source: That's the list of pages accesible to you: %s
uk: Список доступних Вам сторінок: %s

source: Following detailed information on page "%(pagename)s" is available:: %(data)s
uk: Доступна наступна детальна інформація на сторінці "%(pagename)s" :: %(data)s

source: Submit this form to perform a wiki search
uk: Підтвердіть цю форму для початку wiki-пошуку

source: Title search
uk: Пошук по назві

source: Full-text search
uk: Повнотекстовий пошук

source: Wiki search
uk: Wiki пошук

source: Search text
uk: Шукати текст

source: Please specify the search criteria.
uk: Будь ласка, уточніть критерії пошуку

source: This command requires a client supporting Data Forms
uk: Ця команда потребує підтримки Data Forms у Вашому клієнті

source: The "help" command prints a short, helpful message about a given topic or function. Usage: help [topic_or_function]
uk: Команда "help" показує коротке повідомлення по обраній темі або функції. Використання: help [тема_або_функція]

source: The "ping" command returns a "pong" message as soon as it's received.
uk: Команда "ping" повертає "pong" повідомлення одразу по його отриманні.

source: searchform - perform a wiki search using a form
uk: searchform - надає wiki-пошук за допомогою форми

source: %(command)s - %(description)s Usage: %(command)s %(params)s
uk: %(command)s - %(description)s Застосування: %(command)s %(params)s

source: Unknown command "%s"
uk: Невідома команда "%s"

source: You've specified a wrong parameter list. The call should look like: %(command)s %(params)s
uk: Ви вказали хибний список параметрів. Команда повинна виглядати як: %(command)s %(params)s

source: Hello there! I'm a MoinMoin Notification Bot. Available commands: %(internal)s %(xmlrpc)s
uk: Привіт! Я робот-повідомник MoinMoin. Доступні команди: %(internal)s %(xmlrpc)s

source: You must set a (long) secret string!
uk: Потрібно ввести (бажано довгий) секретний рядок!

source: Error
uk: Помилка

source: Your request has failed. The reason is: %s
uk: Ваш запит був невдалим. Тому, що: %s

source: A serious error occured while processing your request: %s
uk: При обробці Вашого запиту виникла серйозна помилка: %s

source: An internal error has occured, please contact the administrator.
uk: Виникла внутрішня помилка. Зв’яжіться з адміністратором, будь-ласка.

source: Credentials check failed, you may be unable to see all information.
uk: Неможливо перевірити повноваження, можливо ви не зможете побачити усі відомості.

source: This command may take a while to complete, please be patient...
uk: Виконання цієї команди може зайняти певний час. Будь-ласка зачекайте...

source: Last author: %(author)s Last modification: %(modification)s Current version: %(version)s
uk: Останній автор: %(author)s Остання зміна: %(modification)s Поточна версія: %(version)s

source: You must set a (long) secret string
uk: Потрібно ввести (бажано довгий) секретний рядок

source: You are not allowed to use this bot!
uk: В Вас немає прав на використання цього бота!
