Repository: PlagaMedicum/Ubuntu-Translation-Demo
Catalog: rosetta-eoan/*/LC_MESSAGES/NetworkManager-pptp.po
Languages: uk

source: PPTP VPN client
uk: Клієнт PPTP VPN

source: Client for PPTP virtual private networks
uk: Клієнт для віртуальних приватних мереж PPTP

source: Support for configuring PPTP virtual private network connections.
uk: Підтримка налаштування віртуальних приватних мережевих з'єднань PPTP.

source: Compatible with various PPTP servers including Microsoft.
uk: Сумісність з різними PPTP-серверами, включаючи Microsoft.

source: The NetworkManager Developers
uk: Розробники NetworkManager

source: You need to authenticate to access the Virtual Private Network “%s”.
uk: Для доступу до віртуальної приватної мережі «%s» необхідна автентифікація.

source: Authenticate VPN
uk: Автентифікація VPN

source: Password:
uk: Пароль:

source: All Available (Default)
uk: Усі доступні (типово)

source: 128-bit (most secure)
uk: 128 біт (найбільш захищене)

source: 40-bit (less secure)
uk: 40 біт (менш захищене)

source: Compatible with Microsoft and other PPTP VPN servers.
uk: Сумісний з серверами Microsoft та іншими серверами PPTP VPN.

source: object class '%s' has no property named '%s'
uk: у класі об’єктів «%s» немає властивості із назвою «%s»

source: property '%s' of object class '%s' is not writable
uk: властивість «%s» класу об’єктів «%s» є недоступною для запису

source: construct property "%s" for object '%s' can't be set after construction
uk: властивість construct «%s» об’єкта «%s» не можна задавати після побудови

source: '%s::%s' is not a valid property name; '%s' is not a GObject subtype
uk: «%s::%s» не є коректною назвою властивості; «%s» не є підтипом GObject

source: unable to set property '%s' of type '%s' from value of type '%s'
uk: не вдалося задати значення властивості «%s» типу «%s» на основі значення типу «%s»

source: value "%s" of type '%s' is invalid or out of range for property '%s' of type '%s'
uk: значення «%s» типу «%s» є некоректним для властивості «%s» типу «%s» або не належить до припустимого діапазону значень

source: missing plugin file "%s"
uk: відсутній плагін файла «%s»

source: cannot load editor plugin: %s
uk: неможливо завантажити плагін редактора: %s

source: cannot load factory %s from plugin: %s
uk: неможливо завантажити фабрику %s із плагіна: %s

source: unknown error creating editor instance
uk: невідома помилка під час створення екземпляру редактора

source: invalid gateway “%s”
uk: неприпустимий шлюз «%s»

source: invalid integer property “%s”
uk: неприпустима цілочисельна властивість «%s»

source: invalid boolean property “%s” (not yes or no)
uk: неприпустима логічна властивість «%s» (ані так, ані ні)

source: unhandled property “%s” type %s
uk: необроблена властивість «%s» типу %s

source: property “%s” invalid or not supported
uk: властивість «%s» неприпустима або не підтримується

source: No VPN configuration options.
uk: Немає параметрів налаштування VPN.

source: Missing required option “%s”.
uk: Відсутній обов'язковий параметр «%s»

source: No VPN secrets!
uk: Немає VPN секрету!

source: Could not find pptp client binary.
uk: Не вдалося знайти двійковий файл PPTP клієнта.

source: Missing VPN gateway.
uk: Відсутній шлюз VPN.

source: Could not find the pppd binary.
uk: Неможливо знайти двійковий файл pppd.

source: Missing VPN username.
uk: Відсутне ім’я користувача VPN.

source: Missing or invalid VPN password.
uk: Відсутній або помилковий пароль VPN.

source: couldn’t convert PPTP VPN gateway IP address “%s” (%d)
uk: неможливо конвертувати IP-адресу шлюза PPTP VPN «%s» (%d)

source: couldn’t look up PPTP VPN gateway IP address “%s” (%d)
uk: неможливо знайти IP-адресу шлюза PPTP VPN «%s» (%d)

source: no usable addresses returned for PPTP VPN gateway “%s”
uk: для шлюзу PPTP VPN «%s» повернуто неприпустимі для застосування адреси

source: Invalid or missing PPTP gateway.
uk: Недійсний чи відсутній шлюз PPTP.

source: Don’t quit when VPN connection terminates
uk: Не завершувати роботу при вимиканні з'єднання VPN

source: Enable verbose debug logging (may expose passwords)
uk: Увімкнути докладне протоколювання для відлагодженне (можливе розкриття паролю)

source: D-Bus name to use for this instance
uk: Найменування D-Bus використовуваної цією виконуваною копією

source: nm-pptp-service provides integrated PPTP VPN capability (compatible with Microsoft and other implementations) to NetworkManager.
uk: nm-pptp-service надає інтегровані можливості PPTP VPN (сумісні з Microsoft та іншими реалізаціями ) для NetworkManager.

source: Default
uk: Типово

source: PPTP Advanced Options
uk: Додаткові параметри PPTP

source: Authentication
uk: Автентифікація

source: Allow the following authentication methods:
uk: Дозволити наступні методи автентифікації:

source: Allow/disable authentication methods. config: refuse-pap, refuse-chap, refuse-mschap, refuse-mschap-v2, refuse-eap
uk: Увімкнути або вимкнути способи розпізнавання. налаштування: refuse-pap, refuse-chap, refuse-mschap, refuse-mschap-v2, refuse-eap

source: Security and Compression
uk: Шифрування та стиснення

source: Use _Point-to-Point encryption (MPPE)
uk: Використовувати шифрування _MPPE

source: Note: MPPE encryption is only available with MSCHAP authentication methods. To enable this checkbox, select one or more of the MSCHAP authentication methods: MSCHAP or MSCHAPv2.
uk: Примітка: Шифрування MPPE доступно лише з методами автентифікації MSCHAP. Щоб увімкнути цей пункт, виберіть один чи кілька методів автентифікації MSCHAP: MSCHAP чи MSCHAPv2.

source: _Security:
uk: _Шифрування:

source: Require the use of MPPE, with 40/128-bit encryption or all. config: require-mppe, require-mppe-128 or require-mppe-40
uk: Вимагати використання MPPE з 40/128-бітовим шифруванням або з усіма шифруваннями. налаштування: require-mppe, require-mppe-128 або require-mppe-40

source: Allow st_ateful encryption
uk: Увімкнути _Stateful шифрування

source: Allow MPPE to use stateful mode. Stateless mode is still attempted first. config: mppe-stateful (when checked)
uk: Дозволити MPPE використання режиму зі станом. Першою буде виконано спробу використання режиму без стану. налаштування: mppe-stateful (якщо позначено)

source: Allow _BSD data compression
uk: Увімкнути стиснення _BSD

source: Allow/disable BSD-Compress compression. config: nobsdcomp (when unchecked)
uk: Дозволити або заборонити стискання BSD-Compress. налаштування: nobsdcomp (якщо не позначено)

source: Allow _Deflate data compression
uk: Дозволити стиснення _Deflate

source: Allow/disable Deflate compression. config: nodeflate (when unchecked)
uk: Дозволити або заборонити стискання Deflate. налаштування: nodeflate (якщо не позначено)

source: Use TCP _header compression
uk: Використовувати стиснення _заголовків TCP

source: Allow/disable Van Jacobson style TCP/IP header compression in both the transmit and the receive directions. config: novj (when unchecked)
uk: Дозволити або заборонити стиль Ван-Якобсена стискання заголовків TCP/IP у обох напрямках, надсилання і отримання. налаштування: novj (якщо не позначено)

source: Echo
uk: Луна

source: Send PPP _echo packets
uk: Надсилати _echo-пакети PPP

source: Send LCP echo-requests to find out whether peer is alive. config: lcp-echo-failure and lcp-echo-interval
uk: Надсилати луна-запити LCP для визначення, чи перебуває вузол на зв’язку. налаштування: lcp-echo-failure і lcp-echo-interval

source: Misc
uk: Інше

source: Use custom _unit number:
uk: Використовувати користувацький номер пристрою:

source: Enable custom index for ppp<n> device name. config: unit <n>
uk: Увімкнути користувацький індекс для ppp<n> імені пристрою. config: номер <n>

source: General
uk: Загальне

source: PPTP server IP or name. config: the first parameter of pptp
uk: IP- адреса або назва сервера PPTP. налаштування: перший параметр pptp

source: _Gateway:
uk: _Шлюз:

source: Optional
uk: Додатвокі

source: Append the domain name <domain> to the local host name for authentication purposes. config: domain <domain>
uk: Додати назву домену <домен> до назви локального вузла з метою розпізнавання. налаштування: domain <домен>

source: NT Domain:
uk: NT-домен:

source: Show password
uk: Показати пароль

source: Password passed to PPTP when prompted for it.
uk: Пароль, що передаватиметься PPTP у разі потреби.

source: Set the name used for authenticating the local system to the peer to <name>. config: user <name>
uk: Встановити ім’я, яке буде використано для розпізнавання локальної системи на вузлі, у значення <ім’я>. налаштування: user <ім’я>

source: User name:
uk: Ім’я користувача:

source: Ad_vanced…
uk: _Додатково…
