Repository: PlagaMedicum/Ubuntu-Translation-Demo
Catalog: rosetta-eoan/*/LC_MESSAGES/NetworkManager-openvpn.po
Languages: uk

source: OpenVPN client
uk: Клієнт OpenVPN

source: Client for OpenVPN virtual private networks
uk: Клієнт для віртуальних приватних мереж OpenVPN

source: Support for configuring OpenVPN virtual private network connections.
uk: Підтримка налаштування відкритих приватних мережевих з'єднань OpenVPN.

source: OpenVPN is a popular and flexible free-software VPN solution.
uk: OpenVPN - це популярне та гнучке рішення для вільного програмного забезпечення VPN.

source: The NetworkManager Developers
uk: Розробники NetworkManager

source: Authenticate VPN %s
uk: Автентифікація VPN %s

source: Password:
uk: Пароль:

source: Certificate password:
uk: Пароль сертифіката:

source: HTTP proxy password:
uk: Пароль HTTP proxy:

source: Authenticate VPN
uk: Автентифікація VPN

source: Certificate pass_word:
uk: Па_роль сертифіката:

source: _HTTP proxy password:
uk: Пароль _HTTP proxy:

source: You need to authenticate to access the Virtual Private Network “%s”.
uk: Для доступу до віртуальної приватної мережі «%s» необхідна автентифікація.

source: option %s expects between %u and %u argument
uk: опція %s очікує на аргумент між %u та %u

source: option %s expects no arguments
uk: параметр %s не очікує аргументів

source: option %s expects exactly one argument
uk: параметр %s очікує лише один аргумент

source: argument %s of “%s” can not be empty
uk: аргумент %s для «%s» не може бути порожнім

source: argument of “%s” can not be empty
uk: аргумент для «%s» не може бути порожнім

source: argument %s of “%s” must be UTF-8 encoded
uk: аргумент %s для «%s» має бути в кодуванні UTF-8

source: argument of “%s” must be UTF-8 encoded
uk: аргумент для «%s» має бути в кодуванні UTF-8

source: invalid %uth argument to “%s” where number expected
uk: неприпустимий %u-й аргумент для «%s», де очікується число

source: unsupported %uth argument %s to “%s”
uk: непідтримуваний %u-й аргумент %s для «%s»

source: unsupported %uth argument to “%s” which looks like a FQDN but only IPv4 address supported
uk: непідтримуваний %u-й аргумент для «%s», що виглядає як FQDN , але підтримується лише IPv4-адреса

source: invalid %uth argument to “%s” where IPv4 address expected
uk: неприпустимий %u-й аргумент для «%s», де очікується IPv4-адреса

source: invalid %uth key-direction argument to “%s”
uk: неприпустимий %u-й аргумент key-direction для «%s»

source: invalid %uth argument to “%s”
uk: неприпустимий %u-й аргумент для «%s»

source: unterminated %s at position %lld
uk: неперерваний %s у позиції %lld

source: double quote
uk: подвійні лапки

source: single quote
uk: одинарні лапки

source: trailing escaping backslash at position %lld
uk: кінцева екрануюча зворотня коса риска на позиції %lld

source: unable to read HTTP proxy auth file
uk: неможливо прочитати файл авторизації для HTTP proxy

source: cannot read user/password from HTTP proxy auth file
uk: неможливо прочитати користувача/пароль з файлу авторизації для HTTP proxy

source: user/password from HTTP proxy auth file must be UTF-8 encoded
uk: користувач/пароль з файлу авторизації для HTTP proxy має бути в кодуванні UTF-8

source: “%s” is not a directory
uk: «%s» не є каталогом

source: cannot create “%s” directory
uk: неможливо створити каталог «%s»

source: cannot write <%s> blob from line %ld to file (%s)
uk: неможливо записати двійковий об'єкт <%s> з рядка %ld до файлу (%s)

source: cannot write <%s> blob from line %ld to file “%s”
uk: неможливо записати двійковий об'єкт <%s> з рядка %ld до файлу «%s»

source: unsupported mtu-disc argument
uk: непідтримуваний аргумент mtu-disc

source: unsupported crl-verify argument
uk: непідтримуваний аргумент crl-verify

source: invalid option
uk: некоректний параметр

source: unsupported comp-lzo argument
uk: непідтримуваний аргумент comp-lzo

source: remote cannot contain space
uk: віддалений не може містити пробіл

source: remote cannot contain comma
uk: віддалений не може містити кому

source: remote expects protocol type like “udp” or “tcp”
uk: віддалений очікує тип протоколу «udp» або «tcp»

source: invalid verify-x509-name type
uk: неприпустимий тип verify-x509-name

source: unsupported blob/xml element
uk: непідтримуваний елемент blob/xml

source: unterminated blob element <%s>
uk: неперервний елемент blob <%s>

source: configuration error: %s (line %ld)
uk: помилка конфігурації: %s (рядок %ld)

source: unknown or unsupported option
uk: невідомий або непідтримуваний параметр

source: The file to import wasn’t a valid OpenVPN client configuration
uk: Файл для імпорту не містить припустиму конфігурацію клієнта OpenVPN

source: The file to import wasn’t a valid OpenVPN configure (no remote)
uk: Файл для імпорту не містить припустиму конфігурацію OpenVPN (відсутній віддалений)

source: missing path argument
uk: відсутній аргумент шляху

source: connection is not a valid OpenVPN connection
uk: з'єднання не є припустимим з'єднанням OpenVPN

source: connection was incomplete (missing gateway)
uk: з'єднання було неповним (відсутній шлюз)

source: failed to write file: %s
uk: не вдалося записати файл: %s

source: Compatible with the OpenVPN server.
uk: Сумісний з сервером OpenVPN.

source: Choose an OpenVPN static key…
uk: Виберіть статичний ключ OpenVPN...

source: None
uk: Немає

source: OpenVPN Static Keys (*.key)
uk: Статичні ключі OpenVPN (*.key)

source: Default
uk: Типово

source: Don’t verify certificate identification
uk: Не перевіряти ідентифікацію сертифіката

source: Verify whole subject exactly
uk: Ретельно перевіряти весь об'єкт

source: Verify name exactly
uk: Ретельно перевіряти назву

source: Verify name by prefix
uk: Перевіряти назву за префіксом

source: Verify subject partially (legacy mode, strongly discouraged)
uk: Перевіряти об'єкт частково (режим сумісності, настійливо не рекомендується)

source: Server
uk: Сервер

source: Client
uk: Клієнт

source: Not required
uk: Не потрібно

source: (automatic)
uk: (автоматичний)

source: Certificates (TLS)
uk: Сертифікати (TLS)

source: Password
uk: Пароль

source: Password with Certificates (TLS)
uk: Пароль з сертифікатами (TLS)

source: Static Key
uk: Статичний ключ

source: could not load UI widget
uk: неможливо завантажити віджет інтерфейсу

source: object class '%s' has no property named '%s'
uk: у класі об’єктів «%s» немає властивості із назвою «%s»

source: property '%s' of object class '%s' is not writable
uk: властивість «%s» класу об’єктів «%s» є недоступною для запису

source: construct property "%s" for object '%s' can't be set after construction
uk: властивість construct «%s» об’єкта «%s» не можна задавати після побудови

source: '%s::%s' is not a valid property name; '%s' is not a GObject subtype
uk: «%s::%s» не є коректною назвою властивості; «%s» не є підтипом GObject

source: unable to set property '%s' of type '%s' from value of type '%s'
uk: не вдалося задати значення властивості «%s» типу «%s» на основі значення типу «%s»

source: value "%s" of type '%s' is invalid or out of range for property '%s' of type '%s'
uk: значення «%s» типу «%s» є некоректним для властивості «%s» типу «%s» або не належить до припустимого діапазону значень

source: missing plugin file "%s"
uk: відсутній плагін файла «%s»

source: cannot load editor plugin: %s
uk: неможливо завантажити плагін редактора: %s

source: cannot load factory %s from plugin: %s
uk: неможливо завантажити фабрику %s із плагіна: %s

source: unknown error creating editor instance
uk: невідома помилка під час створення екземпляру редактора

source: invalid delimiter character '%c'
uk: неприпустимий символ розмежування «%c»

source: invalid non-utf-8 character
uk: неприпустимий символ не utf-8

source: empty host
uk: порожній вузол

source: invalid port
uk: неприпустимий порт

source: invalid protocol
uk: неприпустимий протокол

source: invalid address “%s”
uk: неприпустима адреса «%s»

source: invalid integer property “%s” or out of range [%d -> %d]
uk: неприпустима цілочисельна властивість «%s» або за межами діапазону [%d -> %d]

source: invalid boolean property “%s” (not yes or no)
uk: неприпустима логічна властивість «%s» (ані так, ані ні)

source: unhandled property “%s” type %s
uk: необроблена властивість «%s» типу %s

source: property “%s” invalid or not supported
uk: властивість «%s» неприпустима або не підтримується

source: No VPN configuration options.
uk: Немає параметрів налаштування VPN.

source: A username is required.
uk: Ім'я користувача є обов'язковим.

source: A password is required.
uk: Пароль є обов'язковим.

source: A username and password are required.
uk: Ім'я користувача та пароль є обов'язковими.

source: A private key password is required.
uk: Приватний ключ а є обов'язковим.

source: An HTTP Proxy username is required.
uk: Ім'я користувача HTTP Proxy є обов'язковим.

source: An HTTP Proxy password is required.
uk: Пароль HTTP Proxy є обов'язковим.

source: An HTTP Proxy username and password are required.
uk: Ім'я користувача HTTP Proxy та пароль є обов'язковими.

source: Could not process the request because the VPN connection settings were invalid.
uk: Не вдалося обробити запит, оскільки параметри з'єднання VPN були недійсними.

source: Invalid connection type.
uk: Неправильний тип з'єднання.

source: Could not find the openvpn binary.
uk: Не вдається знайти бінарну версію openvpn.

source: Invalid port number “%s”.
uk: Невірний номер порту «%s».

source: Invalid proto “%s”.
uk: Невірний протокол «%s».

source: Invalid proxy type “%s”.
uk: Невірний тип проксі «%s».

source: Invalid ping duration “%s”.
uk: Невірна тривалість опитування «%s».

source: Invalid ping-exit duration “%s”.
uk: неприпустима тривалість завершення перевірки зв'язку «%s»

source: Invalid ping-restart duration “%s”.
uk: неприпустима тривалість завершення перевірки зв'язку «%s»

source: Invalid connect timeout “%s”.
uk: Невірний таймаут з'єднання «%s».

source: Invalid max-routes argument “%s”.
uk: Неприпустимий аргумент max-routes «%s».

source: Invalid keysize “%s”.
uk: Неприпустимий розмір ключа «%s».

source: Invalid configuration with tls-remote and verify-x509-name.
uk: Неприпустима конфігурація з tls-remote та verify-x509-name.

source: Invalid verify-x509-name.
uk: Неприпустиме verify-x509-name.

source: Invalid reneg seconds “%s”.
uk: Неприпустимі секунди для параметра reneg «%s».

source: Invalid TUN MTU size “%s”.
uk: Неприпустимий розмір TUN MTU «%s».

source: Invalid fragment size “%s”.
uk: Неприпустимий розмір фрагменту «%s».

source: Unknown connection type “%s”.
uk: Невідомий тип з'єднання «%s».

source: User “%s” not found, check NM_OPENVPN_USER.
uk: Користувач «%s» не знайдено, перевірте NM_OPENVPN_USER.

source: Group “%s” not found, check NM_OPENVPN_GROUP.
uk: Групу «%s» не знайдено, перевірте NM_OPENVPN_GROUP.

source: Unhandled pending authentication.
uk: Необроблена автентифікація в очікуванні.

source: Don’t quit when VPN connection terminates
uk: Не завершувати роботу при вимиканні з'єднання VPN

source: Enable verbose debug logging (may expose passwords)
uk: Увімкнути докладне протоколювання для зневадження (можливе розкриття паролю)

source: D-Bus name to use for this instance
uk: Найменування D-Bus, використовуване цією виконуваною копією

source: nm-openvpn-service provides integrated OpenVPN capability to NetworkManager.
uk: nm-openvpn-service дозволяє використовувати OpenVPN в NetworkManager.

source: TLS-Auth
uk: TLS-Автентифікація

source: TLS-Crypt
uk: TLS-Шифрування

source: Maybe
uk: Можливо

source: Yes
uk: Так

source: General
uk: Загальне

source: _Gateway:
uk: _Шлюз:

source: Remote gateway(s), with optional port and protocol (e.g. ovpn.corp.com:1234:tcp). You can specify multiple hosts for redundancy (use commas or spaces as delimiters). config: remote
uk: Віддалені шлюзи, з необов'язковим портом та протоколом (наприклад, ovpn.corp.com:1234:tcp). Ви можете вказати кілька хостів для резервування (використовуйте коми або пробіли як розділювачі). конфігурація: remote

source: Authentication
uk: Автентифікація

source: User
uk: Користувач

source: User name:
uk: Користувач:

source: Password passed to OpenVPN when prompted for it. config: auth-user-pass
uk: Пароль, що буде переданий до OpenVPN, коли з'явиться запит на це. конфігурація: auth-user-pass

source: Username passed to OpenVPN when prompted for it. If omitted, use the name of the system user that activates the connection. config: auth-user-pass
uk: Ім'я користувача, що передається OpenVPN, коли з'явиться запит на це. Якщо опущено, використовуйте ім'я системного користувача, який активує з'єднання. конфігурація: auth-user-pass

source: Remote IP Address:
uk: Віддалена адреса IP:

source: Local IP Address:
uk: Локальна адреса IP:

source: Key Direction:
uk: Напрямок ключа:

source: Static Key:
uk: Статичний ключ:

source: Pre-shared file for Static Key encryption mode (non-TLS). config: static <file>
uk: Спільний файл для режиму шифрування статичного ключа (не TLS). конфігурація: static <файл>

source: IP address of the remote VPN endpoint. config: ifconfig <l> <rn>
uk: IP-адреса віддаленої кінцевої точки VPN. конфігурація: ifconfig <l> <rn>

source: IP address of the local VPN endpoint. config: ifconfig <l> <rn>
uk: IP-адреса локальної кінцевої точки VPN. конфігурація: ifconfig <l> <rn>

source: Direction for Static Key encryption mode (non-TLS). If key direction is used, it must be the opposite of that used on the VPN peer. For example, if the peer uses “1”, this connection must use “0”. If you are unsure what value to use, contact your system administrator. config: static <file> [direction]
uk: Напрямок для режиму шифрування статичного ключа (не TLS). Якщо використовується няпрямок ключа, він має бути протилежним тому, що використовується у VPN точці. Наприклад, якщо точка використовує "1", це з'єднання має використовувати "0". Якщо ви не впевнені щодо значення, зв'яжіться зі своїм системним адміністратором. конфігурація: static <файл> [напрямок]

source: Type:
uk: Тип:

source: Select an authentication mode.
uk: Оберіть режим автентифікації

source: Ad_vanced…
uk: _Додатково…

source: OpenVPN Advanced Options
uk: Додаткові параметри OpenVPN

source: Use custom gateway p_ort:
uk: Використовувати інший _порт шлюзу:

source: TCP/UDP port number for peer. (Default value when there is no port for gateway). config: port
uk: Номер порта TCP/UDP для точки. (Типове значення, колі відсутнй порт шлюза). config: порт

source: Use custom _renegotiation interval:
uk: Використовувати власний інтервал _повторних узгоджень:

source: Renegotiate data channel key after the specified number of seconds. config: reneg-sec
uk: Повторне узгодження ключа каналу даних після зазначеної кількості секунд. конфігурація: reneg-sec

source: Use L_ZO data compression
uk: Використовувати стиснення L_ZO

source: Use fast LZO compression. config: comp-lzo
uk: Використовуйте швидке стиснення LZO. конфігурація: comp-lzo

source: Select the LZO data compression mode. config: comp-lzo
uk: Виберіть режим стиснення даних LZO. конфігурація: comp-lzo

source: Use a _TCP connection
uk: Використовувати з'єднання _TCP

source: Use TCP for communicating with remote host. (This is a default setting only used when no protocol is specified for the gateway.) config: proto tcp-client | udp
uk: Використовуйте TCP для з'єднання з віддаленим хостом. (Це типове налаштування використовується лише тоді, коли для шлюзу не зазначено протоколу.) конфігурація: proto tcp-client | udp

source: Set virtual _device type:
uk: Встановіть тип віртуального _пристрою:

source: Explicitly set virtual device type and name (TUN/TAP).
uk: Явно задати тип віртуального пристрою та назву (TUN/TAP).

source: Explicitly set virtual device type (TUN/TAP). config: dev-type tun | tap
uk: Явно задати тип віртуального пристрою (TUN/TAP). конфіг: dev-type tun | tap

source: and _name:
uk: та _назву:

source: Use custom name for TUN/TAP virtual device (instead of default “tun” or “tap”). config: dev <name>
uk: Використовувати власну назу для віртуального пристрою TUN/TAP (замість типової «tun» абр «tap»). конфіг: dev <назва>

source: Use custom tunnel Maximum Transmission _Unit (MTU):
uk: Використовувати нестандартний максимальний _розмір елементу передачі (MTU):

source: Take the TUN device MTU to be the specified value and derive the link MTU from it. config: tun-mtu
uk: Прийняти MTU-пристрій TUN із вказатим значенням та отримати від нього MTU-зв'язок. конфігурація: tun-mtu

source: Use custom UDP _fragment size:
uk: Використовувати нестандартний розмір _фрагменту UDP:

source: Enable internal datagram fragmentation with this maximum size. config: fragment
uk: Увімкнути фрагментацію внутрішньої дейтаграми з таким максимальним розміром. конфіг: fragment

source: Restrict tunnel TCP Maximum _Segment Size (MSS)
uk: Обмежувати максимальний розмір сегменту TCP (MSS) тунелю

source: Restrict tunnel TCP MSS. config: mssfix
uk: Обмежити тунель TCP MSS. конфігурація: mssfix

source: Rando_mize remote hosts
uk: Ви_падкові віддалені вузли

source: Randomize the order of gateways list (remote) as a kind of basic load-balancing measure. config: remote-random
uk: Рандомізувати порядок списку шлюзів (віддаленого) на основі балансування навантаження. конфігурація: remote-random

source: IPv6 tun link
uk: IPv6 тунель

source: Build a tun link capable of forwarding IPv6 traffic config: tun-ipv6
uk: Створення туннеля, здатного пересилати трафік IPv6 конфігурація: tun-ipv6

source: Specify _exit or restart ping:
uk: Вкажіть _виходити з перевірки зв'язку чи перезапускати:

source: Exit or restart after n seconds pass without reception of a ping or other packet from remote. config: ping-exit | ping-restart <n>
uk: Виходити чи перезапускати через n секунд часу від передачі без відповіді перевірки зв'язку чи іншого пакету з віддаленого сервера. конфігурація: ping-exit | ping-restart <n>

source: Specify pin_g interval:
uk: Вкажіть інтервал о_питування:

source: Ping remote over the TCP/UDP control channel if no packets have been sent for at least n seconds. config: ping <n>
uk: Опитувати віддалений сервер через канал керування TCP/UDP, якщо пакетів не було відправлено принаймні n секунд. config: ping <n> ПАРАМЕТРИ

source: Accept authenticated packets from any address (F_loat)
uk: Приймати автентифіковані пакети з будь-якої адреси (F_loat)

source: Allow remote peer to change its IP address and/or port number, such as due to DHCP (this is the default if --remote is not used). --float when specified with --remote allows an OpenVPN session to initially connect to a peer at a known address, however if packets arrive from a new address and pass all authentication tests, the new address will take control of the session. This is useful when you are connecting to a peer which holds a dynamic address such as a dial-in user or DHCP client. Essentially, --float tells OpenVPN to accept authenticated packets from any address, not only the address which was specified in the --remote option. config: float
uk: Дозволити віддаленій точці змінювати свою IP-адресу та/або номер порту, наприклад, через DHCP (це за замовчуванням, якщо --remote не використовується). --float, коли вказано з --remote дозволяє сеансу OpenVPN спочатку підключитися до однорангової точки за відомій адресою, однак, якщо пакети надходять з нової адреси і проходять всі перевірки автентифікації, нова адреса візьме контроль над сеансом. Це стає в нагод, коли ви підключаєтесь до однорангової мережі, яка містить динамічну адресу, наприклад користувач з вхідним телефонним модемним з'єднанням, або клієнт DHCP. По суті, --float повідомляє OpenVPN, що слід приймати автентифіковані пакети з будь-якої адреси, а не тільки з адреси, зазначеної в опції --remote. конфігурація: float

source: Specify max routes:
uk: Вкажіть максимум маршрутів:

source: Specify the maximum number of routes the server is allowed to specify. config: max-routes <n>
uk: Вкажіть максимальну кількість маршрутів, які може вказати сервер. config: max-routes <n>

source: Encrypt packets with cipher algorithm. The default is BF-CBC (Blowfish in Cipher Block Chaining mode). config: cipher
uk: Шифрувати пакети з алгоритмом шифрування. Типовим значенням є BF-CBC (Blowfish в режимі блокування каналів шифрування). config: cipher

source: Use custom _size of cipher key:
uk: Використовувати власний _розмір ключа шифру:

source: Set cipher key size to a custom value. If unspecified, it defaults to cipher-specific size. config: keysize <n>
uk: Встановити розмір ключа шифру до власного значення. Якщо не вказано, за замовчуванням розмір, визначений у шифрі. конфігурація: keyize <n>

source: Authenticate packets with HMAC using message digest algorithm. The default is SHA1. config: auth
uk: Автентифікувати пакетів за допомогою HMAC з використанням алгоритму обробки повідомлень. Типовим значенням є SHA1. config: auth

source: Ci_pher:
uk: Шифр:

source: _HMAC Authentication:
uk: Аутентифікація HMAC:

source: Verify CRL from file
uk: Перевірити CRL з файлу

source: Verify CRL from directory
uk: Перевіряти CRL з каталогу

source: Choose CRL file
uk: Оберіть файл CRL

source: Choose CRL directory
uk: Оберіть каталог CRL

source: Security
uk: Безпека

source: _Subject Match:
uk: Об'єкт збігу:

source: Subject or Common Name to verify server certificate information against. config: verify-x509-name subject-or-name [mode] config (legacy mode): tls-remote subject-or-name
uk: Об'єкт або загальне ім'я для перевірки інформації про сертифікат сервера. конфігурація: verify-x509-name subject-or-name [режим] конфігурація (застарілий режим): tls-remote subject-or-name

source: Server _Certificate Check:
uk: Перевірка _сертифіката сервера:

source: Verify server certificate identification. When enabled, connection will only succeed if the server certificate matches some expected properties. Matching can either apply to the whole certificate subject (all the fields), or just the Common Name (CN field). The legacy option tls-remote is deprecated and removed from OpenVPN 2.4 and newer. Do not use it anymore. config: verify-x509-name subject-or-name [mode] config (legacy mode): tls-remote subject-or-name
uk: Перевірка ідентифікацію сертифіката сервера. Після ввімкнення зв'язок буде успішним тільки тоді, коли сертифікат сервера відповідатиме деяким очікуваним властивостям. Можливий збіг з усім об'єктом сертифіката (всі поля), або лише загальне ім'я (поле CN). Спадковий параметр tls-remote застарів та видалений починаючи з OpenVPN 2.4. Не використовуйте його більше. конфігурація: verify-x509-name subject-or-name [режим] конфігурація (застарілий режим): tls-remote subject-or-name

source: _Verify peer (server) certificate usage signature
uk: _Перевірити підпис використання сертифіката точки (сервера)

source: Require that peer certificate was signed with an explicit key usage and extended key usage based on RFC3280 TLS rules.
uk: Вимагати, щоб сертифікат точки був підписаний з використанням явного ключа та розширеного використання ключів на основі правил RFC3280 TLS.

source: _Remote peer certificate TLS type:
uk: Тип TLS сертифіката _віддаленої точки:

source: Require that peer certificate was signed with an explicit key usage and extended key usage based on RFC3280 TLS rules. config: remote-cert-tls client|server
uk: Вимагати, щоб сертифікат точки був підписаний з використанням явного ключа та розширеного використання ключів на основі правил RFC3280 TLS. конфігурація: remote-cert-tls client|server

source: _Verify peer (server) certificate nsCertType designation
uk: _Перевіряти призначення сертифіката nsCertType для точки (сервера)

source: Require that peer certificate was signed with an explicit nsCertType designation.
uk: Вимагати, щоб сертифікат точки був підписаний з явним призначенням nsCertType.

source: _Remote peer certificate nsCert designation:
uk: Позначення _віддаленої точки сертифікатом nsCert
