Repository: PlagaMedicum/Ubuntu-Translation-Demo
Catalog: rosetta-eoan/*/LC_MESSAGES/NetworkManager-openvpn.po
Languages: uk

source: Require that peer certificate was signed with an explicit nsCertType designation. config: ns-cert-type client|server
uk: Вимагати, щоб сертифікат точки був підписаний з явним призначенням nsCertType. config: ns-cert-type client|server

source: Key _Direction:
uk: Напрямок ключа:

source: Add an additional layer of HMAC authentication on top of the TLS control channel to protect against DoS attacks. In case of TLS-Crypt mode, the control channel is also encrypted. config: tls-auth <file> [direction] | tls-crypt <file>
uk: Додати додатковий шар аітентифікації HMAC у верхній частині каналу керування TLS для захисту від атак DoS. У випадку режиму TLS-Crypt канал керування також зашифровано. конфігурація: tls-auth <file> [direction] | tls-crypt <file>

source: Direction parameter for static key mode. If key direction is used, it must be the opposite of that used on the VPN peer. For example, if the peer uses “1”, this connection must use “0”. If you are unsure what value to use, contact your system administrator. config: tls-auth <file> [direction]
uk: Параметр напрямку для режиму статичного ключа. Якщо використовується няпрямок ключа, він має бути протилежним тому, що використовується у VPN точці. Наприклад, якщо точка використовує "1", це з'єднання має використовувати "0". Якщо ви не впевнені щодо значення, зв'яжіться зі своїм системним адміністратором. конфігурація: tls-auth <файл> [напрямок]

source: Key _File:
uk: Файл ключа:

source: Mode:
uk: Режим:

source: Add an additional layer of encryption or HMAC authentication.
uk: Додати додатковий рівень шифрування або автентифікацію HMAC.

source: Extra Certificates:
uk: Додаткові сертифікати:

source: Specify a file containing one or more PEM certs (concatenated together) that complete the local certificate chain. config: extra-certs <file>
uk: Вкажіть файл, що містить один або декілька сертифікатів PEM (об'єднані разом), які завершують локальну ланцюжок сертифікатів. конфігурація: extra-certs <файл>

source: Additional TLS authentication or encryption
uk: Додаткова автентифікація або шифрування TLS

source: TLS Authentication
uk: Автентифікація TLS

source: Proxy type: HTTP or Socks. config: http-proxy or socks-proxy
uk: Тип проксі: HTTP або Socks. конфігурація: http-proxy або socks-proxy

source: Proxy _Type:
uk: Тип проксі-сервера:

source: <i>Select this option if your organization requires the use of a proxy server to access the Internet.</i>
uk: <i>Виберіть цей параметр, якщо для доступу до інтернет у вашій організації використовується проксі-сервер.</i>

source: Server _Address:
uk: Адреса сервера:

source: Connect to remote host through a proxy with this address. config: http-proxy or socks-proxy
uk: З'єднатися з віддаленим вузлом через проксі з цією адресою. конфігурація: http-proxy або socks-proxy

source: _Port:
uk: Порт:

source: Connect to remote host through a proxy with this port. config: http-proxy or socks-proxy
uk: З'єднатися з віддаленим вузлом через проксі з цим портом. конфігурація: http-proxy або socks-proxy

source: _Retry indefinitely when errors occur
uk: _Повторювати на невизначений час при виникненні помилок

source: Retry indefinitely on proxy errors. It simulates a SIGUSR1 reset. config: http-proxy-retry or socks-proxy-retry
uk: Повторювати на невизначений час при виникненні помилок проксі. Він імітує скидання SIGUSR1. конфігурація: http-proxy-retry або socks-proxy-retry

source: Proxy _Username:
uk: _Користувач проксі:

source: Proxy Passwor_d:
uk: Пароль проксі-сервера:

source: HTTP/Socks proxy username passed to OpenVPN when prompted for it.
uk: Користувач проксі HTTP/Socks переданий до OpenVPN, коли з'являється запит на це.

source: HTTP/Socks proxy password passed to OpenVPN when prompted for it.
uk: Пароль проксі HTTP/Socks переданий до OpenVPN, коли з'являється запит на це.

source: _Show password
uk: Показати пароль

source: Proxies
uk: Проксі-сервери

source: Connect timeout
uk: Час очікування з'єднання

source: The timeout in seconds before trying the next server. This timeout includes proxy and TCP connect timeouts. config: connect-timeout <n> | server-poll-timeout <n>
uk: Час очікування в секундах перед спробою з наступним сервером. Цей час очікування містить в себе очікування з'єднання з проксі-сервером та TCP. конфігурація: connect-timeout <n> | server-poll-timeout <n>

source: Misc
uk: Інше
