Repository: PlagaMedicum/Ubuntu-Translation-Demo
Catalog: rosetta-eoan/*/LC_MESSAGES/notification-daemon.po
Languages: be

source: Notification Daemon
be: Дэман паведамленьняў

source: Display notifications
be: Праглядзець паведамленьні

source: Closes the notification.
be: Зачыніць паведамленьні.

source: Notification summary text.
be: Тэкставая паведамленьня

source: Invalid notification identifier
be: Хібны ідэнтыфікатар апавяшчэння

source: Exceeded maximum number of notifications
be: Дасягнута максімальная колькасць апавяшчэнняў

source: Enable debugging code
be: Задзейнічаць адладачны код

source: Replace a currently running application
be: Зьмяніць бягучы дадатак

source: Clear all notifications
be: Ачысціць усе апавяшчэнні

source: Notifications
be: Паведамленьні
