Repository: PlagaMedicum/Ubuntu-Translation-Demo
Catalog: rosetta-eoan/*/LC_MESSAGES/screen-resolution-extra.po
Languages: be

source: Monitor Resolution Settings has detected that the virtual resolution must be set in your configuration file in order to apply your settings. Would you like Screen Resolution to set the virtual resolution for you? (Recommended)
be: Праграма кіравання разрозненнем экрана знайшла, што для ўжывання вашых настáўленняў трэба задаць віртуальнае разрозненне ў канфігурацыйным файле. Хочаце, каб праграма кіравання разрозненнем экрана усталявала віртуальнае разрозненне для вас? (Рэкамендавана)

source: Could not connect to Monitor Resolution Settings DBUS service.
be: Не выходзіць злучыцца з DBUS-службай кіравання разрозненнем экрана.

source: Please log out and log back in again. You will then be able to use Monitor Resolution Settings to setup your monitors
be: Завяршыце дзейны сеанс і аўтарызуйцеся нанава. Пасля гэтага праграма кіравання разрозненнем зможа наставіць вашы экраны.

source: Monitor Resolution Settings can't apply your settings.
be: Немагчыма ўжыць вашыя настáўленні.

source: Monitor Resolution Settings
be: Настáўленні разрознення манітора

source: Change Screen Resolution Configuration
be: Змяніць канфігурацыю разрознення экрана

source: Changing the Screen Resolution configuration requires privileges.
be: Змена настáўленняў разрознення патрабуе прывілеяў.

source: Change the effect of Ctrl+Alt+Backspace
be: Змяніць рэакцыю на націск Ctrl+Alt+Backspace

source: Changing the effect of Ctrl+Alt+Backspace requires privileges.
be: Змена рэакцыі на націск Ctrl+Alt+Backspace патрабуе прывілеяў.

source: Enable or disable the NVIDIA GPU with PRIME
be: Уключыць або выключыць NVIDIA GPU з PRIME

source: Enabling or disabling the NVIDIA GPU requires privileges.
be: Уключэнне/адключэнне NVIDIA GPU патрабуе прывілеяў.
