Repository: PlagaMedicum/Ubuntu-Translation-Demo
Catalog: rosetta-eoan/*/LC_MESSAGES/shadow.po
Languages: uk

source: Multiple entries named '%s' in %s. Please fix this with pwck or grpck.
uk: Існує одразу декілька записів з іменем «%s» у %s. Виправте це за допомогою pwck або grpck.

source: crypt method not supported by libcrypt? (%s)
uk: метод шифрування не підтримується libcrypt? (%s)

source: configuration error - cannot parse %s value: '%s'
uk: помилка налаштування: не вдалося розібрати значення %s: «%s»

source: Could not allocate space for config info.
uk: Не можу виділити ресурси для конфігураційних даних.

source: configuration error - unknown item '%s' (notify administrator)
uk: помилка у конфігурації - невідома позиція '%s' (повідомте адміністратора)

source: %s: nscd did not terminate normally (signal %d)
uk: %s: nscd завершився з помилкою (по сигналу %d)

source: %s: nscd exited with status %d
uk: %s: Виконання nscd закінчилося зі статусом %d

source: Password:
uk: Пароль:

source: %s's Password:
uk: Пароль користувача %s:

source: Cannot create SELinux management handle
uk: Неможливо створити керуючий описувач SELinux

source: SELinux policy not managed
uk: Політика SELinux не керована

source: Cannot read SELinux policy store
uk: Неможливо прочитати сховище політики SELinux

source: Cannot establish SELinux management connection
uk: Неможливо встановити керуюче під’єднання SELinux

source: Cannot begin SELinux transaction
uk: Неможливо почати транзакцію SELinux

source: Could not query seuser for %s
uk: Не вдалося запитати seuser для %s

source: Could not set serange for %s
uk: Не вдалося призначити serange для %s

source: Could not set sename for %s
uk: Не вдалося призначити sename для %s

source: Could not modify login mapping for %s
uk: Не вдалося змінити зіставлення входу для %s

source: Cannot create SELinux login mapping for %s
uk: Неможливо створити зіставлення входу SELinux для %s

source: Could not set name for %s
uk: Неможливо вказати ім’я для %s

source: Could not set SELinux user for %s
uk: Неможливо вказати користувача SELinux для %s

source: Could not add login mapping for %s
uk: Неможливо додати зіставлення входу для %s

source: Cannot init SELinux management
uk: Неможливо ініціалізувати керування SELinux

source: Cannot create SELinux user key
uk: Неможливо створити ключ користувача SELinux

source: Cannot verify the SELinux user
uk: Неможливо перевірити користувача SELinux

source: Cannot modify SELinux user mapping
uk: Неможливо змінити користувацьке зіставлення SELinux

source: Cannot add SELinux user mapping
uk: Неможливо додати користувацьке зіставлення SELinux

source: Cannot commit SELinux transaction
uk: Неможливо зафіксувати транзакцію SELinux

source: Login mapping for %s is not defined, OK if default mapping was used
uk: Зіставлення входу для %s не визначено; нормально, якщо використовувалося типове зіставлення

source: Login mapping for %s is defined in policy, cannot be deleted
uk: Зіставлення входу для %s визначено у політиці й не може бути вилучено

source: Could not delete login mapping for %s
uk: Неможливо вилучити зіставлення входу для %s

source: %s: out of memory
uk: %s: брак пам'яті

source: %s: Cannot stat %s: %s
uk: %s: не вдалося виконати функцію stat для %s: %s

source: %s: %s is neither a directory, nor a symlink.
uk: %s: %s не є каталогом або символьним посиланням

source: %s: Cannot read symbolic link %s: %s
uk: %s: не вдалося прочитати символьне посилання %s: %s

source: %s: Suspiciously long symlink: %s
uk: %s: ймовірно, задовге символьне посилання: %s

source: %s: Cannot create directory %s: %s
uk: %s: не вдалося створити каталог %s: %s

source: %s: Cannot change owner of %s: %s
uk: %s: не вдалося змінити власника %s: %s

source: %s: Cannot change mode of %s: %s
uk: %s: не вдалося змінити права доступу %s: %s

source: %s: Cannot remove directory %s: %s
uk: %s: не вдалося вилучити каталог %s: %s

source: %s: Cannot rename %s to %s: %s
uk: %s: не вдалося перейменувати каталог %s у %s: %s

source: %s: Cannot remove %s: %s
uk: %s: не вдалося вилучити %s: %s

source: %s: Cannot create symbolic link %s: %s
uk: %s: не вдалося створити символьне посилання %s: %s

source: %s: Cannot change owners of %s: %s
uk: %s: не вдалося змінити власників %s: %s

source: %s: Cannot lstat %s: %s
uk: %s: не вдалося виконати функцію lstat для %s: %s

source: %s: Warning, user %s has no tcb shadow file.
uk: %s: попередження: у користувача %s відсутній файл shadow у структурі tcb.

source: %s: Emergency: %s's tcb shadow is not a regular file with st_nlink=1. The account is left locked.
uk: %s: надзвичайна ситуація: файл shadow у %s у структурі tcb не є звичайним файлом з st_nlink=1. Обліковий запис залишається заблокованим.

source: %s: Cannot open %s: %s
uk: %s: не вдалося відкрити %s: %s

source: Warning: unknown group %s
uk: Застереження: невідома група %s

source: Warning: too many groups
uk: Застереження: забагато груп

source: Your password has expired.
uk: Термін дії вашого паролю вичерпано.

source: Your password is inactive.
uk: Ваш пароль є неактивним.

source: Your login has expired.
uk: Ваш логін потерміновано.

source: Contact the system administrator.
uk: Зв'яжіться з системним адміністратором.

source: Choose a new password.
uk: Оберіть новий пароль.

source: You must change your password.
uk: Ви повинні змінити свій пароль.

source: Your password will expire in %ld days.
uk: Ваш пароль буде протермінований за %ld днів.

source: Your password will expire tomorrow.
uk: Ваш пароль буде протермінований завтра.

source: Your password will expire today.
uk: Ваш пароль буде протермінований сьогодні.

source: Cannot open audit interface - aborting.
uk: Не вдалося відкрити інтерфейс протоколювання (audit) — припинення роботи.

source: Unable to change owner or mode of tty stdin: %s
uk: Не вдалося змінити власника або права на tty stdin: %s

source: %s: failed to unlock %s
uk: %s: не вдалося розблокувати %s

source: Environment overflow
uk: Переповнення оточення

source: You may not change $%s
uk: Ви не можете змінити $%s

source: %d failure since last login. Last was %s on %s.
uk: %d помилка з часу останнього входу. Останній вхід: %s з %s.

source: %s: Invalid configuration: GID_MIN (%lu), GID_MAX (%lu)
uk: %s: невірне налаштування: GID_MIN (%lu), GID_MAX (%lu)

source: %s: Invalid configuration: SYS_GID_MIN (%lu), GID_MIN (%lu), SYS_GID_MAX (%lu)
uk: %s: невірне налаштування: SYS_GID_MIN (%lu), GID_MIN (%lu), SYS_GID_MAX (%lu)

source: %s: failed to allocate memory: %s
uk: %s: не вдалося виділити пам’ять: %s

source: %s: Can't get unique system GID (no more available GIDs)
uk: %s: не вдалося отримати унікальний системний GID (закінчилися вільні GID-и)

source: %s: Can't get unique GID (no more available GIDs)
uk: %s: не вдалося отримати унікальний GID (закінчилися вільні GID-и)

source: %s: Invalid configuration: UID_MIN (%lu), UID_MAX (%lu)
uk: %s: невірне налаштування: UID_MIN (%lu), UID_MAX (%lu)

source: %s: Invalid configuration: SYS_UID_MIN (%lu), UID_MIN (%lu), SYS_UID_MAX (%lu)
uk: %s: невірне налаштування: SYS_UID_MIN (%lu), UID_MIN (%lu), SYS_UID_MAX (%lu)

source: %s: Can't get unique system UID (no more available UIDs)
uk: %s: не вдалося отримати унікальний системний UID (закінчилися вільні UID-и)

source: %s: Can't get unique UID (no more available UIDs)
uk: %s: не вдалося отримати унікальний UID (закінчилися вільні UID-и)

source: Too many logins.
uk: Забагато входів.

source: You have new mail.
uk: Ви маєте нову пошту.

source: No mail.
uk: Немає пошти.

source: You have mail.
uk: Ви маєте пошту.

source: no change
uk: без змін

source: a palindrome
uk: паліндром

source: case changes only
uk: тільки зміни в регістрі

source: too similar
uk: занадто подібні

source: too simple
uk: занадто простий

source: rotated
uk: переставлені літери

source: too short
uk: закороткий

source: Bad password: %s.
uk: Поганий пароль: %s.

source: passwd: pam_start() failed, error %d
uk: passwd: pam_start() не виконано, помилка %d

source: passwd: password unchanged
uk: passwd: пароль не змінено

source: passwd: password updated successfully
uk: passwd: пароль було успішно змінено

source: Incorrect password for %s.
uk: Невірний пароль для %s.

source: %s: multiple --root options
uk: %s: декілька параметрів --root

source: %s: option '%s' requires an argument
uk: %s: до параметра «%s» слід додати аргумент

source: %s: failed to drop privileges (%s)
uk: %s: не вдалося скинути привілеї (%s)

source: %s: invalid chroot path '%s'
uk: %s: некоректне значення шляху chroot «%s»

source: %s: cannot access chroot directory %s: %s
uk: %s: немає доступу до каталогу chroot %s: %s

source: %s: cannot chdir to chroot directory %s: %s
uk: %s: неможливо виконати chdir до каталогу chroot %s: %s

source: %s: unable to chroot to directory %s: %s
uk: %s: не вдалося виконати chroot у каталог %s: %s

source: Invalid ENCRYPT_METHOD value: '%s'. Defaulting to DES.
uk: Неправильне значення для ENCRYPT_METHOD: «%s». Використовується типове значення DES.

source: Unable to cd to '%s'
uk: Неможливо перейти до теки «%s»

source: No directory, logging in with HOME=/
uk: Немає теки, входимо з HOME=/

source: Cannot execute %s
uk: Неможливо виконати виконати %s

source: Invalid root directory '%s'
uk: Невірна коренева тека «%s»

source: Can't change root directory to '%s'
uk: Неможливо змінити кореневу теку на «%s»

source: Unable to determine your tty name.
uk: Неможливо визначити назву вашого термінала.

source: No
uk: Немає

source: Usage: %s [options] LOGIN Options:
uk: Використання: %s [параметри] КОРИСТУВАЧ Параметри:

source: -d, --lastday LAST_DAY set date of last password change to LAST_DAY
uk: -d, --lastday ОСТ_ДЕНЬ встановити останній день зміни паролю у ОСТ_ДЕНЬ

source: -E, --expiredate EXPIRE_DATE set account expiration date to EXPIRE_DATE
uk: -E, --expiredate ДАТА_ВСТ встановити дату закінчення дії облікового запису у ДАТА_ВСТ

source: -h, --help display this help message and exit
uk: -h, --help показати дане повідомлення й закінчити роботу

source: -I, --inactive INACTIVE set password inactive after expiration to INACTIVE
uk: -I, --inactive НЕАКТИВНІСТЬ встановити неактивність паролю після старіння у значення НЕАКТИВНІСТЬ

source: -l, --list show account aging information
uk: -l, --list показати «вік» облікового запису

source: -m, --mindays MIN_DAYS set minimum number of days before password change to MIN_DAYS
uk: -m, --mindays МІН_ДНІВ встановити мінімальне число днів перед зміною паролю у МІН_ДНІВ

source: -M, --maxdays MAX_DAYS set maximim number of days before password change to MAX_DAYS
uk: -M, --maxdays МАКС_ДНІВ встановити максимальне число днів перед зміною паролю у МАКС_ДНІВ

source: -R, --root CHROOT_DIR directory to chroot into
uk: -R, --root КАТ_CHROOT каталог, у який виконується chroot

source: -W, --warndays WARN_DAYS set expiration warning days to WARN_DAYS
uk: -W, --warndays ПОПЕР_ДНІВ встановити кількість днів з видачею попередження у ПОПЕР_ДНІВ

source: Enter the new value, or press ENTER for the default
uk: Введіть нове значення або натисніть ENTER для значення за замовчанням

source: Minimum Password Age
uk: Мінімальний вік пароля

source: Maximum Password Age
uk: Максимальний вік пароля

source: Last Password Change (YYYY-MM-DD)
uk: Остання зміна пароля (РРРР-ММ-ДД)

source: Password Expiration Warning
uk: Застереження про протермінування пароля

source: Password Inactive
uk: Пароль неактивний

source: Account Expiration Date (YYYY-MM-DD)
uk: Дата протермінування облікового запсу (РРРР-ММ-ДД)

source: Last password change :
uk: Остання зміна пароля :

source: never
uk: ніколи

source: password must be changed
uk: пароль має бути змінений

source: Password expires :
uk: Пароль стає проотермінованим :

source: Password inactive :
uk: Пароль неактивний :

source: Account expires :
uk: Обліковий запис стає протермінованим :

source: Minimum number of days between password change : %ld
uk: Мінімальна кількість днів між змінами паролю : %ld

source: Maximum number of days between password change : %ld
uk: Максимальна кількість днів між змінами паролю : %ld

source: Number of days of warning before password expires : %ld
uk: Кількість днів для застереження про протермінування паролю : %ld

source: %s: invalid date '%s'
uk: %s: невірна дата "%s"

source: %s: invalid numeric argument '%s'
uk: %s: невірний числовий аргумент "%s"

source: %s: do not include "l" with other flags
uk: %s: не використовуйте "l" з іншими прапорцями

source: %s: Permission denied.
uk: %s: У доступі відмовлено.

source: %s: Cannot determine your user name.
uk: %s: Не можу визначити Ваше ім'я користувача.

source: %s: cannot lock %s; try again later.
uk: %s: не вдалося заблокувати %s; спробуйте ще раз пізніше.

source: %s: cannot open %s
uk: %s: не вдається відкрити %s

source: %s: failure while writing changes to %s
uk: %s: помилка при запису змін у %s

source: %s: failed to prepare the new %s entry '%s'
uk: %s: не вдалося підготувати новий %s запис «%s»

source: %s: the shadow password file is not present
uk: %s: не можу відкрити файл прихованих паролів

source: %s: user '%s' does not exist in %s
uk: %s: користувач «%s» не існує у %s

source: Changing the aging information for %s
uk: Змінюю вікову інформацію для %s

source: %s: error changing fields
uk: %s: помилка зміни полів

source: Usage: %s [options] [LOGIN] Options:
uk: Використання: %s [параметри] [КОРИСТУВАЧ] Параметри:

source: -f, --full-name FULL_NAME change user's full name
uk: -f, --full-name ПОВН_ІМ’Я зміна повного імені користувача

source: -h, --home-phone HOME_PHONE change user's home phone number
uk: -h, --home-phone ДІМ_ТЕЛЕФОН зміна домашнього тел. користувача

source: -o, --other OTHER_INFO change user's other GECOS information
uk: -o, --other ІНША_ІНФ зміна іншої інф. GECOS про користувача

source: -r, --room ROOM_NUMBER change user's room number
uk: -r, --room НОМЕР_КІМНАТИ зміна номеру кімнати користувача

source: -u, --help display this help message and exit
uk: -u, --help показати дане повідомлення та закінчити роботу

source: -w, --work-phone WORK_PHONE change user's office phone number
uk: -w, --work-phone РОБОЧИЙ_ТЕЛ зміна офісного номеру тел. користувача

source: Full Name
uk: Повне ім'я

source: Room Number
uk: Номер кімнати

source: Work Phone
uk: Робочий телефон

source: Home Phone
uk: Домашній телефон

source: Other
uk: Інше

source: Cannot change ID to root.
uk: Не можу змінити ID на root.

source: %s: name with non-ASCII characters: '%s'
uk: %s: ім’я «%s» містить не ASCII-символи

source: %s: invalid name: '%s'
uk: %s: невірне ім'я: "%s"

source: %s: room number with non-ASCII characters: '%s'
uk: %s: номер кімнати «%s» містить не ASCII-символи

source: %s: invalid room number: '%s'
uk: %s: невірний номер кімнати: "%s"

source: %s: invalid work phone: '%s'
uk: %s: невірний робочий телефон: "%s"

source: %s: invalid home phone: '%s'
uk: %s: невірний домашній телефон: «%s»

source: %s: '%s' contains non-ASCII characters
uk: %s: у «%s» містяться не ASCII-символи

source: %s: '%s' contains illegal characters
uk: %s: «%s» містить заборонені символи

source: %s: user '%s' does not exist
uk: %s: користувач «%s» не існує

source: %s: cannot change user '%s' on NIS client.
uk: %s: неможливо змінити користувача «%s» у клієнті NIS.

source: %s: '%s' is the NIS master for this client.
uk: %s: «%s» є NIS-сервером для цього клієнта.

source: Changing the user information for %s
uk: Зміна інформації про користувача %s

source: %s: fields too long
uk: %s: поля занадто довгі

source: Usage: %s [options] Options:
uk: Використання: %s [параметри] Параметри:

source: -c, --crypt-method METHOD the crypt method (one of %s)
uk: -c, --crypt-method МЕТОД алгоритм шифрування (один з: %s)

source: -e, --encrypted supplied passwords are encrypted
uk: -e, --encrypted паролі передаються зашифрованими

source: -m, --md5 encrypt the clear text password using the MD5 algorithm
uk: -m, --md5 шифрувати видимі паролі за допомогою алгоритму MD5

source: -s, --sha-rounds number of SHA rounds for the SHA* crypt algorithms
uk: -s, --sha-rounds кількість раундів SHA для алгоритмів шифрування SHA*

source: %s: %s flag is only allowed with the %s flag
uk: %s: параметр %s дозволено використовувати лише разом з параметром %s

source: %s: the -c, -e, and -m flags are exclusive
uk: %s: параметри -c, -e і -m є взаємовиключаючими

source: %s: unsupported crypt method: %s
uk: %s: алгоритм шифрування %s не підтримується

source: %s: line %d: line too long
uk: %s: рядок %d: рядок занадто довгий

source: %s: line %d: missing new password
uk: %s: рядок %d: бракує нового пароля

source: %s: failed to crypt password with salt '%s': %s
uk: %s: не вдалося зашифрувати пароль з сіллю «%s»: %s

source: %s: line %d: group '%s' does not exist
uk: %s: рядок %d: група «%s» не існує

source: %s: line %d: failed to prepare the new %s entry '%s'
uk: %s: рядок %d: не вдалося підготувати новий %s запис «%s»

source: %s: error detected, changes ignored
uk: %s: виявлено помилку, зміни ігноруються

source: %s: (line %d, user %s) password not changed
uk: %s: (рядок %d, користувач %s) пароль не змінено

source: %s: line %d: user '%s' does not exist
uk: %s: рядок %d: користувач «%s» не існує

source: -s, --shell SHELL new login shell for the user account
uk: -s, --shell ОБОЛОНКА нова реєстраційна оболонка для облікового запису

source: Login Shell
uk: Оболонка входу в систему

source: You may not change the shell for '%s'.
uk: Ви не можете змінювати командну оболонку у «%s».

source: Changing the login shell for %s
uk: Змінюю оболонку для %s

source: %s: Invalid entry: %s
uk: %s: Невірний запис: %s

source: %s: %s is an invalid shell
uk: %s: %s є неприпустимою оболонкою

source: %s: Warning: %s does not exist
uk: %s: Попередження: %s не існує

source: %s: Warning: %s is not executable
uk: %s: Попередження: %s не є виконуваним

source: -c, --check check the user's password expiration
uk: -c, --check перевірити термін дії паролю користувача

source: -f, --force force password change if the user's password is expired
uk: -f, --force примусово змінити пароль, якщо термін дії паролю закінчився

source: %s: options %s and %s conflict
uk: %s: конфлікт параметрів %s і %s

source: %s: unexpected argument: %s
uk: %s: неочікуваний параметр: %s

source: -a, --all display faillog records for all users
uk: -a, --all показати записи faillog для усіх користувачів

source: -l, --lock-secs SEC after failed login lock account for SEC seconds
uk: -l, --lock-secs СЕК заблокувати обліковий запис після невдалих спроб входу на СЕК секунд

source: -m, --maximum MAX set maximum failed login counters to MAX
uk: -m, --maximum МАКС встановити максимальну кількість невдалих спроб входу рівним МАКС

source: -r, --reset reset the counters of login failures
uk: -r, --reset скинути лічильник невдалих спроб входу

source: -t, --time DAYS display faillog records more recent than DAYS
uk: -t, --time ДНІВ показати записи faillog за останню кількість ДНІВ

source: -u, --user LOGIN/RANGE display faillog record or maintains failure counters and limits (if used with -r, -m, or -l) only for the specified LOGIN(s)
uk: -u, --user КОРИСТ/ДІАПАЗОН показати записи faillog або відмови по лічильникам підтримки та обмежень (якщо використовується с -r, -m або -l) лише для вказаного КОРИСТУВАЧА(ІВ)

source: %s: Failed to get the entry for UID %lu
uk: %s: не вдалося отримати запис для UID %lu

source: Login Failures Maximum Latest On
uk: Логін Помилок Максимум Останнє На

source: [%lus left]
uk: [залишилося %lu]

source: [%lds lock]
uk: [%lds блоковано]

source: %s: Failed to reset fail count for UID %lu
uk: %s: не вдалося скинути лічильник невдалих спроб для UID %lu

source: %s: Failed to set max for UID %lu
uk: %s: не вдалося встановити максимальне число спроб для UID %lu

source: %s: Failed to set locktime for UID %lu
uk: %s: не вдалося встановити час блокування для UID %lu

source: %s: Unknown user or range: %s
uk: %s: невідомий користувач або діапазон: %s

source: %s: Cannot get the size of %s: %s
uk: %s: не вдалося отримати розмір %s: %s

source: %s: Failed to write %s: %s
uk: %s: не вдалося записати %s: %s

source: Usage: %s [option] GROUP Options:
uk: Використання: %s [параметр] ГРУПА Параметри:

source: -a, --add USER add USER to GROUP
uk: -a, --add КОРИСТ додати КОРИСТУВАЧА до ГРУПИ

source: -d, --delete USER remove USER from GROUP
uk: -d, --delete КОРИСТ вилучити КОРИСТУВАЧА з ГРУПИ

source: -Q, --root CHROOT_DIR directory to chroot into
uk: -Q, --root КАТ_CHROOT каталог, який виконується chroot

source: -r, --remove-password remove the GROUP's password
uk: -r, --remove-password вилучити пароль ГРУПИ

source: -R, --restrict restrict access to GROUP to its members
uk: -R, --restrict обмежити доступ до ГРУПИ її членами

source: -M, --members USER,... set the list of members of GROUP
uk: -M, --members КОРИСТ,… вказати перелік членів ГРУПИ

source: -A, --administrators ADMIN,... set the list of administrators for GROUP
uk: -A, --administrators АДМІН,… вказати перелік адміністраторів ГРУПИ

source: Except for the -A and -M options, the options cannot be combined.
uk: За виключенням параметрів -A і -M, решта не можуть вказуватися

source: The options cannot be combined.
uk: Параметри не можуть бути вказані одночасно.

source: %s: shadow group passwords required for -A
uk: %s: приховані паролі груп потрібні для -A

source: %s: group '%s' does not exist in %s
uk: %s: група «%s» не існує у %s

source: %s: failure while closing read-only %s
uk: %s: помилка при закриванні лише для читання %s

source: Changing the password for group %s
uk: Зміна пароля для групи %s

source: New Password:
uk: Новий пароль:

source: Re-enter new password:
uk: Повторіть новий пароль:

source: They don't match; try again
uk: Вони не збігаються; спробуйте ще раз

source: %s: Try again later
uk: %s: Спробуйте ще раз пізніше

source: Adding user %s to group %s
uk: Додавання нового користувача %s до групи %s

source: Removing user %s from group %s
uk: Вилучення користувача %s з групи %s

source: %s: user '%s' is not a member of '%s'
uk: %s: користувач «%s» не є членом «%s»

source: %s: Not a tty
uk: %s: Не є tty

source: Usage: %s [options] GROUP Options:
uk: Використання: %s [параметри] ГРУПА Параметри:

source: -f, --force exit successfully if the group already exists, and cancel -g if the GID is already used
uk: -f, --force закінчити роботу без помилки, якщо група існує і скасувати -g, якщо GID вже використовується

source: -g, --gid GID use GID for the new group
uk: -g, --gid GID для нової групи використовувати вказаний GID

source: -K, --key KEY=VALUE override /etc/login.defs defaults
uk: -K, --key КЛЮЧ=ЗНАЧЕННЯ замінити типове значення з /etc/login.defs

source: -o, --non-unique allow to create groups with duplicate (non-unique) GID
uk: -o, --non-unique дозволити створення груп з повторюваними (неунікальним) GID

source: -p, --password PASSWORD use this encrypted password for the new group
uk: -p, --password ПАРОЛЬ використовувати цей шифрований пароль для нової групи

source: -r, --system create a system account
uk: -r, --system створити системний обліковий запис

source: %s: '%s' is not a valid group name
uk: %s: «%s» не може бути іменем групи

source: %s: invalid group ID '%s'
uk: %s: неправильний ID групи «%s»

source: %s: -K requires KEY=VALUE
uk: %s: -K вимагає ЗМІННА=ЗНАЧЕННЯ

source: %s: group '%s' already exists
uk: %s: група «%s» вже існує

source: %s: GID '%lu' already exists
uk: %s: GID «%lu» вже існує

source: %s: Cannot setup cleanup service.
uk: %s: не вдалося налаштувати службу очищення.

source: -f, --force delete group even if it is the primary group of a user
uk: -f, --force видалити групу навіть якщо це первинна група користувача

source: %s: cannot remove entry '%s' from %s
uk: %s: не вдалося вилучити запис «%s» з %s

source: %s: cannot remove the primary group of user '%s'
uk: %s: не вдалося вилучити первинну групу користувача «%s»
