Repository: PlagaMedicum/Ubuntu-Translation-Demo
Catalog: rosetta-eoan/*/LC_MESSAGES/shadow.po
Languages: uk

source: %s: group '%s' does not exist
uk: %s: група «%s» не існує

source: %s: group '%s' is a NIS group
uk: %s: група «%s» є групою NIS

source: %s: %s is the NIS master
uk: %s: %s є сервер NIS

source: %s: user '%s' is already a member of '%s'
uk: %s: користувач «%s» є членом «%s»

source: %s: Out of memory. Cannot update %s.
uk: %s: бракує пам’яті. Неможливо оновити %s.

source: Usage: %s [options] [action] Options:
uk: Використання: %s [параметри] [дія] Параметри:

source: -g, --group groupname change groupname instead of the user's group (root only)
uk: -g, --group ім’я_групи використовувати ім’я_групи замість групи з іменем користувача (лише для суперкористувача)

source: Actions:
uk: Дії:

source: -a, --add username add username to the members of the group
uk: -a, --add користувач додати користувача до групи

source: -d, --delete username remove username from the members of the group
uk: -d, --delete користувач вилучити користувача з групи

source: -p, --purge purge all members from the group
uk: -p, --purge вилучити усіх користувачів з групи

source: -l, --list list the members of the group
uk: -l, --list перелічити усіх членів групи

source: %s: your groupname does not match your username
uk: %s: ваше ім’я_групи не збігається з вашим користувацьким ім’ям

source: %s: only root can use the -g/--group option
uk: %s: лише суперкористувач може використовувати параметр -g/--group

source: -g, --gid GID change the group ID to GID
uk: -g, --gid GID змінити ID групи на GID

source: -n, --new-name NEW_GROUP change the name to NEW_GROUP
uk: -n, --new-name НОВА_ГРУПА змінити ім’я на НОВУ_ГРУПУ

source: -o, --non-unique allow to use a duplicate (non-unique) GID
uk: -o, --non-unique дозволити повторювані (не унікальні) GID

source: -p, --password PASSWORD change the password to this (encrypted) PASSWORD
uk: -p, --password ПАРОЛЬ змінити пароль на вказаний (шифрований) ПАРОЛЬ

source: %s: invalid group name '%s'
uk: %s: неправильне ім’я групи «%s»

source: %s: group %s is a NIS group
uk: %s: група %s є групою NIS

source: %s: unknown user %s
uk: %s: невідомий користувач %s

source: Usage: %s [options] [group [gshadow]] Options:
uk: Використання: %s [параметри] [файл_group [файл_gshadow]] Параметри:

source: Usage: %s [options] [group] Options:
uk: Використання: %s [параметри] [група] Параметри:

source: -r, --read-only display errors and warnings but do not change files
uk: -r, --read-only показувати помилки і попередження, але не змінювати файли

source: -s, --sort sort entries by UID
uk: -s, --sort сортувати записи за UID

source: %s: -s and -r are incompatible
uk: %s: -s и -r не можуть використовуватися одночасно

source: invalid group file entry
uk: невірний запис у файлі груп

source: delete line '%s'?
uk: видалити рядок "%s"?

source: duplicate group entry
uk: дублюючий запис у базі груп

source: invalid group name '%s'
uk: невірна назва групи "%s"

source: invalid group ID '%lu'
uk: неправильний ID групи «%lu»

source: group %s: no user %s
uk: група %s: немає користувача %s

source: delete member '%s'?
uk: видалити члена "%s"?

source: no matching group file entry in %s
uk: відповідний запис файлу груп відсутній у %s

source: add group '%s' in %s?
uk: додати групу «%s» у %s ?

source: group %s has an entry in %s, but its password field in %s is not set to 'x'
uk: для групи %s є запис у %s, але її поле паролю у %s не дорівнює «x»

source: invalid shadow group file entry
uk: невірний запис у файлі прихованих груп

source: duplicate shadow group entry
uk: дублюючий запис у файлі прихованих груп

source: shadow group %s: no administrative user %s
uk: прихована група %s: не має адміністратора %s

source: delete administrative member '%s'?
uk: видалити адміністратора "%s"?

source: shadow group %s: no user %s
uk: прихована група %s: немає користувача %s

source: %s: the files have been updated
uk: %s: файли було оновлено

source: %s: no changes
uk: %s: без змін

source: %s: cannot delete %s
uk: %s: не вдалося вилучити %s

source: Usage: id [-a]
uk: Використання: id [-a]

source: Usage: id
uk: Використання: id

source: groups=
uk: групи=

source: -b, --before DAYS print only lastlog records older than DAYS
uk: -b, --before ДНІВ показати записи lastlog за старіші ДНІВ

source: -C, --clear clear lastlog record of an user (usable only with -u)
uk: -C, --clear очистити запис lastlog для користувача (доступне для користування лише з -u)

source: -S, --set set lastlog record to current time (usable only with -u)
uk: -S, --set задати для запису lastlog поточний час (доступне для користування з -u)

source: -t, --time DAYS print only lastlog records more recent than DAYS
uk: -t, --time ДНІВ показати записи lastlog за новіші ДНІВ

source: -u, --user LOGIN print lastlog record of the specified LOGIN
uk: -u, --user ІМ’Я показати запис lastlog для облікового запису ІМ’Я

source: Username Port From Latest
uk: Користувач Порт Звідки Останній вхід

source: Username Port Latest
uk: Користувач Порт Останній вхід

source: **Never logged in**
uk: **Ніколи не входив**

source: %s: Failed to update the entry for UID %lu
uk: %s: Не вдалося оновити запис для UID %lu

source: %s: Failed to update the lastlog file
uk: %s: Не вдалося оновити файл lastlog

source: %s: Option -C cannot be used together with option -S
uk: %s: Параметр -C неможливо використовувати з параметром -S

source: %s: Options -C and -S require option -u to specify the user
uk: %s: Параметр -C та -S вимагають параметр -u для зазначення користувача

source: Usage: %s [-p] [name]
uk: Використання: %s [-p] [ім'я]

source: %s [-p] [-h host] [-f name]
uk: %s [-p] [-h вузол] [-f ім'я]

source: %s [-p] -r host
uk: %s [-p] -r вузол

source: configuration error - cannot parse %s value: '%d'
uk: помилка налаштування: не вдалося розібрати значення %s: «%d»

source: Invalid login time
uk: Невірний час для входу

source: System closed for routine maintenance
uk: Систему закрито для профілактики.

source: [Disconnect bypassed -- root login allowed.]
uk: [Сталося відключення -- дозволено лише вхід root-a.]

source: %s: Cannot possibly work without effective root
uk: %s: неможливо виконати без прав суперкористувача

source: No utmp entry. You must exec "login" from the lowest level "sh"
uk: Немає запису utmp. Вам потрібно виконати "login" з "sh" найнижчого рівня

source: Login timed out after %u seconds.
uk: Час виконання входу у систему вичерпано (%u секунд).

source: login: PAM Failure, aborting: %s
uk: login: Помилка PAM, перервано: %s

source: %s login:
uk: %s логін:

source: login:
uk: логін:

source: Maximum number of tries exceeded (%u)
uk: Перевищено максимальне число спроб (%u)

source: login: abort requested by PAM
uk: login: система PAM запросила переривання

source: Login incorrect
uk: Невірний логін

source: Cannot find user (%s)
uk: Неможливо знайти користувача (%s)

source: %s login:
uk: %s логін:

source: %s: failure forking: %s
uk: %s: помилка відгалудження: %s

source: TIOCSCTTY failed on %s
uk: Не вдалося встановити прапорець TIOCSCTTY на %s

source: Warning: login re-enabled after temporary lockout.
uk: Застереження: login поновлено після тимчасового блокування.

source: Last login: %s on %s
uk: Останній вхід в систему: %s на %s

source: Last login: %.19s on %s
uk: Останній вхід в систему: %.19s на %s

source: from %.*s
uk: з %.*s

source: login time exceeded
uk: вичерпано час логіну

source: Usage: logoutd
uk: Використання: logoutd

source: Usage: newgrp [-] [group]
uk: Використання: newgrp [-] [група]

source: Usage: sg group [[-c] command]
uk: Використання: sg група [[-c] команда]

source: %s: failed to crypt password with previous salt: %s
uk: %s: не вдалося зашифрувати пароль з попередньою сіллю: %s

source: Invalid password.
uk: Неправильний пароль.

source: %s: failure forking: %s
uk: %s: помилка при відгалуженні: %s

source: %s: GID '%lu' does not exist
uk: %s: GID «%lu» не існує

source: too many groups
uk: занадто багато груп

source: -r, --system create system accounts
uk: -r, --system створити системні облікові записи

source: %s: group '%s' is a shadow group, but does not exist in /etc/group
uk: %s: група «%s» є тіньовою групою, але не існує у /etc/group

source: %s: invalid user ID '%s'
uk: %s: неправильний користувацький ID «%s»

source: %s: invalid user name '%s'
uk: %s: невірне ім'я користувача '%s'

source: %s: line %d: invalid line
uk: %s: рядок %d: невірний рядок

source: %s: cannot update the entry of user %s (not in the passwd database)
uk: %s: не вдалося оновити запис для користувача %s (його немає у базі даних passwd)

source: %s: line %d: can't create user
uk: %s: рядок %d: не вдалося створити користувача

source: %s: line %d: can't create group
uk: %s: рядок %d: не вдалося створити групу

source: %s: line %d: user '%s' does not exist in %s
uk: %s: рядок %d: користувач «%s» не існує у %s

source: %s: line %d: can't update password
uk: %s: рядок %d: не можу оновити пароль

source: %s: line %d: mkdir %s failed: %s
uk: %s: рядок %d: виклик mkdir %s закінчився невдало: %s

source: %s: line %d: chown %s failed: %s
uk: %s: рядок %d: виклик chown %s закінчився невдало: %s

source: %s: line %d: can't update entry
uk: %s: рядок %d: не можу оновити запис

source: %s: failed to prepare new %s entry
uk: %s: не вдалося підготувати новий запис %s

source: %s: can't find subordinate user range
uk: %s: неможливо знайти залежний діапазон користувачів

source: %s: can't find subordinate group range
uk: %s: неможливо знайти залежний діапазон груп

source: -a, --all report password status on all accounts
uk: -a, --all показати стан паролів усіх облікових записів

source: -d, --delete delete the password for the named account
uk: -d, --delete вилучити пароль вказаного обліковоо запису

source: -e, --expire force expire the password for the named account
uk: -e, --expire відкласти пароль вказаного облікового запису

source: -k, --keep-tokens change password only if expired
uk: -k, --keep-tokens змінювати пароль лише з закінченим терміном дії

source: -i, --inactive INACTIVE set password inactive after expiration to INACTIVE
uk: -i, --inactive НЕАКТИВНІСТЬ встановити неактивність паролю після закінчення терміну у значення НЕАКТИВНІСТЬ

source: -l, --lock lock the password of the named account
uk: -l, --lock заблокувати вказаний обліковий запис

source: -n, --mindays MIN_DAYS set minimum number of days before password change to MIN_DAYS
uk: -n, --mindays МІН_ДНІВ встановити мінімальне число днів перед зміною паролю у МІН_ДНІВ

source: -q, --quiet quiet mode
uk: -q, --quiet скоротити кількість повідомлень, що виводяться

source: -r, --repository REPOSITORY change password in REPOSITORY repository
uk: -r, --repository СХОВИЩЕ змінити пароль у СХОВИЩІ

source: -S, --status report password status on the named account
uk: -S, --status показати стан паролю вказаного облікового запису

source: -u, --unlock unlock the password of the named account
uk: -u, --unlock розблокувати вказаний обліковий запис

source: -w, --warndays WARN_DAYS set expiration warning days to WARN_DAYS
uk: -w, --warndays ПОПЕР_ДНІВ встановити кількість днів з видачею попередження у ПОПЕР_ДНІВ

source: -x, --maxdays MAX_DAYS set maximum number of days before password change to MAX_DAYS
uk: -x, --maxdays МАКС_ДНІВ встановити максимальне число днів перед зміною паролю у МАКС_ДНІВ

source: Old password:
uk: Старий пароль:

source: Enter the new password (minimum of %d characters) Please use a combination of upper and lower case letters and numbers.
uk: Уведіть новий пароль (мінімальна довжина %d символів) Використовуйте комбінацію з символів у верхньому і нижньому регістрі й цифри.

source: Enter the new password (minimum of %d, maximum of %d characters) Please use a combination of upper and lower case letters and numbers.
uk: Введіть новий пароль (від %d до %d знаків) Змішуйте великі та малі літери та цифри.

source: New password:
uk: Новий пароль:

source: Try again.
uk: Спробуйте ще.

source: Warning: weak password (enter it again to use it anyway).
uk: Застереження: Поганий пароль (введіть його знову, якщо все одно бажаєте його використовувати).

source: They don't match; try again.
uk: Не співпадає; спробуйте знову.

source: The password for %s cannot be changed.
uk: Пароль для %s не може бути змінений.

source: The password for %s cannot be changed yet.
uk: Пароль для %s поки не може бути змінено.

source: %s: unlocking the password would result in a passwordless account. You should set a password with usermod -p to unlock the password of this account.
uk: %s: розблокування паролю призведе до появи безпарольного облікового запису. Ви повинні вказати пароль за допомогою usermod -p для розблокування облікового запису користувача.

source: %s: repository %s not supported
uk: %s: сховище %s не підтримується

source: %s: %s is not authorized to change the password of %s
uk: %s: в %s немає прав змінювати пароль %s

source: %s: You may not view or modify password information for %s.
uk: %s: Ви не можете дивитися та змінювати парольну інформацію для %s.

source: Changing password for %s
uk: Зміна пароля для %s

source: The password for %s is unchanged.
uk: Пароль для %s не змінено.

source: %s: password changed.
uk: %s: пароль змінено.

source: %s: password expiry information changed.
uk: %s: інформація про закінчення терміну дії паролю змінена.

source: Usage: %s [options] [passwd] Options:
uk: Встановлення: %s [параметри] [passwd] Параметри:

source: Usage: %s [options] [passwd [shadow]] Options:
uk: Використання: %s [параметри] [passwd [shadow]] Параметри:

source: -q, --quiet report errors only
uk: -q, --quiet показувати лише повідомлення про помилки

source: %s: no alternative shadow file allowed when USE_TCB is enabled.
uk: %s: неможна вказати альтернативний файл shadow, якщо увімкнено режим USE_TCB.

source: invalid password file entry
uk: невірний запис у файлі паролів

source: duplicate password entry
uk: дублюючий запис у файлі паролів

source: invalid user name '%s'
uk: невірне ім'я користувача '%s'

source: invalid user ID '%lu'
uk: неправильний користувацький ID «%lu»

source: user '%s': no group %lu
uk: користувач «%s»: група %lu не існує

source: user '%s': directory '%s' does not exist
uk: користувач «%s: каталог «%s» не існує

source: user '%s': program '%s' does not exist
uk: користувач «%s»: програма «%s» не існує

source: no tcb directory for %s
uk: немає каталогу tcb для %s

source: create tcb directory for %s?
uk: створити каталог tcb для %s?

source: failed to create tcb directory for %s
uk: не вдалося створити каталог tcb для %s

source: %s: cannot lock %s.
uk: %s: не вдалося заблокувати %s.

source: no matching password file entry in %s
uk: відсутній відповідний запис у файлі паролів %s

source: add user '%s' in %s?
uk: додати користувача "%s" в %s?

source: user %s has an entry in %s, but its password field in %s is not set to 'x'
uk: для користувача %s є запис у %s, але його поле паролю в %s не дорівнює «x»

source: invalid shadow password file entry
uk: невірний запис у файлі прихованих паролів

source: duplicate shadow password entry
uk: дублюючий запис у файлі прихованих паролів

source: user %s: last password change in the future
uk: користувач %s: остання зміна пароля у майбутньому

source: %s: cannot sort entries in %s
uk: %s: не вдалося відсортувати записи у %s

source: %s: can't work with tcb enabled
uk: %s: з увімкненим режимом tcb робота неможлива

source: %s: failed to change the mode of %s to 0600
uk: %s: не вдалося змінити права %s на 0600

source: Access to su to that account DENIED.
uk: Доступ цього користувача до su ЗАБОРОНЕНО.

source: Password authentication bypassed.
uk: Аутентифікацію пройдено.

source: Please enter your OWN password as authentication.
uk: Будь ласка введіть Ваш власний пароль для аутентифікації.

source: %s: Cannot fork user shell
uk: %s: неможливо виконати fork користувацької оболонки

source: %s: signal malfunction
uk: %s: несправність у сигналах

source: %s: signal masking malfunction
uk: %s: несправність у маскуванні сигналів

source: Session terminated, terminating shell...
uk: Сеанс завершено, виконується завершення оболонки…

source: ...killed.
uk: … завершено.

source: ...waiting for child to terminate.
uk: … очікує завершення нащадка.

source: ...terminated.
uk: … завершёно.

source: Usage: su [options] [LOGIN] Options: -c, --command COMMAND pass COMMAND to the invoked shell -h, --help display this help message and exit -, -l, --login make the shell a login shell -m, -p, --preserve-environment do not reset environment variables, and keep the same shell -s, --shell SHELL use SHELL instead of the default in passwd
uk: Використання: su [параметри] [ЛОГІН] Параметри: -c, --command КОМАНДА передати КОМАНДУ запущеній оболонці -h, --help вивести це довідкове повідомлення та вийти -, -l, --login зробити оболонку вхідною -m, -p, --preserve-environment не скидувати змінні оточення і залишити таку саму оболонку -s, --shell ОБОЛОНКА використати ОБОЛОНКУ замість вказаної в passwd

source: %s: %s (Ignored)
uk: %s: %s (Ігнорую)

source: You are not authorized to su %s
uk: Ви не авторизовані для su %s

source: (Enter your own password)
uk: (Введіть ваш пароль)

source: %s: Authentication failure
uk: %s: не вдалося пройти перевірку справжності

source: %s: You are not authorized to su at that time
uk: %s: в вас немає прав виконувати su на цю мить

source: No passwd entry for user '%s'
uk: Відсутній passwd-запис для користувача «%s»

source: %s: must be run from a terminal
uk: %s: повинно бути запущено з терміналу

source: %s: pam_start: error %d
uk: %s: pam_start: помилка %d

source: %s: Cannot drop the controlling terminal
uk: %s: не вдалося скинути керуючий термінал

source: Cannot execute %s
uk: Не вдалося виконати %s

source: No password file
uk: Немає файлу паролів

source: TIOCSCTTY failed
uk: Не вдалося встановити прапорець TIOCSCTTY

source: No password entry for 'root'
uk: Бракує запису у базі паролів для 'root'

source: Type control-d to proceed with normal startup, (or give root password for system maintenance):
uk: Натисніть control-d для виконання звичайного завантаження, (або введіть пароль адміністратора для відновлення системи):

source: Entering System Maintenance Mode
uk: Входимо у режим відновлення системи

source: %s: %s was created, but could not be removed
uk: %s: каталог %s створено, але не може бути вилучено

source: %s: the %s configuration in %s will be ignored
uk: %s: налаштування %s у %s буде проігноровано

source: %s: cannot create new defaults file
uk: %s: не можу створити новий файл із значеннями по замовчуванню

source: %s: cannot open new defaults file
uk: %s: не можу відкрити новий файл із значеннями по замовчуванню

source: %s: line too long in %s: %s...
uk: %s: задовгий рядок у %s: %s…

source: %s: Cannot create backup file (%s): %s
uk: %s: Не вдалося створити файл резервної копії (%s): %s

source: %s: rename: %s: %s
uk: %s: перейменувати: %s: %s

source: %s: group '%s' is a NIS group.
uk: %s: група "%s" є групою NIS.

source: %s: too many groups specified (max %d).
uk: %s: вказано забагато груп (макс %d).

source: Usage: %s [options] LOGIN %s -D %s -D [options] Options:
uk: Використання: %s [параметри] КОРИСТУВАЧ %s -D %s -D [параметри]

source: -b, --base-dir BASE_DIR base directory for the home directory of the new account
uk: -b, --base-dir БАЗ_КАТ базовий каталог для домашнього каталогу нового облікового запису

source: -c, --comment COMMENT GECOS field of the new account
uk: -c, --comment КОМЕНТАР поле GECOS нового облікового запису

source: -d, --home-dir HOME_DIR home directory of the new account
uk: -d, --home-dir ДОМ_КАТ домашній каталог нового облікового запису

source: -D, --defaults print or change default useradd configuration
uk: -D, --defaults показати або змінити налаштування типово для useradd

source: -e, --expiredate EXPIRE_DATE expiration date of the new account
uk: -e, --expiredate ДАТА_СТ дата старіння нового облікового запису

source: -f, --inactive INACTIVE password inactivity period of the new account
uk: -f, --inactive НЕАКТИВНІСТЬ період неактивності паролю нового облікового запису

source: -g, --gid GROUP name or ID of the primary group of the new account
uk: -g, --gid ГРУПА ім’я або ID первинної групи нового облікового запису

source: -G, --groups GROUPS list of supplementary groups of the new account
uk: -G, --groups ГРУПИ перелік додаткових груп нового облікового запису

source: -k, --skel SKEL_DIR use this alternative skeleton directory
uk: -k, --skel КАТ_ШАБ використовувати альтернативний каталог з шаблонами

source: -l, --no-log-init do not add the user to the lastlog and faillog databases
uk: -l, --no-log-init не додавати користувача у бази даних lastlog і faillog

source: -m, --create-home create the user's home directory
uk: -m, --create-home створити домашній каталог користувача

source: -M, --no-create-home do not create the user's home directory
uk: -M, --no-create-home не створювати домашній каталог користувача

source: -N, --no-user-group do not create a group with the same name as the user
uk: -N, --no-user-group не створювати групу з тим самим ім’ям що й у користувача

source: -o, --non-unique allow to create users with duplicate (non-unique) UID
uk: -o, --non-unique дозволити створення користувачів з повторюваними (не унікальними) UID

source: -p, --password PASSWORD encrypted password of the new account
uk: -p, --password ПАРОЛЬ зашифрований пароль нового облікового запису

source: -s, --shell SHELL login shell of the new account
uk: -s, --shell ОБОЛОНКА реєстраційна оболонка нового облікового запису

source: -u, --uid UID user ID of the new account
uk: -u, --uid UID користувацький ID нового облікового запису

source: -U, --user-group create a group with the same name as the user
uk: -U, --user-group створити групу з тим самим ім’ям що й у користувача

source: -Z, --selinux-user SEUSER use a specific SEUSER for the SELinux user mapping
uk: -Z, --selinux-user SEUSER використовувати вказаного SEUSER для користувацького зіставлення SELinux

source: %s: invalid base directory '%s'
uk: %s: невірна базова тека "%s"

source: %s: invalid comment '%s'
uk: %s: невірний коментар "%s"

source: %s: invalid home directory '%s'
uk: %s: невірна домашня тека "%s"

source: %s: shadow passwords required for -e
uk: %s: приховані паролі потрібні для -e

source: %s: shadow passwords required for -f
uk: %s: приховані паролі потрібні для -f

source: %s: invalid field '%s'
uk: %s: невірне поле "%s"

source: %s: invalid shell '%s'
uk: %s: невірна оболонка "%s"

source: %s: -Z requires SELinux enabled kernel
uk: %s: для -Z у ядрі потрібно увімкнути SELinux

source: %s: failed to reset the faillog entry of UID %lu: %s
uk: %s: не вдалося скинути запис у faillog для UID %lu: %s

source: %s: failed to reset the lastlog entry of UID %lu: %s
uk: %s: не вдалося скинути запис у lastlog для UID %lu: %s

source: %s: failed to prepare the new %s entry
uk: %s: не вдалося підготувати новий запис %s

source: %s: cannot create directory %s
uk: %s: не можу створити теку %s

source: Creating mailbox file
uk: Створюється файл поштової скриньки

source: Group 'mail' not found. Creating the user mailbox file with 0600 mode.
uk: Групу "mail" не знайдено. Поштова скринька користувача створюється з правами доступу 0600

source: Setting mailbox file permissions
uk: Встановлюються права доступу на файл поштової скриньки

source: %s: user '%s' already exists
uk: %s: користувач «%s» вже існує

source: %s: group %s exists - if you want to add this user to that group, use -g.
uk: %s: група %s існує - якщо ви бажаєте додати користувача до цієї групи, використовуйте -g.

source: %s: can't create user
uk: %s: не вдалося створити користувача

source: %s: UID %lu is not unique
uk: %s: UID %lu не є унікальним

source: %s: Failed to create tcb directory for %s
uk: %s: не вдалося створити tcb-каталог для %s
