Repository: PlagaMedicum/Ubuntu-Translation-Demo
Catalog: rosetta-eoan/*/LC_MESSAGES/shadow.po
Languages: uk

source: %s: can't create group
uk: %s: не вдалося створити групу

source: %s: can't create subordinate user IDs
uk: %s: неможливо створити залежні ідентифікатори користувачів

source: %s: can't create subordinate group IDs
uk: %s: неможливо створити залежні ідентифікатори груп

source: %s: warning: the home directory already exists. Not copying any file from skel directory into it.
uk: %s: увага: домашня тека вже існує. Жоден файл з директорії кістяка не копіюється.

source: %s: warning: the user name %s to %s SELinux user mapping failed.
uk: %s: попередження: не вдалося зіставити ім’я користувача %s з користувачем SELinux %s.

source: -f, --force force removal of files, even if not owned by user
uk: -f, --force вилучати файли, навіть якщо вони не належать користувачу

source: -r, --remove remove home directory and mail spool
uk: -r, --remove вилучити домашній каталог і поштову скриньку

source: -Z, --selinux-user remove any SELinux user mapping for the user
uk: -Z, --selinux-user вилучити усі користувацькі зіставлення SELinux для користувача

source: %s: group %s not removed because it is not the primary group of user %s.
uk: %s: група %s не вилучена, оскільки це не первинна група користувача %s.

source: %s: group %s not removed because it has other members.
uk: %s: група %s не вилучена, оскільки у ній є інші члени.

source: %s: group %s is the primary group of another user and is not removed.
uk: %s: група %s є первинною для іншого користувача й не може бути вилучена.

source: %s: cannot remove entry %lu from %s
uk: %s: неможливо вилучити запис %lu з %s

source: %s: %s mail spool (%s) not found
uk: %s: поштова скринька %s (%s) не знайдена

source: %s: warning: can't remove %s: %s
uk: %s: попередження: не вдалося вилучити %s: %s

source: %s: %s not owned by %s, not removing
uk: %s: %s не належить %s, не видалено

source: %s: Can't allocate memory, tcb entry for %s not removed.
uk: %s: не вдалося виділити пам’ять, елемент tcb для %s не вилучено.

source: %s: Cannot drop privileges: %s
uk: %s: не вдалося знизити рівень привілеїв: %s

source: %s: Cannot remove the content of %s: %s
uk: %s: не вдалося вилучити вміст %s: %s

source: %s: Cannot remove tcb files for %s: %s
uk: %s: не вдалося вилучити файли tcb для %s: %s

source: %s: user %s is a NIS user
uk: %s: користувач %s є користувачем NIS

source: %s: %s home directory (%s) not found
uk: %s: домашній каталог користувача %s (%s) не знайдено

source: %s: not removing directory %s (would remove home of user %s)
uk: %s: не видалено теку %s (можна видалити домашню теку користувача %s)

source: %s: error removing directory %s
uk: %s: помилка видалення теки %s

source: %s: warning: the user name %s to SELinux user mapping removal failed.
uk: %s: попередження: не вдалося вилучити користувацьке зіставлення SELinux у ім’я користувача %s.

source: -c, --comment COMMENT new value of the GECOS field
uk: -c, --comment КОМЕНТАР нове значення поля GECOS

source: -d, --home HOME_DIR new home directory for the user account
uk: -d, --home ДОМ_КАТ новий домашній каталог облікового запису

source: -e, --expiredate EXPIRE_DATE set account expiration date to EXPIRE_DATE
uk: -e, --expiredate ДАТА_ВСТ встановити дату закінчення дії облікового запису у ДАТА_ВСТ

source: -f, --inactive INACTIVE set password inactive after expiration to INACTIVE
uk: -f, --inactive НЕАКТИВНІСТЬ встановити період неактивності паролю після старіння облікового запису рівним НЕАКТИВНІСТЬ

source: -g, --gid GROUP force use GROUP as new primary group
uk: -g, --gid ГРУПА примусово призначити первинну ГРУПУ

source: -G, --groups GROUPS new list of supplementary GROUPS
uk: -G, --groups ГРУПИ перелік додаткових ГРУП

source: -a, --append append the user to the supplemental GROUPS mentioned by the -G option without removing him/her from other groups
uk: -a, --append додати користувача у додаткові ГРУПИ, вказані у параметрі -G не вилучаючи користувача з інших груп

source: -l, --login NEW_LOGIN new value of the login name
uk: -l, --login НОВЕ_ІМ’Я нове значення ім’я облікового запису

source: -L, --lock lock the user account
uk: -L, --lock заблокувати обліковий запис

source: -m, --move-home move contents of the home directory to the new location (use only with -d)
uk: -m, --move-home перемістити вміст домашнього каталогу у нове місце (використовувати лише разом з -d)

source: -o, --non-unique allow using duplicate (non-unique) UID
uk: -o, --non-unique дозволити створення облікового запису з вже (не унікальным) UID, що є

source: -p, --password PASSWORD use encrypted password for the new password
uk: -p, --password ПАРОЛЬ вказати новий шифрований пароль для облікового запису

source: -u, --uid UID new UID for the user account
uk: -u, --uid UID новий UID для облікового запису

source: -U, --unlock unlock the user account
uk: -U, --unlock розблокувати обліковий запис

source: -v, --add-subuids FIRST-LAST add range of subordinate uids
uk: -v, --add-subuids ПЕРШИЙ-ОСТАННІЙ додати діапазон залежних ідентифікаторів користувачів

source: -V, --del-subuids FIRST-LAST remove range of subordinate uids
uk: -V, --del-subuids ПЕРШИЙ-ОСТАННІЙ вилучити діапазон залежних ідентифікаторів користувачів

source: -w, --add-subgids FIRST-LAST add range of subordinate gids
uk: -v, --add-subuids ПЕРШИЙ-ОСТАННІЙ додати діапазон залежних ідентифікаторів груп

source: -W, --del-subgids FIRST-LAST remove range of subordinate gids
uk: -v, --add-subuids ПЕРШИЙ-ОСТАННІЙ вилучити діапазон залежних ідентифікаторів груп

source: -Z, --selinux-user SEUSER new SELinux user mapping for the user account
uk: -Z, --selinux-user SEUSER нове користувацьке зіставлення SELinux для облікового запису

source: %s: unlocking the user's password would result in a passwordless account. You should set a password with usermod -p to unlock this user's password.
uk: %s: розблокування паролю користувача призведе до появи безпарольного облікового запису. Ви повинні вказати пароль за допомогою usermod -p для розблокування паролю користувача.

source: %s: user '%s' already exists in %s
uk: %s: користувач «%s» вже існує у %s

source: %s: invalid subordinate uid range '%s'
uk: %s: неприпустимий діапазон залежних ідентифікаторів користувачів «%s»

source: %s: invalid subordinate gid range '%s'
uk: %s: неприпустимий діапазон залежних ідентифікаторів груп «%s»

source: %s: no options
uk: %s: не вказані параметри

source: %s: the -L, -p, and -U flags are exclusive
uk: %s: параметри -L, -p і -U є взаємовиключаючими

source: %s: shadow passwords required for -e and -f
uk: %s: приховані паролі потрібні для -e і -f

source: %s: UID '%lu' already exists
uk: %s: UID «%lu» вже існує

source: %s: %s does not exist, you cannot use the flags %s or %s
uk: %s: %s не існує, ви не можете використовувати прапори %s або %s

source: %s: directory %s exists
uk: %s: тека %s існує

source: %s: The previous home directory (%s) was not a directory. It is not removed and no home directories are created.
uk: %s: Попередній домашній каталог (%s) не був домашнім каталогом. Він не вилучений й домашній каталог не створений.

source: %s: Failed to change ownership of the home directory
uk: %s: не вдалося змінити власника домашнього каталогу

source: %s: warning: failed to completely remove old home directory %s
uk: %s: увага: не вдалося повністю видалити стару домашню теку %s

source: %s: cannot rename directory %s to %s
uk: %s: не можу перейменувати теку з %s на %s

source: %s: failed to copy the lastlog entry of user %lu to user %lu: %s
uk: %s: не вдалося скопіювати запис lastlog про користувача %lu у користувача %lu: %s

source: %s: failed to copy the faillog entry of user %lu to user %lu: %s
uk: %s: не вдалося скопіювати запис faillog про користувача %lu у користувача %lu: %s

source: %s: warning: %s not owned by %s
uk: %s: застереження: %s не належить %s

source: failed to change mailbox owner
uk: не можу змінити власника поштової скриньки

source: failed to rename mailbox
uk: не можу перейменувати поштову скриньку

source: %s: failed to remove uid range %lu-%lu from '%s'
uk: %s: не вдалося вилучити діапазон ідентифікаторів користувача %lu-%lu з «%s»

source: %s: failed to add uid range %lu-%lu from '%s'
uk: %s: не вдалося додати діапазон ідентифікаторів користувача %lu-%lu з «%s»

source: %s: failed to remove gid range %lu-%lu from '%s'
uk: %s: не вдалося вилучити діапазон ідентифікаторів груп %lu-%lu з «%s»

source: %s: failed to add gid range %lu-%lu from '%s'
uk: %s: не вдалося додати діапазон ідентифікаторів груп %lu-%lu з «%s»

source: You have modified %s. You may need to modify %s for consistency. Please use the command '%s' to do so.
uk: Ви змінили %s. Для забезпечення погодження вам може знадобитися змінити %s. Для цього використовуйте команду «%s».

source: -g, --group edit group database
uk: -g, --group редагувати базу даних груп

source: -p, --passwd edit passwd database
uk: -p, --passwd редагувати базу даних паролів

source: -s, --shadow edit shadow or gshadow database
uk: -s, --shadow редагувати базу даних shadow або gshadow

source: -u, --user which user's tcb shadow file to edit
uk: -u, --user редагувати користувацький файл shadow структури tcb

source: %s: failed to remove %s
uk: %s: не вдалося вилучити %s

source: %s: %s is unchanged
uk: %s: %s не був змінений

source: failed to create scratch directory
uk: не вдалося створити чорновий каталог

source: failed to drop privileges
uk: не вдалося знизити рівень привілеїв

source: Couldn't get file context
uk: Не вдалося отримати файловий контекст

source: setfscreatecon () failed
uk: Виклик setfscreatecon () закінчився невдало

source: failed to gain privileges
uk: не вдалося підвищити рівень привілеїв

source: Couldn't lock file
uk: Не можу блокувати файл

source: Couldn't make backup
uk: Не можу зробити резервну копію

source: %s: %s returned with status %d
uk: %s: %s повернуто з кодом %d

source: %s: %s killed by signal %d
uk: %s: %s знищено за сигналом %d

source: failed to open scratch file
uk: не вдалося відкрити чорновий файл

source: failed to unlink scratch file
uk: не вдалося вилучити чорновий файл

source: failed to stat edited file
uk: не вдалося отримати атрибути редагованого файлу

source: failed to allocate memory
uk: виділення памяті зазнало невдачі

source: failed to create backup file
uk: не вдалося створити резервну копію файлу

source: %s: can't restore %s: %s (your changes are in %s)
uk: %s: не можу відновити %s: %s (ваші зміни у %s)

source: %s: failed to find tcb directory for %s
uk: %s: не вдалося знайти каталог tcb для %s
