Repository: PlagaMedicum/Ubuntu-Translation-Demo
Catalog: rosetta-eoan/*/LC_MESSAGES/snappy.po
Languages: uk

source: The publisher of snap %q has indicated that they do not consider this revision to be of production quality and that it is only meant for development or testing at this point. As a consequence this snap will not refresh automatically and may perform arbitrary system changes outside of the security sandbox snaps are generally confined to, which may put your system at risk. If you understand and want to proceed repeat the command including --devmode; if instead you want to install the snap forcing it into strict confinement repeat the command including --jailmode.
uk: Видавець snap %q вказав, що вони не вважають цю версію якісною і що на цьому етапі вона призначена лише для розробки чи тестування. Як наслідок, цей snap не буде автоматично перечитуватись, і може виконувати довільні зміни системи за межами пісочниці безпеки, якою, як правило, обмежуються snap-пакунки, що робить вашу систему небезпечною. Якщо ви розумієте це і хочете продовжити, повторіть команду разом з параметром --devmode. Якщо замість цього ви хочете встановити snap примусово призначивши йому суворі обмеження, повторіть команду з параметром --jailmode.

source: The refresh command updates the specified snaps, or all snaps in the system if none are specified. With no further options, the snaps are refreshed to the current revision of the channel they're tracking, preserving their confinement options. Revision choice via the --revision override requires the the user to have developer access to the snap, either directly or through the store's collaboration feature, and to be logged in (see 'snap help login'). Note a later refresh will typically undo a revision override.
uk: Команда refresh перечитує (оновлює) названий snap-пакунок або всі snap-пакунки в системі, якщо не зазначено жодного. Якщо не вказано додаткових параметрів, snap-пакунки оновлюються до поточної редакції каналу, що відстежується зі збереженням їх поточних обмежень. Вибір редакції через параметр --revision вимагає від користувача прав розробника на snap-пакунок, або безпосередньо, або через функціональність спільної розробки в магазині, і також він має бути авторизований (див.'snap help login') Зверніть увагу на те, що наступне оновлення, як правило, скасовує вибір іншої редакції.

source: The repair command shows the details about one or multiple repairs.
uk: Команда repair показує подробиці про одне чи декілька відновлень.

source: The repairs command lists all processed repairs for this device.
uk: Команда repairs показує всі виконані відновлення для цього пристрою.

source: The restart command restarts the given services of the snap. If executed from the "configure" hook, the services will be restarted after the hook finishes.
uk: Команда restart виконує перезапуск пропонованих у snap-пакунку служб. Якщо виконання здійснюється з обробки "configure", служби будуть запущені після її завершення.

source: The restart command restarts the given services. If the --reload option is given, for each service whose app has a reload command, a reload is performed instead of a restart.
uk: Команда restart виконує перезапуск наданих служб. Якщо додано параметр --reload, для кожної служби, додаток якої має команду reload, замість перезапуску виконується перезавантаження.

source: The revert command reverts the given snap to its state before the latest refresh. This will reactivate the previous snap revision, and will use the original data that was associated with that revision, discarding any data changes that were done by the latest revision. As an exception, data which the snap explicitly chooses to share across revisions is not touched by the revert process.
uk: Команда revert повертає даний snap до стан перед останнім перечитуванням. Цим повторно активується попередня редакція snap-пакунку, і будуть використовуватись оригінальні дані, що пов'язані з цією редакцією, а всі зміни останньої редакції будуть скасовані. Як виняток, дані, які snap явно вибирає для обміну між редакціями не будуть зачеплені процесом повернення.

source: The run command executes the given snap command with the right confinement and environment.
uk: Команда run виконує вказану команду snap-пакунку з належним обмеженням та середовищем.

source: The sandbox command prints tags describing features of individual sandbox components used by snapd on a given system.
uk: Команда sandbox виводить теги, що описують можливості окремих компонентів пісочниць, що використовує snapd на вказаній системі.

source: The services command lists information about the services specified, or about the services in all currently installed snaps.
uk: Команда services виводить список з даними про зазначені служби, або про служби в наразі встановлених snap-пакунках.

source: The set command changes the provided configuration options as requested. $ snap set snap-name username=frank password=$PASSWORD All configuration changes are persisted at once, and only after the snap's configuration hook returns successfully. Nested values may be modified via a dotted path: $ snap set author.name=frank
uk: Команда set змінює надані параметри конфігурації згідно запиту. $ snapctl set username=frank password=$PASSWORD Всі зміни конфігурації записуються одночасно, і тільки після обробки конфігурування для snap-пакунку повертається код успішного завершення. Звернення до вкладених значень здійснюється через точку: $ snapctl set author.name=frank

source: The set command changes the provided configuration options as requested. $ snapctl set username=frank password=$PASSWORD All configuration changes are persisted at once, and only after the hook returns successfully. Nested values may be modified via a dotted path: $ snapctl set author.name=frank Plug and slot attributes may be set in the respective prepare and connect hooks by naming the respective plug or slot: $ snapctl set :myplug path=/dev/ttyS0
uk: Команда set змінює надані параметри конфігурації згідно запиту. $ snapctl set username=frank password=$PASSWORD Всі зміни конфігурації записуються одночасно, і тільки після обробки повертається код успішного завершення. Звернення до вкладених значень здійснюється через точку: $ snapctl set author.name=frank Атрибути вилки та гнізда можуть бути задані у відповідних обробках підготовки та з'єднання шляхом зазначення назви відповдних вилок та гнізд: $ snapctl set :myplug path=/dev/ttyS0

source: The sign command signs an assertion using the specified key, using the input for headers from a JSON mapping provided through stdin. The body of the assertion can be specified through a "body" pseudo-header.
uk: Команда sign command signs an assertion using the specified key, using the input for headers from a JSON mapping provided through stdin. The body of the assertion can be specified through a "body" pseudo-header. Команда sign підписує перевірку за допомогою вказаного ключа, використовуючи введення для заголовків з JSON-відповідностей, наданих через стандартне введення. Тіло перевірки можна вказати через псевдо-заголовок "тіла".

source: The sign-build command creates a snap-build assertion for the provided snap file.
uk: Команда sign-build створює snap-build перевірку для наданого snap-файлу.

source: The start command starts the given services of the snap. If executed from the "configure" hook, the services will be started after the hook finishes.
uk: Команда start виконує запуск пропонованих у snap-пакунку служб. Якщо виконання здійснюється з обробки "configure", служби будуть запущені після її завершення.

source: The start command starts, and optionally enables, the given services.
uk: Команда start запускає і опціонально вмикає надані служби.

source: The stop command stops the given services of the snap. If executed from the "configure" hook, the services will be stopped after the hook finishes.
uk: Команда stop зупиняє роботу пропонованих у snap-пакунку служб. Якщо виконання здійснюється з обробки "configure", служби будуть зупинені після її завершення.

source: The stop command stops, and optionally disables, the given services.
uk: Команда stop зупиняє та опціонально вимикає вказані служби.

source: The switch command switches the given snap to a different channel without doing a refresh.
uk: Команда switch перемикає даний snap-пакунок на інший канал без виконання перечитування.

source: The tasks command displays a summary of tasks associated with an individual change.
uk: Команда tasks виводить зведення завдань, пов'язаних з конкретними змінами.

source: The try command installs an unpacked snap into the system for testing purposes. The unpacked snap content continues to be used even after installation, so non-metadata changes there go live instantly. Metadata changes such as those performed in snap.yaml will require reinstallation to go live. If snap-dir argument is omitted, the try command will attempt to infer it if either snapcraft.yaml file and prime directory or meta/snap.yaml file can be found relative to current working directory.
uk: Команда try встановлює в систему розпакований snap з метою тестування. Нерозпакований snap продовжує використовуватися навіть після установки, тому зміни в неметаданих відбуваються миттєво. Зміни метаданих, такі як ті, що виконуються в snap.yaml, вимагатимуть повторного встановлення для переходу в робочий режим. Якщо аргумент snap-dir опущений, команда try намагатиметься створити його, якщо можна знайти відносно поточного робочого каталогу файл snapcraft.yaml і головний каталог або файл meta/snap.yaml.

source: The unalias command removes a single alias if the provided argument is a manual alias, or disables all aliases of a snap, including manual ones, if the argument is a snap name.
uk: Команда unalias викреслює окремий синонім, якщо вказаний аргумент є ручним синонімом, або вимикає всі синоніми для snap-пакунку, в тому числі і ручні синоніми, якщо аргумент є назвою snap-пакунку.

source: The userd command starts the snap user session service.
uk: Команда userd запускає службу сеансу користувача snap.

source: The version command displays the versions of the running client, server, and operating system.
uk: Команда version відображає версії запущеного клієнта, сервера, і операційну систему.

source: The watch command waits for the given change-id to finish and shows progress (if available).
uk: Команда watch чекає завершення змінюваного ідентифікатора і показує поступ (за наявності).

source: This revision of snap %q was published using classic confinement and thus may perform arbitrary system changes outside of the security sandbox that snaps are usually confined to, which may put your system at risk. If you understand and want to proceed repeat the command including --classic.
uk: Ця версія snap-пакунку %q була опублікована з використанням класичного обмеження і отже існує можливість виконати довільні зміни системи поза ізольованою пісочницею безпеки, якою зазвичай обмежені snap, і це робить вашу систему небезпечною. Якщо ви розумієте це і хочете продовжити, повторіть команду разом з параметром --classic.

source: Use 'snap help alias' to learn how to create aliases manually.
uk: Використовуйте 'snap help alias' щоб дізнатися про ручне створення синонімів.

source: a single snap name is needed to specify mode or channel flags
uk: для зазначення режиму або прапорів каналу потрібне одне ім'я snap-пакунку

source: a single snap name is needed to specify the revision
uk: для зазначення редакції потрібне одне ім'я snap-пакунку

source: a single snap name must be specified when ignoring validation
uk: при ігнорування перевірки необхідно зазначити одне ім'я snap-пакунку

source: active
uk: активний

source: attribute %q cannot be overwritten
uk: атрибут %q не може бути перезаписаний

source: auto-refresh: all snaps are up-to-date
uk: автооновлення: усі snap-пакунки останньої версії

source: bought
uk: придбаний

source: broken
uk: пошкоджений

source: cannot %s without a context
uk: неможливо %s без контексту

source: cannot buy snap: %v
uk: неможливо придбати snap-пакунок: %v

source: cannot buy snap: invalid characters in name
uk: неможливо придбати snap-пакунок: неприпустимі символи в назві

source: cannot buy snap: it has already been bought
uk: неможливо придбати snap-пакунок: він вже придбаний

source: cannot create %q: %v
uk: неможливо створити %q: %v

source: cannot create assertions file: %v
uk: неможливо створити файл перевірок: %v

source: cannot extract the snap-name from local file %q: %v
uk: неможливо видобути назву snap-пакунку з локального файлу %q: %v

source: cannot find app %q in %q
uk: неможливо знайти програму %q в %q

source: cannot find hook %q in %q
uk: неможливо знайти обробник %q в %q

source: cannot get data for %q: %v
uk: неможливо отримати дані для %q: %v

source: cannot get full path for %q: %v
uk: неможливо отримати повний шлях для %q: %v

source: cannot get the current user: %s
uk: неможливо отримати поточного користувача: %s

source: cannot get the current user: %v
uk: неможливо отримати поточного користувача: %v

source: cannot mark boot successful: %s
uk: неможливо позначити завантаження як успішне: %s

source: cannot open the assertions database: %v
uk: неможливо відкрити базу даних перевірок: %v

source: cannot read assertion input: %v
uk: неможливо прочитати введення перевірки: %v

source: cannot read symlink: %v
uk: неможливо прочитати символічне посилання: %v

source: cannot resolve snap app %q: %v
uk: неможливо розпізнати програму snap %q: %v

source: cannot set attribute: %v
uk: неможливо встановити атрибут: %v

source: cannot sign assertion: %v
uk: неможливо підписати перевірку: %v

source: cannot specify both channel and revision
uk: неможливо зазначати одночасно канал та редакцію

source: cannot update the 'current' symlink of %q: %v
uk: неможливо оновити «поточне» символьне посилання для %q: %v

source: cannot use %q key: %v
uk: неможливо використати ключ %q: %v

source: cannot use change ID and type together
uk: неможливо використовувати змінюваний ідентифікатор та тип одночасно

source: cannot use devmode and jailmode flags together
uk: неможливо використовувати разом прапори devmode та jailmode

source: cannot use explicit name when installing from store
uk: неможливо використовувати явне ім'я під час встановлення з магазину

source: cannot use instance name when installing multiple snaps
uk: неможливо використовувати ім'я екземпляра під час встановлення декількох snap-пакунків

source: cannot validate owner of file %s
uk: неможливо перевірити власника файлу %s

source: cannot write new Xauthority file at %s: %s
uk: неможливо записати файл Xauthority в %s: %s

source: change finished in status %q with no error message
uk: зміна завершена зі станом %q без повідомлення про помилку

source: classic confinement requires snaps under /snap or symlink from /snap to %s
uk: класичне обмеження вимагає snap-пакунків у /snap або символьне посилання з /snap на %s

source: created user %q
uk: створено користувача %q

source: d
uk: д

source: disabled
uk: вимкнено

source: email:
uk: електронна адреса:

source: enabled
uk: увімкнено

source: error: %v
uk: помилка: %v

source: error: the `<snap-dir>` argument was not provided and couldn't be inferred
uk: помилка: аргумент `<snap-dir>` не надано і створити його неможливо.

source: get which option?
uk: який параметр отримати?

source: h
uk: г

source: ignore-validation
uk: ігнорувати-перевірку

source: inactive
uk: неактивне

source: interface attributes can only be read during the execution of interface hooks
uk: Атрибути інтерфейсу можна прочитати лише під час виконання обробок інтерфейсу

source: interface attributes can only be set during the execution of prepare hooks
uk: Атрибути інтерфейсу можна встановити лише під час виконання обробок підготовки

source: internal error, please report: running %q failed: %v
uk: внутрішня помилка, прохання повідомити: збій виконання %q: %v

source: internal error: cannot find attrs task
uk: внутрішня помилка: неможливо знайти завдання атрибутів

source: internal error: cannot find plug or slot data in the appropriate task
uk: внутрішня помилка: неможливо знайти дані вилки чи гнізда у відповідній задачі

source: internal error: cannot get %s from appropriate task
uk: внутрішня помилка: неможливо отримати %s з відповідного завдання

source: internal error: cannot get %s from appropriate task, %s
uk: внутрішня помилка: неможливо отримати %s з відповідної задачі, %s

source: invalid argument for flag ‘-n’: expected a non-negative integer argument, or “all”.
uk: неприпустимий аргумент для прапорця «-n», очікується позитивний або нульовий цілочисельний аргумент, або «all».

source: invalid configuration: %q (want key=value)
uk: неприпустима конфігурація: %q (потрібно key=value)

source: invalid header filter: %q (want key=value)
uk: неприпустимий фільтр заголовку: %q (потрібно key=value)

source: invalid parameter: %q (want key=value)
uk: неприпустимий параметр: %q (має бути key=value)

source: invalid value: %q (want snap:name or snap)
uk: неприпустиме значення: %q (має бути snap:name або snap)

source: key name %q is not valid; only ASCII letters, digits, and hyphens are allowed
uk: неприпустима назва ключа %q; дозволені лише літери ASCII, цифри та дефіси

source: local snap %q is unknown to the store, use --amend to proceed anyway
uk: локальний snap %q невідомий магазину, використовуйте --amend для продовження незважаючи не все

source: m
uk: хв

source: missing snap-confine: try updating your core/snapd package
uk: відсутній snap-confine: спробуйте оновити пакунок core/snapd

source: need the application to run as argument
uk: потрібно, щоб програма запускалася як аргумент

source: no changes found
uk: жодних змін не знайдено

source: no changes of type %q found
uk: жодних змін для типу %q не знайдено

source: no interfaces currently connected
uk: наразі не приєднано жодного інтерфейсу

source: no interfaces found
uk: жодного інтерфейсу не знайдено

source: no matching snaps installed
uk: жодного відповідного snap-пакунку не встановлено

source: no such interface
uk: такий інтерфейс відсутній

source: no valid snaps given
uk: жодного припустимого snap-пакунку не надано

source: please provide change ID or type with --last=<type>
uk: будь ласка, надайте змінюваний ідентифікатор або тип з параметром --last=<тип>

source: private
uk: приватний

source: reboot scheduled to update the system
uk: заплановане перезавантаження для оновлення системи

source: repairs are not available on a classic system
uk: в класичній системі відновлення недоступні

source: requested a non-existing branch for snap %q: %s
uk: запитано неіснуючу гілку для snap %q: %s

source: requested a non-existing branch on %s for snap %q: %s
uk: запитано неіснуючу гілку на %s для snap %q: %s

source: requested channel %q is not valid (see 'snap info %s' for valid ones)
uk: запитаний канал %q не є дійсним (див. 'snap info %s' для дійсних каналів)

source: s
uk: с

source: set failed: %v
uk: встановлення завершилося невдачею: %v

source: set which option?
uk: який параметр задати?

source: snap %[1]q not available as specified (see 'snap info %[1]s')
uk: snap %[1]q недоступний як зазначено (див. 'snap info %[1]s')

source: snap %[1]q not available on channel %q (see 'snap info %[1]s')
uk: snap %[1]q недоступний на каналі %q (див. 'snap info %[1]s')

source: snap %[1]q revision %s not available (see 'snap info %[1]s')
uk: snap %[1]q редакція %s недоступна (див. 'snap info %[1]s')

source: snap %q has no updates available
uk: snap-пакунок %q не має оновлень

source: snap %q is already installed, see 'snap help refresh'
uk: snap %q вже встановлений, див 'snap help refresh'

source: snap %q is not available on %s but is available to install on the following tracks:
uk: snap %q недоступний на %s, але доступний для встановлення на таких стежках:

source: snap %q is not available on %s but other tracks exist.
uk: snap %q недоступний на %s, але існує інша стежка.

source: snap %q is not available on %v but is available to install on the following channels:
uk: snap %q недоступний на %v, але доступний для встановлення на таких каналах:

source: snap %q is not available on %v for this architecture (%s) but exists on other architectures (%s).
uk: snap %q недоступний на %v для цієї архітектури (%s), але існує на інших архітектурах (%s).

source: snap %q is not available on this architecture (%s) but exists on other architectures (%s).
uk: snap %q недоступний на цій архітектурі (%s), але існує на інших архітектурах (%s).

source: snap %q not found
uk: snap-пакунок %q не знайдений

source: snap is free
uk: snap-пакунок безкоштовний

source: snapd is about to reboot the system
uk: snapd збирається перезавантажити систему

source: today at 15:04 MST
uk: сьогодні о 15:04 MST

source: tomorrow at 15:04 MST
uk: завтра о 15:04 MST

source: too many arguments for command
uk: забагато аргументів для команди

source: too many arguments for hook %q: %s
uk: забагато аргументів для пастки %q: %s

source: too many arguments: %s
uk: забагато аргументів: %s

source: unable to contact snap store
uk: неможливо з'єднатися зі snap-магазином

source: unavailable
uk: недоступно

source: unknown plug or slot %q
uk: невідомі вилка чи гніздо %q

source: unknown service: %q
uk: невідома служба: %q

source: warning: no snap found for %q
uk: увага: не знайдено snap для %q

source: y
uk: р

source: yesterday at 15:04 MST
uk: учора о15:04 MST

source: Authenticate on snap daemon
uk: Автентифікація демона snap

source: Authorization is required to authenticate on the snap daemon
uk: Для автентифікація демона snap необхідна авторизація

source: Install, update, or remove packages
uk: Встановлення, оновлення та видалення пакунків

source: Authentication is required to install, update, or remove packages
uk: Для встановлення, оновлення та видалення пакунків необхідна автентифікація

source: Connect, disconnect interfaces
uk: Приєднання, від'єднання інтерфейсів

source: Authentication is required to connect or disconnect interfaces
uk: Для приєднання чи від'єднання інтерфейсів необхідна автентифікація
