Repository: PlagaMedicum/Ubuntu-Translation-Demo
Catalog: rosetta-eoan/*/LC_MESSAGES/snappy.po
Languages: uk

source: %q does not contain an unpacked snap. Try 'snapcraft prime' in your project directory, then 'snap try' again.
uk: %q не містить розпакований snap. Спробуйте 'snapcraft prime' у каталозі проекту, а потім знову 'snap try'.

source: %q switched to the %q channel
uk: %q перемкнувся на канал %q

source: %s %s mounted from %s
uk: %s %s змонтовано з %s

source: %s (delta)
uk: %s (дельта)

source: %s (see 'snap help login')
uk: %s (див. 'snap help login')

source: %s (try with sudo)
uk: %s (спробуйте з sudo)

source: %s already installed
uk: %s вже встановлено

source: %s disabled
uk: %s вимкнено

source: %s enabled
uk: %s увімкнено

source: %s not installed
uk: %s не встановлено

source: %s removed
uk: %s вилучено

source: %s reverted to %s
uk: %s повернуто до %s

source: %s%s %s from %s installed
uk: %s%s %s від %s встановлено

source: %s%s %s from %s refreshed
uk: %s%s %s від %s оновлено

source: %s%s %s installed
uk: %s%s %s встановлено

source: %s%s %s refreshed
uk: %s%s %s оновлено

source: 'snap changes' command expects a snap name, try 'snap tasks %s'
uk: команда 'snap changes' очікує назву snap-пакунку, спробуйте 'snap tasks %s'

source: -r can only be used with --hook
uk: -r може бути використано лише з --hook

source: <alias-or-snap>
uk: <синонім-або-snap>

source: <alias>
uk: <синонім>

source: <assertion file>
uk: <файл перевірки>

source: <assertion type>
uk: <тип перевірки>

source: <change-id>
uk: <змінити-id>

source: <conf value>
uk: <значення конф>

source: <email>
uk: <пошта>

source: <filename>
uk: <назва файлу>

source: <header filter>
uk: <фільтр заголовку>

source: <interface>
uk: <інтерфейс>

source: <key-name>
uk: <назва-ключа>

source: <key>
uk: <ключ>

source: <model-assertion>
uk: <модель-перевірки>

source: <query>
uk: <запит>

source: <root-dir>
uk: <корен-кат>

source: <service>
uk: <служба>

source: <snap>:<plug>
uk: <snap>:<вилка>

source: <snap>:<slot or plug>
uk: <snap>:<гніздо або вилка>

source: A service specification, which can be just a snap name (for all services in the snap), or <snap>.<app> for a single service.
uk: Специфікація служби, яка може бути назвою snap-пакунку (для всіх служб у snap-пакунку), або <snap>.<app> для однієї служби.

source: Abort a pending change
uk: Перервати очікувану зміну

source: Add an assertion to the system
uk: Додати перевірку до системи

source: Added
uk: Додано

source: Advise on available snaps
uk: Порада про доступні snap-пакунки

source: Advise on snaps that provide the given command
uk: Порада про snap-пакунки, що надає вказана команда

source: Advise will talk to apt via an apt hook
uk: Порада звертається до apt через переривання apt

source: Alias for --dangerous (DEPRECATED)
uk: Синонім --dangerous (ЗАСТАРІЛО)

source: All snaps up to date.
uk: Всі snap-пакунки актуальні.

source: Allow opening file?
uk: Дозволити відкриття файлу?

source: Allow refresh attempt on snap unknown to the store
uk: Дозволяти спробу перечитати snap-пакунок, невідомий магазину

source: Allow settings change?
uk: Дозволити зміну налаштувань?

source: Allow snap %q to change %q to %q ?
uk: Дозволити snap %q змінити %q на %q ?

source: Allow snap %q to open file %q?
uk: Дозволити snap %q відкрити файл %q?

source: Alternative command to run
uk: Альтернативна команда для запуску

source: Always return document, even with single key
uk: Завжди повертати документ, навіть з одним ключем

source: Always return list, even with single key
uk: Завжди повертати список, навіть з одним ключем

source: An email of a user on login.ubuntu.com
uk: Електронна пошта користувача на login.ubuntu.com

source: As well as starting the service now, arrange for it to be started on boot.
uk: Так само, як запустити службу зараз, організовуйте її запуск при завантаженні.

source: As well as stopping the service now, arrange for it to no longer be started on boot.
uk: Так само, як зупинити службу зараз, організовуйте її незапуск при завантаженні.

source: Assertion file
uk: Файл перевірки

source: Assertion type name
uk: Назва типу перевірки

source: Authenticate to snapd and the store
uk: Автентифікуватися у snapd та магазині

source: Auto-refresh %d snaps
uk: Автоматично перечитати %d snap-пакунки

source: Auto-refresh snap %q
uk: Автоматично перечитати snap-пакунок %q

source: Auto-refresh snaps %s
uk: Автоматично перечитати snap-пакунки %s

source: Automatically connect eligible plugs and slots of snap %q
uk: Автоматично підключати прийнятні вилки та гнізда snap-пакунку %q

source: Autostart user applications
uk: Автозапуск програм користувачв

source: Bad code. Try again:
uk: Поганий код. Спробуйте ще раз:

source: Buy a snap
uk: Придбати snap-пакунок

source: Change ID
uk: Змінюваний ідентифікатор

source: Change configuration options
uk: Змінити параметри конфігурації

source: Changes configuration options
uk: Зміна параметрів конфігурації

source: Channel %s for %s is closed; temporarily forwarding to %s.
uk: Канал %s для %s закритий. Тимчасово переспрямовуємо на %s.

source: Command %q not found, but can be installed with:
uk: Команду %q не знайдено, але може бути встановлено з:

source: Command %q not found, did you mean:
uk: Команду %q не знайдено, ви мали на увазі:

source: Command Alias Notes
uk: Команда Синонім Примітки

source: Configuration value (key=value)
uk: Значення конфігурації (ключ=значення)

source: Confirm passphrase:
uk: Підтвердити пароль:

source: Connect %s:%s to %s:%s
uk: Приєднати %s:%s до %s:%s

source: Connect a plug to a slot
uk: Приєднати вилку до гнізда

source: Constrain listing to a specific snap or snap:name
uk: Обмежити список зазначеним snap-пакунком або snap:назва

source: Constrain listing to specific interfaces
uk: Обмежити список зазначеними інтерфейсами

source: Constrain listing to those matching header=value
uk: Обмежити список тими, що відповідають заголовок=значення

source: Copy snap %q data
uk: Копіюва дані snap-пакунку %q

source: Create a local system user
uk: Створити локального системного користувача

source: Create a snap-build assertion
uk: Створити перевірку snap-збірки

source: Create cryptographic key pair
uk: Створити пару криптографічного ключа

source: Delete cryptographic key pair
uk: Видалити пару криптографічного ключа

source: Disable %q snap
uk: Вимкнути snap-пакунок %q

source: Disable a snap in the system
uk: Вимкнути snap-пакунок у системі

source: Disable aliases for snap %q
uk: Вимкнути синоніми для snap-пакунку %q

source: Disable all aliases for snap %q
uk: Вимкнути всі синоніми для snap-пакунку %q

source: Disconnect %s:%s from %s:%s
uk: Від'єднати %s:%s від %s:%s

source: Disconnect a plug from a slot
uk: Від'єднати вилку від гнізда

source: Display absolute times (in RFC 3339 format). Otherwise, display relative times up to 60 days, then YYYY-MM-DD.
uk: Відображати абсолютний час (у форматі RFC 3339). Інакше відображати відносний час до 60 днів, потім YYYY-MM-DD.

source: Do not wait for the operation to finish but just print the change id.
uk: Не чекати закінчення операції, тільки вивести змінюваний id.

source: Download snap %q%s from channel %q
uk: Завантажити snap-пакунок %q%s з каналу %q

source: Download the given revision of a snap, to which you must have developer access
uk: Завантажити задану редакцію snap-пакунку, на яку у вас мають бути права розробника

source: Download the given snap
uk: Завантажити даний snap

source: Email address:
uk: Адреса ел. пошти:

source: Enable %q snap
uk: Увімкнути %q snap-пакунок

source: Enable a snap in the system
uk: Увімкнути snap у системі

source: Ensure prerequisites for %q are available
uk: Переконайтеся, що передумови для %q доступні

source: Ensure that given backend:feature is available
uk: Переконайтеся, що вказана backend:feature доступна

source: Export cryptographic public key
uk: Експорт криптографічного відкритого ключа

source: Fetch and check assertions for snap %q%s
uk: Видобути і обстежити перевірку для snap-пакунку %q%s

source: Fetching assertions for %q
uk: Видобування перевірок для %q

source: Fetching snap %q
uk: Отримання snap-пакунку %q

source: Filename of the snap you want to assert a build for
uk: Назва файла snap-пакунка, який ви хочете перевірити для збірки

source: Find packages to install
uk: Знайти пакунки для встановлення

source: Force adding the user, even if the device is already managed
uk: Примусове додавання користувача, навіть якщо пристрій вже під керуванням

source: Force import on classic systems
uk: Примусовий імпорт на класичних системах

source: Format public key material as a request for an account-key for this account-id
uk: Форматувати матеріали відкритого ключа як запит на ключ облікового запису для цього ідентифікатора облікового запису

source: Generate device key
uk: Генерувати ключ пристрою

source: Generate the manpage
uk: Генерувати довідкову сторінку (man)

source: Get more information with 'snap info %s'.
uk: Отримайте більше відомостей з 'snap info %s'.

source: Grade states the build quality of the snap (defaults to 'stable')
uk: Оцінка визначає якість збірки snap-пакунку (за умовчанням - «stable»)

source: Grant sudo access to the created user
uk: Надати доступ до команди sudo створеному користувачеві

source: Hook to run
uk: Пастка для запуску

source: ID Status Spawn Ready Summary
uk: ID Стан Запуск Готово Підсумок

source: Identifier of the signer
uk: Ідентифікатор підписувача

source: Identifier of the snap package associated with the build
uk: Ідентифікатор snap-пакунка, асоційований зі збіркою

source: If the service has a reload command, use it instead of restarting.
uk: Якщо служба має команду reload, використовувати її замість перезапуску

source: Ignore validation by other snaps blocking the refresh
uk: Пропускати перевірку іншими snap-пакунками, що перешкоджають оновленню

source: In order to buy %q, you need to agree to the latest terms and conditions. Please visit https://my.ubuntu.com/payment/edit to do this. Once completed, return here and run 'snap buy %s' again.
uk: Для придбання %q, ви повинні погодитись з останніми умовами надання послуг. З цією метою, будь ласка, відвідайте https://my.ubuntu.com/payment/edit. Після цього поверніться сюди і знову виконайте команду «snap buy %s».

source: Include more details on the snap (expanded notes, base, etc.)
uk: Додати більше подробиць про snap (розширені примітки, базу тощо)

source: Include unused interfaces
uk: Долучити невикористані інтерфейси

source: Initialize device
uk: Ініціалізувати пристрій

source: Inspect devices for actionable information
uk: Перевірити пристрої на доступні для дій відомості

source: Install %q snap
uk: Встановити snap-пакунок %q

source: Install %q snap from %q channel
uk: Встановити snap-пакунок %q з каналу %q

source: Install %q snap from file
uk: Встановити snap-пакунок %q з файлу

source: Install %q snap from file %q
uk: Встановити snap-пакунок %q з файлу %q

source: Install from the beta channel
uk: Встановити з бета-каналу

source: Install from the candidate channel
uk: Встановити з каналу-кандидата

source: Install from the edge channel
uk: Встановити з крайнього каналу

source: Install from the stable channel
uk: Встановити з стабільного каналу

source: Install snap %q
uk: Встановити snap-пакунок %q

source: Install snaps %s
uk: Встановити snap-пакунки %s

source: Install the given revision of a snap, to which you must have developer access
uk: Встановити задану редакцію snap-пакунку, на яку у вас мають бути права розробника

source: Install the given snap file even if there are no pre-acknowledged signatures for it, meaning it was not verified and could be dangerous (--devmode implies this)
uk: Встановити даний snap-пакунок, навіть якщо для нього немає попередньо підтверджених підписів, тобто він не був перевіреним та може бути небезпечним (мається на увазі --devmode)

source: Install the given snap without enabling its automatic aliases
uk: Встановити такий snap-пакунок, не вмикаючи його автоматичні синоніми

source: Install the snap with: snap ack %s snap install %s
uk: Встановити snap за допомогою: snap ack %s snap install %s

source: Key of interest within the configuration
uk: Область зацікавленості в межах конфігурації

source: List a change's tasks
uk: Список завдань змін

source: List aliases in the system
uk: Список синонімів в системи

source: List cryptographic keys
uk: Список криптографічних ключів

source: List installed snaps
uk: Список встановлених snap-пакунків

source: List system changes
uk: Список змін в системі

source: Lists all repairs
uk: Список усіх відновлень

source: Log out of snapd and the store
uk: Здійснити вихід зі snapd та магазину

source: Login successful
uk: Вхід успішний

source: Make current revision for snap %q unavailable
uk: Зробити поточну редакцію для snap-пакунку %q недоступною

source: Make snap %q (%s) available to the system
uk: Зробити snap-пакунок %q (%s) доступним у системі

source: Make snap %q (%s) unavailable to the system
uk: Зробити snap-пакунок %q (%s) недоступним у системі

source: Make snap %q unavailable to the system
uk: Зробити snap-пакунок %q недоступним у системі

source: Make snap %q%s available to the system
uk: Зробити snap-пакунок %q%s доступним у системі

source: Mark system seeded
uk: Позначити, як розповсюджуваний системою

source: Mount snap %q%s
uk: Змонтувати snap %q%s

source: Name of key to create; defaults to 'default'
uk: Назва створюваного ключа, типова назва «default»

source: Name of key to delete
uk: Назва ключа для видалення

source: Name of key to export
uk: Назва ключа для експорту

source: Name of the GnuPG key to use (defaults to 'default' as key name)
uk: Назва ключа GnuPG для використання (типове значення для назви ключа «default»)

source: Name of the key to use, otherwise use the default key
uk: Назва ключа для використання, в іншому випадку використовувати типовий ключ

source: Name SHA3-384
uk: Назва SHA3-384

source: Name Summary
uk: Назва Підсумок

source: Name Version Publisher%s Notes Summary
uk: Назва Версія Видавець%s Примітки Підсумок

source: Name Version Rev Publisher%s Notes
uk: Назва Версія Ред Видавець%s Примітки

source: Name Version Rev Tracking Publisher%s Notes
uk: Назва Версія Ред Відстеження Видавець%s Примітки

source: No aliases are currently defined for snap %q.
uk: Наразі не визначено жодних синонімів для snap %q.

source: No aliases are currently defined.
uk: Наразі не визначено жодних синонімів

source: No apt package %q, but there is a snap with that name.
uk: Пакунок apt %q відсутній, але є snap-пакунок з таким іменем.

source: No connections to disconnect
uk: Немає з'єднань для від'єднання

source: No matching section %q, use --section to list existing sections
uk: Немає відповідного розділу %q, використовуйте --section для переліку наявних розділів

source: No matching snaps for %q in section %q
uk: Немає відповідних snap-пакунків %q у розділі %q

source: No matching snaps for %q
uk: Немає відповідних snap-пакунків для %q

source: No search term specified. Here are some interesting snaps:
uk: Пошукового терміну не зазначено. Ось кільки цікавих snap-пакунків:

source: No section specified. Available sections:
uk: Жодного розділу не зазначено. Доступні розділи:

source: No snaps are installed yet. Try 'snap install hello-world'.
uk: Жодних snap-пакунків не встановлено. Спробуйте 'snap install hello-world'.

source: Only search for snaps in “stable”
uk: Шукати snap-пакунки лише в “stable”

source: Output results in JSON format
uk: Вивести результати у форматі JSON

source: Pack the given directory as a snap
uk: Запакувати даний каталог як snap

source: Packages matching %q:
uk: Пакунки, що відповідають %q:

source: Passphrase:
uk: Парольна фраза:

source: Password of %q:
uk: Пароль для %q:

source: Personal information is handled as per our privacy notice at
uk: Обробка персональних даних здійснюється згідно повідомлення про конфіденційність за адресою

source: Please be mindful pre-release channels may include features not completely tested or implemented.
uk: Будь ласка, пам'ятайте, що канали попередніх версій можуть містити функціональності, які не є повністю перевіреними та реалізованими

source: Please be mindful that different tracks may include different features.
uk: Будь ласка, пам'ятайте, що різні стежки можуть містити різні функціональності.

source: Please re-enter your Ubuntu One password to purchase %q from %q for %s. Press ctrl-c to cancel.
uk: Будь ласка, повторно введіть ваш пароль Ubuntu One пароль для покупки %q з %q для %s. Натисніть ctrl-c для скасування.

source: Please try 'snap find --section=<selected section>'
uk: Спробуйте 'snap find --section=<вибраний розділ>'

source: Prefer aliases for snap %q
uk: Віддавати перевагу синонімам для snap %q

source: Prefer aliases of snap %q
uk: Віддавати перевагу snap-пакунку %q

source: Prepare snap %q (%s)
uk: Підготувати snap-пакунок %q (%s)

source: Prepare snap %q%s
uk: Підготувати snap-пакунок %q%s

source: Print configuration options
uk: Вивести параметри конфігурації

source: Print sandbox features available on the system
uk: Вивести функціональності пісочниці, доступні в системі

source: Print system paths
uk: Вивести системні шляхи

source: Print the confinement mode the system operates in
uk: Вивести режим обмеження, в якому працює система

source: Print the version and exit
uk: Вивести версію та вийти

source: Print whether the system is managed
uk: Вивести дані, чи система керована

source: Prune automatic aliases for snap %q
uk: Очистити автоматичні псевдоніми для snap-пакунку %q

source: Put snap in classic mode and disable security confinement
uk: Перевести snap у класичний режим і вимкнути обмеження безпеки

source: Put snap in development mode and disable security confinement
uk: Перевести snap у режим розробника і вимкнути обмеження безпеки

source: Put snap in enforced confinement mode
uk: Перевести snap у примусовий режим обмеження

source: Query the status of services
uk: Запит на стан послуг

source: Refresh %q snap
uk: Перечитати snap-пакунок %q

source: Refresh %q snap from %q channel
uk: Перечитати snap-пакунок %q з каналу %q

source: Refresh aliases for snap %q
uk: Перечитати синоніми для snap-пакунку %q

source: Refresh all snaps: no updates
uk: Перечитати всі snap-пакунки: немає оновлень

source: Refresh snap %q
uk: Перечитати snap-пакунок %q

source: Refresh snaps %s
uk: Перечитати snap-пакунки %s

source: Refresh snaps %s: no updates
uk: Перечитати snap-пакунки %s: немає оновлень

source: Refresh to the given revision, to which you must have developer access
uk: Перечитати до даної редакції, на яку у вас мають бути права розробника

source: Remove %q snap
uk: Вилучити snap-пакунок %q

source: Remove aliases for snap %q
uk: Вилучити синоніми для snap-пакунку %q

source: Remove data for snap %q (%s)
uk: Вилучити дані для snap-пакунку %q (%s)

source: Remove manual alias %q for snap %q
uk: Вилучити ручний синонім %q для snap-пакунку %q

source: Remove only the given revision
uk: Вилучити лише таку редакцію

source: Remove security profile for snap %q (%s)
uk: Вилучити профіль безпеки для snap-пакунку %q (%s)

source: Remove security profiles of snap %q
uk: Вилучити профілі безпеки для snap-пакунку %q

source: Remove snap %q
uk: Вилучити snap-пакунок %q

source: Remove snap %q (%s) from the system
uk: Вилучити snap-пакунок %q (%s) з системи

source: Remove snaps %s
uk: Вилучити snap-пакунки %s

source: Removed
uk: Вилучено

source: Request device serial
uk: Запит серійного пристрою

source: Restart services
uk: Перезапустити служби

source: Restarted.
uk: Перезапущено.

source: Restrict the search to a given section
uk: Обмежити пошук певним розділом

source: Revert %q snap
uk: Повернути %q snap-пакунок

source: Reverts the given snap to the previous state
uk: Повернення даного snap-пакунку до попереднього стану

source: Run a shell instead of the command (useful for debugging)
uk: Запустити оболонку замість команди (стане в нагоді для зневадження)

source: Run as a timer service with given schedule
uk: Запустити як службу таймера з певним розкладом

source: Run configure hook of %q snap
uk: Виконати обробник налаштування для snap-пакунку %q

source: Run configure hook of %q snap if present
uk: Виконати обробник налаштування для snap-пакунку %q за наявності

source: Run debug commands
uk: Запустити команди зневадження

source: Run hook %s of snap %q
uk: Виконати обробник %s для snap-пакунку %q

source: Run install hook of %q snap if present
uk: Виконати обробник %s для snap-пакунку %q за наявності

source: Run post-refresh hook of %q snap if present
uk: Виконати обробник після перечитування для snap-пакунку %q за наявності

source: Run pre-refresh hook of %q snap if present
uk: Виконати обробник до перечитування для snap-пакунку %q за наявності

source: Run prepare-device hook
uk: Виконати обробник підготовки пристрою

source: Run remove hook of %q snap if present
uk: Виконати обробник вилучення для snap-пакунку %q за наявності

source: Run the command under strace (useful for debugging). Extra strace options can be specified as well here. Pass --raw to strace early snap helpers.
uk: Запустіть команду під strace (стане в нагоді для зневадження). Тут також можна вказати додаткові параметри strace. Додайте --raw для відстеження ранніх допоміжних процедур у snap.

source: Run the command with gdb
uk: Запустити команду з gdb

source: Run the given snap command
uk: Запустити таку snap-команду

source: Search private snaps
uk: Пошук серед приватних snap-пакунків

source: Select last change of given type (install, refresh, remove, try, auto-refresh, etc.). A question mark at the end of the type means to do nothing (instead of returning an error) if no change of the given type is found. Note the question mark could need protecting from the shell.
uk: Виберіть останню зміну даного типу (install, refresh, remove, try, auto-refresh тощо). Знак питання в кінці типу означає нічого не робити (замість повернення помилки), якщо не знайдено жодної зміни даного типу. Зауважте, що знак питання може потребувати захисту від оболонки.

source: Set automatic aliases for snap %q
uk: Задати автоматичні синоніми для snap-пакунку %q

source: Set up a manual alias
uk: Задати ручний синонім

source: Setup alias %q => %q for snap %q
uk: Налаштувати синонім %q => %q для snap-пакунку %q

source: Setup manual alias %q => %q for snap %q
uk: Встановити ручний синонім %q => %q для snap-пакунку %q

source: Setup snap %q (%s) security profiles
uk: Встановити для snap-пакунку %q (%s) профілі безпеки

source: Setup snap %q aliases
uk: Встановити синоніми для snap-пакунку %q

source: Setup snap %q%s security profiles
uk: Встановити профілі безпеки для snap-пакунку %q%s

source: Show all revisions
uk: Показати всі редакції

source: Show auto refresh information but do not perform a refresh
uk: Показувати інформацію про автоматичне перечитування, але не виконувати перечитування

source: Show detailed information about snaps
uk: Показати детальні відомості про snap-пакунки

source: Show details of a specific interface
uk: Показати подробиці для певного інтерфейсу

source: Show help about a command
uk: Показати довідку про команду

source: Show interface attributes
uk: Показати атрибути інтерфейсу

source: Show known assertions of the provided type
uk: Показати відомі перевірки наданого типу

source: Show only the given number of lines, or 'all'.
uk: Показати лише певну кількість рядків або 'all' (усі).

source: Show specific repairs
uk: Показати певні виправлення

source: Show this help message
uk: Показати цю довідку

source: Show version details
uk: Показати докладну версію

source: Sign an assertion
uk: Підписати перевірку

source: Slot Plug
uk: Гніздо Вилка

source: Snap name
uk: Назва snap-пакунку
