Repository: PlagaMedicum/Ubuntu-Translation-Demo
Catalog: rosetta-eoan/*/LC_MESSAGES/snappy.po
Languages: uk

source: Sorry, your payment method has been declined by the issuer. Please review your payment details at https://my.ubuntu.com/payment/edit and try again.
uk: Перепрошуємо, але ваш спосіб оплати не був прийнятий видавцем. Будь ласка, перегляньте деталі платежу на сторінці https://my.ubuntu.com/payment/edit і спробуйте знову.

source: Start services
uk: Запустити служби

source: Start snap %q (%s) services
uk: Запустити служби snap-пакунку %q (%s)

source: Start snap %q%s services
uk: Запустити служби snap-пакунку %q%s

source: Start snap services
uk: Запустити служби snap-пакунку

source: Start the userd service
uk: Запустити службу userd

source: Started.
uk: Запущено.

source: Status Spawn Ready Summary
uk: Стан Створення Готово Підсумок

source: Stop services
uk: Зупинити служби

source: Stop snap %q (%s) services
uk: Зупинити служби snap-пакунку %q (%s)

source: Stop snap %q services
uk: Зупинити служби snap-пакунку %q

source: Stop snap services
uk: Зупинити служби snap-пакунку

source: Stopped.
uk: Зупинено.

source: Strict typing with nulls and quoted strings
uk: Сувора типізація з нулями та цитованими рядками

source: Switch %q snap to %s
uk: Перемкнути snap-пакунок %q на %s

source: Switch snap %q from %s to %s
uk: Перемкнути snap-пакунок %q з %s на %s

source: Switch snap %q to %s
uk: Перемкнути snap-пакунок %q на %s

source: Switches snap to a different channel
uk: Перемикання snap-пакунку на інший канал

source: Temporarily mount device before inspecting
uk: Тимчасово змонтувати пристрій перед перевіркою

source: Thanks for purchasing %q. You may now install it on any of your devices with 'snap install %s'.
uk: Дякуємо за придбання %q. Тепер ви можете встановити його на будь-який з ваших пристроїв з командою «snap install %s».

source: The get command prints configuration and interface connection settings.
uk: Команда get виводить параметри конфігурації та з'єднання інтерфейсу.

source: The login.ubuntu.com email to login as
uk: Електронна адреса на login.ubuntu.com для входу як

source: The model assertion name
uk: Назва моделі перевірки

source: The snap for which configuration will be checked
uk: Snap-пакунок, конфігурація якого буде перевірена

source: The snap to configure (e.g. hello-world)
uk: Snap-пакунок для налаштування (наприклад, hello-world)

source: The snap whose conf is being requested
uk: Snap-пакунок, конфігурація якого буде запитана

source: This dialog will close automatically after 5 minutes of inactivity.
uk: Це діалогове вікно буде автоматично закрите через 5 хвилин неактивності.

source: Toggle snap %q flags
uk: Перемкнути стан прапорів snap-пакунку %q

source: Tool to interact with snaps
uk: Засіб для взаємодії зі snap-пакунками

source: Transition security profiles from %q to %q
uk: Перехід профілів безпеки з %q до %q

source: Transition ubuntu-core to core
uk: Перехід ubuntu-core до core

source: Try %q snap from %s
uk: Спробуйте snap-пакунок %q з %s

source: Try "snap install %s"
uk: Спробуйте «snap install %s»

source: Try: snap install <selected snap>
uk: Спробуйте: snap install <вибраний snap>

source: Two-factor code:
uk: Двофакторний код:

source: Use a little bit of Unicode to improve legibility.
uk: Використовуйте трохи Unicode, щоб поліпшити читаність.

source: Use a little bit of color to highlight some things.
uk: Використовуйте трохи кольорів, щоб виділити деякі речі.

source: Use a specific snap revision when running hook
uk: Використати певну редакцію snap-пакунку при виконанні обробника

source: Use known assertions for user creation
uk: Використовувати відомі перевірки для створення користувача

source: Use the given output format
uk: Використовувати такий формат виведення

source: Use this channel instead of stable
uk: Використовувати цей канал замість стабільного

source: Validate snap-dir metadata only
uk: Перевірити лише метадані snap-dir

source: WARNING: The output of 'snap get' will become a list with columns - use -d or -l to force the output format.
uk: ПОПЕРЕДЖЕННЯ: Виведення 'snap get' стане списком з колонками - використвуйте -d або -l для зміни формату виведення.

source: WARNING: failed to activate logging: %v
uk: ПОПЕРЕДЖЕННЯ: не вдалося активувати журналювання: %v

source: Wait for new lines and print them as they come in.
uk: Чекати на нові рядки і виводити їх у міру надходження

source: Waiting for server to restart
uk: Очікування перезапуску сервера

source: Watch a change in progress
uk: Спостерігати за поступом змін

source: Wrong again. Once more:
uk: Знову неправильно. Ще раз:

source: Xauthority file isn't owned by the current user %s
uk: Файл Xauthority не належить поточному користувачеві %s

source: Yes, yes it does.
uk: Так, це так.

source: You need to be logged in to purchase software. Please run 'snap login' and try again.
uk: Щоб придбати програмне забезпечення необхідно увійти в систему, . Будь ласка, запустіть «snap login» і повторіть спробу.

source: You need to have a payment method associated with your account in order to buy a snap, please visit https://my.ubuntu.com/payment/edit to add one. Once you’ve added your payment details, you just need to run 'snap buy %s' again.
uk: Для придбання snap-пакунку ви маєте налаштувати спосіб оплати у вашому обліковому запису; будь ласка додайте його на сторінці https://my.ubuntu.com/payment/edit. Після налаштування оплати виконайте знову «snap buy %s».

source: Your command included some characters that look like dashes but are not: %+q in some situations you might find that when copying from an online source such as a blog you need to replace “typographic” dashes and quotes with their ASCII equivalent. Dashes in particular are homoglyphs on most terminals and in most fixed-width fonts, so it can be hard to tell.
uk: Ваша команда містила деякі символи, які виглядають як дефіси, але не є ними: %+q в деяких ситуаціях може статися, що під час копіювання з онлайнового джерела на кшталт блогу необхідно замінити «типографічні» тире та лапки на їх еквіваленти в ASCII.Зокрема, тире є омогліфом з дефісом на більшості терміналів і в більшості шрифтів із фіксованою шириною, тому його важко відобразити.

source: Provide a search term for more specific results.
uk: Для більш конкретних результатів введіть пошуковий термін.

source: The abort command attempts to abort a change that still has pending tasks.
uk: Команда abort намагатиметься скасувати зміну, в якій все ще присутні завдання, що очікують на виконання.

source: The ack command tries to add an assertion to the system assertion database. The assertion may also be a newer revision of a pre-existing assertion that it will replace. To succeed the assertion must be valid, its signature verified with a known public key and the assertion consistent with and its prerequisite in the database.
uk: Команда ack намагається додати перевірку до бази даних системних перевірок. Ця перевірка може також бути більш новою редакцією вже створеної перевірки, що її замінить. Для успішної перевірки вона має бути дійсною, її підпис має бути перевірено з відомим відкритим ключем і перевірка узгоджена з її попередніми вимогами у базі даних.

source: The advise-snap command searches for and suggests the installation of snaps. If --command is given, it suggests snaps that provide the given command. Otherwise it suggests snaps with the given name.
uk: Команда advise-snap здійснює пошук і пропонує встановлення snap-пакунків. Якщо додано --command, вона пропонує snap-пакунки для вказаної команди. Інакше, пропонує snap-пакунки з вказаним іменем.

source: The alias command aliases the given snap application to the given alias. Once this manual alias is setup the respective application command can be invoked just using the alias.
uk: Команда alias прив'язує наведену snap-програму до наведеного синоніму. Після налаштування цього ручного синоніма відповідну команду програми можна викликати просто за допомогою цього синоніму.

source: The aliases command lists all aliases available in the system and their status. $ snap aliases <snap> Lists only the aliases defined by the specified snap. An alias noted as undefined means it was explicitly enabled or disabled but is not defined in the current revision of the snap, possibly temporarily (e.g. because of a revert). This can cleared with 'snap alias --reset'.
uk: Команда aliases перелічує всі доступні в системі синоніми та їх стан. $ snap aliases <snap> Перелічує лише синоніми, що визначені вказаним snap-ом. Позначення синоніма як undefined (невизначений) означає, що він був явно увімкнений або вимкнений, але не визначений в поточній редакції snap- пакунку, можливо, тимчасово (наприклад, внаслідок повернення), якщо це не так, то він може бути очищений командою snap alias --reset.

source: The auto-import command searches available mounted devices looking for assertions that are signed by trusted authorities, and potentially performs system changes based on them. If one or more device paths are provided via --mount, these are temporarily mounted to be inspected as well. Even in that case the command will still consider all available mounted devices for inspection. Assertions to be imported must be made available in the auto-import.assert file in the root of the filesystem.
uk: Команда auto-import здійснює пошук доступних приєднаних пристроїв, які шукають перевірки, що підписані довіреними органами, і потенційно виконує системні зміни на основі них. Якщо один або декілька шляхів пристрою надаються через -mount, вони також тимчасово монтуються для огляду. Навіть у такому разі команда все одно буде розглядати всі доступні змонтовані пристрої для огляду. Імпортовані перевірки мають бути доступними в файлі auto-import.assert в корені файлової системи.

source: The buy command buys a snap from the store.
uk: Команда buy купує snap-пакунок в магазині.

source: The changes command displays a summary of system changes performed recently.
uk: Команда changes відображає звіт про останні виконані системні зміни.

source: The confinement command will print the confinement mode (strict, partial or none) the system operates in.
uk: Команда confinement виведе режим обмеження (strict, partial або none) в якому працює система.

source: The connect command connects a plug to a slot. It may be called in the following ways: $ snap connect <snap>:<plug> <snap>:<slot> Connects the provided plug to the given slot. $ snap connect <snap>:<plug> <snap> Connects the specific plug to the only slot in the provided snap that matches the connected interface. If more than one potential slot exists, the command fails. $ snap connect <snap>:<plug> Connects the provided plug to the slot in the core snap with a name matching the plug name.
uk: Команда connect приєднує вилку до гнізда. Вона може бути викликана у наступні способи: $ snap connect <snap>:<вилка> <snap>:<гніздо> З'єднує надану вилку з даним гніздом. $ snap connect <snap>:<вилка> <snap> З'єднує певну вилку лише з гніздом у наданому snap-і, що відповідає приєднаному інтерфейсу. Якщо існує декілька потенційних гнізд, команда завершується помилкою. $ snap connect <snap>:<вилка> З'єднує надану вилку з гніздом у snap ядра з назвою, що відповідає назві вилки.

source: The create-key command creates a cryptographic key pair that can be used for signing assertions.
uk: Команда create-key створює пару криптографічних ключів, що може бути використання для підписування перевірок.

source: The create-user command creates a local system user with the username and SSH keys registered on the store account identified by the provided email address. An account can be setup at https://login.ubuntu.com.
uk: Команда create-user створює локального користувача системи з іменем користувача та ключам SSH, зареєстрованими в обліковому записі магазину через надану електронну адресу. Обліковий запис може бути налаштований на https://login.ubuntu.com.

source: The debug command contains a selection of additional sub-commands. Debug commands can be removed without notice and may not work on non-development systems.
uk: Команда debug містить вибір додаткових підкоманд. Команди для зневадження можуть бути вилучені без попередження, і вони можуть не працювати стабільних версіях.

source: The delete-key command deletes the local cryptographic key pair with the given name.
uk: Команда delete-key видаляє локальну пару криптографічних ключів з вказаним іменем.

source: The disable command disables a snap. The binaries and services of the snap will no longer be available, but all the data is still available and the snap can easily be enabled again.
uk: Команда disable вимикає snap. Двійкові файли та служби snap-пакунку стануть недоступними. Але всі дані залишаться доступними і snap-пакунок можна знову легко ввімкнути.

source: The disconnect command disconnects a plug from a slot. It may be called in the following ways: $ snap disconnect <snap>:<plug> <snap>:<slot> Disconnects the specific plug from the specific slot. $ snap disconnect <snap>:<slot or plug> Disconnects everything from the provided plug or slot. The snap name may be omitted for the core snap.
uk: Команда disconnect від'єднує вилку від гнізда. Вона може бути викликана у наступні способи: $ snap disconnect <snap>:<вилка> <snap>:<гніздо> Від'єднує певну вилку від певного гнізда. $ snap disconnect <snap>:<гніздо чи вилка> Від'єднує все з наданої вилки чи гнізда. Назва snap може бути відсутня, якщо це snap ядра.

source: The download command downloads the given snap and its supporting assertions to the current directory with .snap and .assert file extensions, respectively.
uk: Команда download завантажує даний snap-пакунок та її супровідні перевірки до поточного каталогу під розширеннями файлів .snap та .assert, відповідно.

source: The enable command enables a snap that was previously disabled.
uk: Команда enable вмикає snap, що раніше був вимкнений.

source: The export-key command exports a public key assertion body that may be imported by other systems.
uk: Команда export-key експортує відкриту частину ключа перевірки, котра може бути імпортована іншими системами.

source: The find command queries the store for available packages in the stable channel. With the --private flag, which requires the user to be logged-in to the store (see 'snap help login'), it instead searches for private snaps that the user has developer access to, either directly or through the store's collaboration feature. A green check mark (given color and unicode support) after a publisher name indicates that the publisher has been verified.
uk: Команда find здійснює запит в магазин щодо наявності доступних пакунків в стабільному каналі. З прапором --private, що вимагає від користувача бути авторизованим в магазині (див.'snap help login'), команда натомість здійснює пошук приватних snap-пакунків того користувача, що має права розробника на snap-пакунок, або безпосередньо, або через функціональність спільної розробки в магазині. Зелена позначка (увімкнений колір та підтримка unicode) після імені видавця означає, що видавець був перевірений.

source: The get command prints configuration options for the current snap. $ snapctl get username frank If multiple option names are provided, a document is returned: $ snapctl get username password { "username": "frank", "password": "..." } Nested values may be retrieved via a dotted path: $ snapctl get author.name frank Values of interface connection settings may be printed with: $ snapctl get :myplug usb-vendor $ snapctl get :myslot path This will return the named setting from the local interface endpoint, whether a plug or a slot. Returning the setting from the connected snap's endpoint is also possible by explicitly requesting that via the --plug and --slot command line options: $ snapctl get :myplug --slot usb-vendor This requests the "usb-vendor" setting from the slot that is connected to "myplug".
uk: Команда get виводить параметри конфігурації для поточного snap-пакунку. $ snapctl get username frank Якщо надано кілька назв параметрів, відповідь буде у вигляді документу: $ snapctl get username password { "username": "frank", "password": "..." } Звернення до вкладених значень здійснюється через точку: $ snapctl get author.name frank Значення параметрів для інтерфейсних з'єднань може бути виведене через: $ snapctl get :myplug usb-vendor $ snapctl get :myslot path Це виведе назване налаштування з кінцевої точки локального інтерфейсу, будь то вилка або гніздо. Також можливе повернення параметра з кінцевої точки приєднаного snap, якщо явно зробити запит до них за допомогою параметрів командного рядка -plug and -slot: $ snapctl get :myplug --slot usb-vendor Тут здійснюється запит до параметру «usb-vendor» з гнізда, що приєднаний до «myplug».

source: The get command prints configuration options for the provided snap. $ snap get snap-name username frank If multiple option names are provided, a document is returned: $ snap get snap-name username password { "username": "frank", "password": "..." } Nested values may be retrieved via a dotted path: $ snap get snap-name author.name frank
uk: Команда get виводить параметри конфігурації для поточного snap-пакунку. $ snapctl get username frank Якщо надано кілька назв параметрів, відповідь буде у вигляді документу: $ snapctl get username password { "username": "frank", "password": "..." } Звернення до вкладених значень здійснюється через точку: $ snapctl get author.name frank

source: The help command displays information about snap commands.
uk: Команда help показує інформацію про команди snap.

source: The info command shows detailed information about snaps. The snaps can be specified by name or by path; names are looked for both in the store and in the installed snaps; paths can refer to a .snap file, or to a directory that contains an unpacked snap suitable for 'snap try' (an example of this would be the 'prime' directory snapcraft produces).
uk: Команда info показує детальну інформацію про snap-пакети. Конкретні snap-пакети можуть бути зазначені за іменем або за шляхом; пошук імен здійснюється в магазині і серед встановлених пакетів; шляхи можуть вказувати на файл snap або на каталог, що містить розпакований snap, що підходить для 'snap try' (прикладом цього може бути каталог 'prime', що створює snapcraft).

source: The interface command shows details of snap interfaces. If no interface name is provided, a list of interface names with at least one connection is shown, or a list of all interfaces if --all is provided.
uk: Команда interface показує подробиці інтерфейсів у snap. Якщо не надано назви інтерфейсу, то відображається список назв інтерфейсів принаймні для одного з'єднання, або список усіх інтерфейсів, якщо введено --all .

source: The interfaces command lists interfaces available in the system. By default all slots and plugs, used and offered by all snaps, are displayed. $ snap interfaces <snap>:<slot or plug> Lists only the specified slot or plug. $ snap interfaces <snap> Lists the slots offered and plugs used by the specified snap. $ snap interfaces -i=<interface> [<snap>] Filters the complete output so only plugs and/or slots matching the provided details are listed.
uk: Команда interfaces виводить список всіх доступних у системі інтерфейсів. Типово відображаються усі гнізда і вилки, використовувані чи пропоновані всіма snap-пакунками. $ snap interfaces <snap>:<гніздо або вилка> Перелічує лише зазначені гніздо або вилку. $ snap interfaces <snap> Перелічує усі гнізда, що пропоновані, та вилки, що використовувані зазначеним snap-пакунком. $ snap interfaces -i=<інтерфейс> [<snap>] Фільтр повного виведення обмежений лише вилками та/або гніздами, що відповідають наданим подробицям.

source: The keys command lists cryptographic keys that can be used for signing assertions.
uk: Команда keys виводить список криптографінчих ключів, що можуть бути використані для підписування перевірок.

source: The known command shows known assertions of the provided type. If header=value pairs are provided after the assertion type, the assertions shown must also have the specified headers matching the provided values.
uk: Команда known показує відомі перевірки наданого типу. Якщо пари заголовок = значення надаються після типу перевірки, ці показані перевірки також повинні мати вказані заголовки, що відповідають заданим значенням.

source: The list command displays a summary of snaps installed in the current system. A green check mark (given color and unicode support) after a publisher name indicates that the publisher has been verified.
uk: Команда list виводить список snap-пакунків, встановлених в поточній системі. Зелена позначка (увімкнений колір та підтримка unicode) після імені видавця означає, що видавець був перевірений.

source: The login command authenticates the user to snapd and the snap store, and saves credentials into the ~/.snap/auth.json file. Further communication with snapd will then be made using those credentials. It's not necessary to log in to interact with snapd. Doing so, however, enables purchasing of snaps using 'snap buy', as well as some some developer-oriented features as detailed in the help for the find, install and refresh commands. An account can be set up at https://login.ubuntu.com
uk: Команда login здійснює автентифікацію в snapd та в магазині snap, та зберігає облікові дані в файл ~/.snap/auth.json. Подальший обмін даними з snapd здійснюється через ці облікові дані. Для взаємодії зі snapd немає потреби здійснювати вхід. Однак, якщо це виконано, то з'являється можливість купувати snap-пакунки за допомогою 'snap buy', а також мати доступ до функцій розробника, про що більш докладно написано в довідці для команд find, install та refresh. Обліковий запис можна налаштувати за адресою https://login.ubuntu.com.

source: The logout command logs the current user out of snapd and the store.
uk: Команад logout здійснює вихід поточного користувача з snapd та магазину.

source: The logs command fetches logs of the given services and displays them in chronological order.
uk: Команда logs завантажує журнали наданих служб і відображає їх у хронологічному порядку.

source: The managed command will print true or false informing whether snapd has registered users.
uk: Команда managed буде виводити true або false, в залежності від того, чи має snapd зареєстрованих користувачів.

source: The paths command prints the list of paths detected and used by snapd.
uk: Команда paths видруковує список шляхів, які виявляються за допомогою snapd та використовуються ним.

source: The prefer command enables all aliases of the given snap in preference to conflicting aliases of other snaps whose aliases will be disabled (or removed, for manual ones).
uk: Команда prefer вмикає всі синоніми заданого snap-пакунку, що будуть перевизначати всі суперечливі синоніми з інших snap-пакунків, синоніми яких будуть вимкнені (або вилучені, якщо додані вручну).
