Repository: PlagaMedicum/Ubuntu-Translation-Demo
Catalog: rosetta-eoan/*/LC_MESSAGES/system-service.po
Languages: be

source: Get current global proxy
be: Атрымаць бягучы глабальны проксi

source: System policy prevents querying proxy settings
be: Сістэмная палітыка перашкаджае запыту наладаў проксі-серверу

source: Set current global proxy
be: Усталяваць дзейны глабальны проксi

source: System policy prevents setting proxy settings
be: Сістэмная палітыка перашкаджае ўсталяванню параметраў проксі-серверу

source: Set current global proxy exception
be: Усталяваць выключэнне для дзейнага глабальнага проксі

source: System policy prevents setting no_proxy settings
be: Сістэмная палітыка перашкаджае ўсталяванню параметраў без проксі-серверу

source: Set current global keyboard
be: Усталяваць дзейную глабальную клавіятуру

source: System policy prevents setting global keyboard settings
be: Сістэмная палітыка перашкаджае ўсталяванню глабальных параметраў клавіятуры

source: Get current global keyboard
be: Атрымаць дзейную глабальную клавіятуру

source: System policy prevents querying keyboard settings
be: Сістэмная палітыка перашкаджае запыту наладаў клавіятуры

source: Check if the package system is locked
be: Праверце, ці не заблакаваная сістэма пакетаў

source: System policy prevents querying package system lock
be: Сістэмная палітыка перашкаджае запыту блакавання сістэмы пакетаў
