Repository: PlagaMedicum/Ubuntu-Translation-Demo
Catalog: rosetta-eoan/*/LC_MESSAGES/unity-lens-photos.po
Languages: be

source: Sorry, there are no photos that match your search.
be: На жаль фотаздымкаў паводле вашага запыту не знойдзена

source: My Photos
be: Мае фотаздымкі

source: Friends Photos
be: Фотаздымкі сяброў

source: Online Photos
be: Фотаздымкі ў сеціве

source: Photos
be: Фотаздымкі

source: Recent
be: Кагадзе прагляданыя

source: Date
be: Прагледжаныя

source: Last 7 days
be: За 7 дзён

source: Last 30 days
be: За 30 дзён

source: Last 6 months
be: За 6 месяцаў

source: Older
be: Раней

source: Location
be: Месцазнаходжанне

source: Album
be: Альбом

source: With
be: З

source: View
be: Праглядзець

source: By %s, %s
be: Стварыў %s, %s

source: Camera
be: Камера

source: Dimensions
be: Памеры

source: Size
be: Памер

source: License
be: Ліцэнзія

source: This Computer
be: Гэты кампʼютар

source: <b>This photo is missing.</b> You can open Shotwell to retrieve it or remove it from your library.
be: <b>Гэты здымак прамінуты</b> Вы можаце адчыніць Showell, каб знайсці яго ці выдаліць з бібліятэкі.

source: %s x %s pixels
be: %s x %s піксэляў

source: Tags
be: Тэгі

source: Show in Folder
be: Паказаць у папцы

source: Email
be: Пошта

source: Print
be: Друкаваць

source: Open Shotwell
be: Адкрыць Shotwell

source: This is an Ubuntu search plugin that enables information from Flickr to be searched and displayed in the Dash underneath the Photos header. If you do not wish to search this content source, you can disable this search plugin.
be: Гэта дадатак пошуку Ubuntu, з дапамогай якога вы зможаце шукаць дадзеныя ў Flickr і праглядаць іх на панэлі старонка "Фотаздымкі". Калі вам не патрэбны пошук у гэтай крыніцы дадзеных, вы можаце адключыць гэты дадатак пошуку.

source: Search Flickr
be: Пошук па Flickr

source: This is an Ubuntu search plugin that enables information from Facebook to be searched and displayed in the Dash underneath the Photos header. If you do not wish to search this content source, you can disable this search plugin.
be: Гэта дадатак пошуку Ubuntu, з дапамогай якога вы зможаце шукаць дадзеныя ў Facebook і праглядаць іх на панэлі старонка "Фотаздымкі". Калі вам не патрэбны пошук у гэтай крыніцы дадзеных, вы можаце адключыць гэты дадатак пошуку.

source: Search Facebook
be: Пошук па Facebook

source: This is an Ubuntu search plugin that enables information from Shotwell to be searched and displayed in the Dash underneath the Photos header. If you do not wish to search this content source, you can disable this search plugin.
be: Гэта дадатак пошуку Ubuntu, з дапамогай якога вы зможаце шукаць дадзеныя ў Shotwell і праглядаць іх на панэлі старонка "Фотаздымкі". Калі вам не патрэбны пошук у гэтай крыніцы дадзеных, вы можаце адключыць гэты дадатак пошуку.

source: Search Shotwell
be: Пошук па Shotwell

source: This is an Ubuntu search plugin that enables information from Picasa to be searched and displayed in the Dash underneath the Photos header. If you do not wish to search this content source, you can disable this search plugin.
be: Гэта дадатак пошуку Ubuntu, з дапамогай якога вы зможаце шукаць дадзеныя ў Picasa і праглядаць іх на панэлі старонка "Фотаздымкі". Калі вам не патрэбны пошук у гэтай крыніцы дадзеных, вы можаце адключыць гэты дадатак пошуку.

source: Search Picasa
be: Пошук па Picasa

source: Photos search plugin
be: Убудова пошуку фотаздымкаў

source: Search your and your friends' Flickr photos
be: Знайдзіце свае фотаздымкі і фатаздымкі сяброў у Flickr

source: Search your and your friends' Facebook photos
be: Знайдзіце свае фотаздымкі і фатаздымкі сяброў у Facebook

source: Search your Picasa photos
be: Знайдзіце свае фотаздымкі ў Picasa
