Repository: PlagaMedicum/Ubuntu-Translation-Demo
Catalog: rosetta-eoan/*/LC_MESSAGES/whois.po
Languages: be

source: Version %s. Report bugs to %s.
be: Вэрсія %s. Паведамляйце пра памылкі на %s.

source: This TLD has no whois server, but you can access the whois database at
be: Гэты TLD ня мае whois паслужніка, але вы можаце атрымаць доступ да базы на

source: This TLD has no whois server.
be: Гэты TLD ня мае whois паслужніка.

source: No whois server is known for this kind of object.
be: Паслужнік whois для аб'ектаў гэтага тыпу невядомы.

source: Unknown AS number or IP network. Please upgrade this program.
be: Невядомы AS нумар ці IP сетка. Калі ласка, абнавіце гэтую праграму.

source: Using server %s.
be: Выкарыстоўваецца паслужнік %s.

source: Querying for the IPv4 endpoint %s of a 6to4 IPv6 address.
be: Запыт IPv4 канца %s у адраса 6to4 IPv6.

source: Querying for the IPv4 endpoint %s of a Teredo IPv6 address.
be: Запыт канца IPv4 %s у адрасе Teredo IPv6.

source: Query string: "%s"
be: Радок запыта: "%s"

source: Found a referral to %s.
be: Знойдзены накіравальнік да %s.

source: Cannot parse this line: %s
be: Немагчыма разабраць радок: %s

source: Warning: RIPE flags used with a traditional server.
be: Увага! Сьцягі RIPE выкарыстоўваюцца для традыцыйнага паслужніка.

source: Catastrophic error: disclaimer text has been changed. Please upgrade this program.
be: Катастрафічная памылка: адмаўленьне было зьменена. Калі ласка, абнавіце праграму.

source: Host %s not found.
be: Вузел %s ня знойдзены.

source: %s/tcp: unknown service
be: %s/tcp: невядомая паслуга

source: Timeout.
be: Час выйшаў.

source: Interrupted by signal %d...
be: Абарвана сыгналам %d...

source: Invalid number '%s'.
be: Нерэчаісны нумар "%s".

source: Try '%s --help' for more information.
be: Паспрабуйце "%s --help" для больш падрабязных зьвестак.

source: Illegal salt character '%c'.
be: Нераэчаісны сымбаль прыправы "%c".

source: Password:
be: Пароль:

source: Usage: mkpasswd [OPTIONS]... [PASSWORD [SALT]] Crypts the PASSWORD using crypt(3).
be: Выкарыстаньне: mkpasswd [ОПЦЫІ]... [ПАРОЛЬ [ПРЫПРАВА]] Шыфруе ПАРОЛЬ з дапамогай crypt(3).
