Repository: PlagaMedicum/Ubuntu-Translation-Demo
Catalog: rosetta-eoan/*/LC_MESSAGES/xdg-user-dirs-gtk.po
Languages: be

source: Update standard folders to current language?
be: Абнавіць назвы стандартных каталогаў у адпаведнасці з бягучай мовай інтэрфэйсу?

source: You have logged in in a new language. You can automatically update the names of some standard folders in your home folder to match this language. The update would change the following folders:
be: Вы ўвайшлі з новай мовай інтэрфейсу. Вы можаце аўтаматычна абнавіць назвы некаторых стандартных папак, якія знаходзяцца ў вашам хатнім каталоге, на гэту мову. Абнаўленне назваў закране наступныя папкі:

source: _Keep Old Names
be: _Пакінуць старыя назвы

source: _Update Names
be: _Абнавіць назвы

source: Current folder name
be: Бягучая назва папкі

source: New folder name
be: Новая назва папкі

source: Note that existing content will not be moved.
be: Звярніце ўвагу, што існуючае змесціва не будзе перамешчана.

source: _Don't ask me this again
be: _Больш не пытацца пра гэта

source: There was an error updating the folders
be: Адбылася памылка пры абнаўленні назваў папак

source: User folders update
be: Абнаўленне карыстальніцкіх каталогаў

source: Update common folders names to match current locale
be: Абнавіць назвы стандартных каталогаў у адпаведнасці з бягучым месцазнаходжаннем
